#ifndef UE4SS_SDK_Wrestler_HPP
#define UE4SS_SDK_Wrestler_HPP

#include "Wrestler_enums.hpp"

struct FAbilityDataStruct
{
    EWrestlerAbilitySlot AbilitySlot;                                                 // 0x0000 (size: 0x1)
    class UWrestlerAbilityDefinition* AbilityDefinition;                              // 0x0008 (size: 0x8)
    FRowIDAbilityProperty abilityPropertyRowID;                                       // 0x0010 (size: 0x8)

}; // Size: 0x18

struct FAimAssistTargetSettingsStruct
{
    float TargetDistance;                                                             // 0x0000 (size: 0x4)
    float MinDegreeAngle;                                                             // 0x0004 (size: 0x4)
    float MaxDegreeAngle;                                                             // 0x0008 (size: 0x4)
    float MaxPitchDegreeAngle;                                                        // 0x000C (size: 0x4)
    float DistanceWeightMultiplier;                                                   // 0x0010 (size: 0x4)
    float AngleWeightMultiplier;                                                      // 0x0014 (size: 0x4)
    float MaxAnglePotentialTarget_ReticleOnly;                                        // 0x0018 (size: 0x4)
    bool bShouldBeReachable;                                                          // 0x001C (size: 0x1)
    TEnumAsByte<ECollisionChannel> SphereOverlapQueryChannel;                         // 0x001D (size: 0x1)
    TEnumAsByte<ECollisionChannel> ReachableLineTraceQueryChannel;                    // 0x001E (size: 0x1)
    bool bShouldUseSocket;                                                            // 0x001F (size: 0x1)
    FName SocketName;                                                                 // 0x0020 (size: 0x8)
    FGameplayTag PauseAimAssistTag;                                                   // 0x0028 (size: 0x8)
    FGameplayTag AimAssistActiveStateTag;                                             // 0x0030 (size: 0x8)
    FGameplayTagContainer AimAssistBlockedTags;                                       // 0x0038 (size: 0x20)
    FVector TargetLocationOffset;                                                     // 0x0058 (size: 0x18)
    float MaxYawDegreeAngleForLockOn;                                                 // 0x0070 (size: 0x4)
    float StrengthAlphaFadeTime;                                                      // 0x0074 (size: 0x4)
    float PreLockOnYawStrength;                                                       // 0x0078 (size: 0x4)
    float LockedOnYawStrength;                                                        // 0x007C (size: 0x4)
    class UCurveFloat* YawStrengthCurve;                                              // 0x0080 (size: 0x8)
    bool bUsePitchLockedOn;                                                           // 0x0088 (size: 0x1)
    float PreLockOnPitchStrength;                                                     // 0x008C (size: 0x4)
    float LockedOnPitchStrength;                                                      // 0x0090 (size: 0x4)
    class UCurveFloat* PitchStrengthCurve;                                            // 0x0098 (size: 0x8)
    float UnlockLookInputThreshold;                                                   // 0x00A0 (size: 0x4)
    float UnlockPercentageOfTargetDistance;                                           // 0x00A4 (size: 0x4)
    TSubclassOf<class AGameplayAbilityWorldReticle> LockedOnReticleType;              // 0x00A8 (size: 0x8)
    TSubclassOf<class AGameplayAbilityWorldReticle> ChosenTargetReticleType;          // 0x00B0 (size: 0x8)
    TSubclassOf<class AGameplayAbilityWorldReticle> PotentialTargetReticleType;       // 0x00B8 (size: 0x8)

}; // Size: 0xC0

struct FApplyDamageParams
{
    FGameplayTag DamageTag;                                                           // 0x0000 (size: 0x8)
    class AActor* Instigator;                                                         // 0x0008 (size: 0x8)
    FGameplayTag DamageTypeTag;                                                       // 0x0010 (size: 0x8)
    FGameplayTag DeathBehaviourTag;                                                   // 0x0018 (size: 0x8)
    bool bNoDeath;                                                                    // 0x0020 (size: 0x1)
    bool bShouldExecute;                                                              // 0x0021 (size: 0x1)

}; // Size: 0x28

struct FAudioImpact
{
    TEnumAsByte<EPhysicalSurface> SurfaceType;                                        // 0x0000 (size: 0x1)
    FHitResult Hit;                                                                   // 0x0008 (size: 0xE8)
    FVector ImpactLocation;                                                           // 0x00F0 (size: 0x18)
    FVector ImpactNormal;                                                             // 0x0108 (size: 0x18)
    float ImpactMagnitude;                                                            // 0x0120 (size: 0x4)
    FGameplayTag ImpactTag;                                                           // 0x0124 (size: 0x8)

}; // Size: 0x130

struct FBufferToCapture
{
    EBufferName Buffer;                                                               // 0x0000 (size: 0x4)
    class UTextureRenderTarget2D* TextureTarget;                                      // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FCharacterSequenceData
{
    class AActor* TransformOriginActor;                                               // 0x0000 (size: 0x8)
    FTransform TransformOrigin;                                                       // 0x0010 (size: 0x60)
    float BlendInTime;                                                                // 0x0070 (size: 0x4)
    float BlendOutTime;                                                               // 0x0074 (size: 0x4)
    bool bDisableCollisions;                                                          // 0x0078 (size: 0x1)

}; // Size: 0x80

struct FCodexItemDetail
{
}; // Size: 0x78

struct FCoreData
{
    class UInputMappingContext* PrimaryMappingContext;                                // 0x0000 (size: 0x8)
    class UControlsDisplayData* DisplayData;                                          // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FDebugEnemyTaskScores
{
    TMap<class FName, class FDebugTaskScores> EnemyTaskScores;                        // 0x0000 (size: 0x50)
    TMap<class FName, class FDebugTaskScores> ChosenTaskScore;                        // 0x0050 (size: 0x50)

}; // Size: 0xA0

struct FDebugTaskScoreData
{
}; // Size: 0x30

struct FDebugTaskScoreItem
{
    FString Item;                                                                     // 0x0000 (size: 0x10)
    float Value;                                                                      // 0x0010 (size: 0x4)

}; // Size: 0x18

struct FDebugTaskScoreItems
{
    TArray<FDebugTaskScoreItem> TaskScoreItems;                                       // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FDebugTaskScores
{
    TMap<class FGameplayTag, class FDebugTaskScoreItems> TaskScores;                  // 0x0000 (size: 0x50)

}; // Size: 0x50

struct FDebugTaskTypeEnemyTaskScores
{
    TMap<class FGameplayTag, class FDebugEnemyTaskScores> TaskTypeEnemyTaskScores;    // 0x0000 (size: 0x50)
    FGameplayTagContainer TaskTypeTagsToRemove;                                       // 0x0050 (size: 0x20)

}; // Size: 0x70

struct FDifficulty
{
    TSoftClassPtr<UGameplayEffect> DifficultyAttributeEffect;                         // 0x0000 (size: 0x28)

}; // Size: 0x28

struct FDigestedAttractionProperties
{
}; // Size: 0x1

struct FDigestedFearProperties
{
}; // Size: 0x4

struct FDigestedRepulsionProperties
{
}; // Size: 0x1

struct FEffectMagnitudes
{
    TMap<int32, float> Magnitudes;                                                    // 0x0000 (size: 0x50)

}; // Size: 0x50

struct FEffectMagnitudesContainer
{
    TMap<class FGameplayTag, class FEffectMagnitudes> Container;                      // 0x0000 (size: 0x50)

}; // Size: 0x50

struct FEffectMagnitudesTag
{
    FGameplayTag MagnitudeTagSetByCaller;                                             // 0x0000 (size: 0x8)
    FGameplayTag MagnitudeTagOnTheMagnitudesContainer;                                // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FEffectModifier
{
    TArray<FEffectMagnitudesTag> MagnitudesTag;                                       // 0x0000 (size: 0x10)
    EEffectOperation Operation;                                                       // 0x0010 (size: 0x1)

}; // Size: 0x18

struct FEffectsMap
{
    TMap<class TSubclassOf<UGameplayEffect>, class FEffectModifier> Container;        // 0x0000 (size: 0x50)

}; // Size: 0x50

struct FEnemySequenceData
{
    TSoftObjectPtr<ULevelSequence> Sequence;                                          // 0x0000 (size: 0x28)
    bool bSpawnSequence;                                                              // 0x0028 (size: 0x1)
    float SequenceBlendInTime;                                                        // 0x002C (size: 0x4)
    float SequenceBlendOutTime;                                                       // 0x0030 (size: 0x4)
    bool bInterruptable;                                                              // 0x0034 (size: 0x1)

}; // Size: 0x38

struct FEnemySquad
{
    class AWrestlerEnemyCharacter* Leader;                                            // 0x0000 (size: 0x8)
    TArray<class AWrestlerEnemyCharacter*> Followers;                                 // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FEnemyToSpawn
{
    TSoftClassPtr<UWrestlerEnemyTypeDefinition> EnemyType;                            // 0x0000 (size: 0x28)
    TSoftClassPtr<UWrestlerEquipmentDefinition> WeaponDefinition;                     // 0x0028 (size: 0x28)
    TSoftObjectPtr<UAnimDataAsset> AnimationSet;                                      // 0x0050 (size: 0x28)
    TSoftObjectPtr<UWrestlerMovementSetData> MovementSet;                             // 0x0078 (size: 0x28)
    TSoftObjectPtr<UWrestlerConfigDataAsset_EnemyStats> EnemyStats;                   // 0x00A0 (size: 0x28)
    TArray<TSoftClassPtr<UGameplayEffect>> AdditionalDefaultEffects;                  // 0x00C8 (size: 0x10)

}; // Size: 0xD8

struct FEvaluatorDefaultBehaviorStruct
{
    TSoftObjectPtr<UBehaviorTree> DefaultBehaviour;                                   // 0x0000 (size: 0x28)
    TMap<class FName, class TSoftObjectPtr<UBehaviorTree>> EnemyTypeDefaultBehaviourOverride; // 0x0028 (size: 0x50)
    TMap<class FGameplayTag, class TSoftObjectPtr<UBehaviorTree>> HasTagDefaultBehaviourTagOverride; // 0x0078 (size: 0x50)

}; // Size: 0xC8

struct FGameplayAbilityTargetData_Interaction : public FGameplayAbilityTargetData_ActorArray
{
    FWrestlerInteractionTarget InteractionTarget;                                     // 0x00C0 (size: 0x10)

}; // Size: 0xD0

struct FGroupedPatrolPoints
{
    TArray<class AWrestlerEnemyPatrolPoint*> GroupedPatrolPoints;                     // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FHeraAutomataTestBackreferenceBootChainData
{
    TMap<class FString, class FHeraAutomataTestData_PerStep> Mapping;                 // 0x0000 (size: 0x50)

}; // Size: 0x50

struct FHeraAutomataTestBackreferenceStateChainData
{
    TArray<FHeraAutomataTestData_PerStep> Steps;                                      // 0x0000 (size: 0x10)
    TArray<FSoftClassPath> FilterTasks;                                               // 0x0010 (size: 0x10)
    TArray<FSoftClassPath> FilterStates;                                              // 0x0020 (size: 0x10)

}; // Size: 0x30

struct FHeraAutomataTestData
{
    TSoftObjectPtr<UWorld> Map;                                                       // 0x0000 (size: 0x28)
    int32 StartingStep;                                                               // 0x0028 (size: 0x4)
    int32 LastStep;                                                                   // 0x002C (size: 0x4)
    TArray<FHeraAutomataTestData_PerStep> Steps;                                      // 0x0030 (size: 0x10)

}; // Size: 0x40

struct FHeraAutomataTestData_PerStep
{
    FString TestLabel;                                                                // 0x0000 (size: 0x10)
    TArray<FString> Nodes;                                                            // 0x0010 (size: 0x10)
    TArray<TSoftObjectPtr<UHeraAutomataObjective>> ObjectivesToTriggerPostCheck;      // 0x0020 (size: 0x10)

}; // Size: 0x30

struct FHeraAutomataTestFlowData
{
    TSoftObjectPtr<UWorld> Map;                                                       // 0x0000 (size: 0x28)
    TArray<FString> ExpectedStates;                                                   // 0x0028 (size: 0x10)
    bool bDumpStateHistory;                                                           // 0x0038 (size: 0x1)
    int32 TimeLimitInSeconds;                                                         // 0x003C (size: 0x4)
    int32 StartingStep;                                                               // 0x0040 (size: 0x4)
    int32 LastStep;                                                                   // 0x0044 (size: 0x4)
    bool bSkipStepsCheck;                                                             // 0x0048 (size: 0x1)
    TArray<FHeraAutomataTestData_PerStep> Steps;                                      // 0x0050 (size: 0x10)

}; // Size: 0x60

struct FInputMappingData
{
    class UInputAction* DependentPlayerAction;                                        // 0x0000 (size: 0x8)
    class UInputAction* PlayerAction;                                                 // 0x0008 (size: 0x8)
    FWrestlerInputMappingPair DefaultKey_MK;                                          // 0x0010 (size: 0x30)
    FName ID;                                                                         // 0x0040 (size: 0x8)
    FKey DefaultKey_C_Primary;                                                        // 0x0048 (size: 0x18)
    FKey DefaultKey_C_Secondary;                                                      // 0x0060 (size: 0x18)
    bool bRemappableMouseKeyboard;                                                    // 0x0078 (size: 0x1)
    bool bRemappableGamepad;                                                          // 0x0079 (size: 0x1)
    bool bShowOnMouseKeyboard;                                                        // 0x007A (size: 0x1)
    bool bShowOnGamepad;                                                              // 0x007B (size: 0x1)
    bool bShowOnMouseKeyboardSpecial;                                                 // 0x007C (size: 0x1)
    bool bShowOnGamepadSpecial;                                                       // 0x007D (size: 0x1)

}; // Size: 0x90

struct FInteractionAnimData
{
    TSoftObjectPtr<ULevelSequence> Sequence;                                          // 0x0000 (size: 0x28)
    float SequenceBlendInTime;                                                        // 0x0028 (size: 0x4)
    float SequenceBlendOutTime;                                                       // 0x002C (size: 0x4)
    TSoftObjectPtr<UAnimMontage> Montage;                                             // 0x0030 (size: 0x28)
    bool bStartCrouched;                                                              // 0x0058 (size: 0x1)
    bool bUseLoadingTimes;                                                            // 0x0059 (size: 0x1)
    FInteractionAnimLoadingTimes LoadingTimes;                                        // 0x005C (size: 0x8)

}; // Size: 0x68

struct FInteractionAnimLoadingTimes
{
    float LoadStartTime;                                                              // 0x0000 (size: 0x4)
    float LoadTime;                                                                   // 0x0004 (size: 0x4)

}; // Size: 0x8

struct FLightningStrikeTierConfig
{
    float TargetRange;                                                                // 0x0000 (size: 0x4)
    int32 MaxPunchCount;                                                              // 0x0004 (size: 0x4)
    float TimeDilation;                                                               // 0x0008 (size: 0x4)
    float TargetTimeoutSeconds;                                                       // 0x000C (size: 0x4)
    float LockOnTime;                                                                 // 0x0010 (size: 0x4)
    float SwitchTargetSearchAngle;                                                    // 0x0014 (size: 0x4)
    float MinAngle;                                                                   // 0x0018 (size: 0x4)
    int32 MaxChainCount;                                                              // 0x001C (size: 0x4)
    float CriticalHitDamageAmount;                                                    // 0x0020 (size: 0x4)
    float CriticalHitChancePercentage;                                                // 0x0024 (size: 0x4)
    TMap<int32, float> HitDamageAmount;                                               // 0x0028 (size: 0x50)
    TMap<int32, float> StunDamageAmount;                                              // 0x0078 (size: 0x50)
    float FearDuration;                                                               // 0x00C8 (size: 0x4)
    float FearStrength;                                                               // 0x00CC (size: 0x4)

}; // Size: 0xD0

struct FLoadingTipData
{
    TArray<FText> TipTitle;                                                           // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FLocalizationKey
{
    FName RowID;                                                                      // 0x0000 (size: 0x8)

}; // Size: 0x8

struct FPrevAssignedSearchRoutes
{
}; // Size: 0x10

struct FRadialMenuMeterialParamData
{
    FName ParameterName;                                                              // 0x0000 (size: 0x8)
    float ParameterValue;                                                             // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FRangedProjectileParams
{
    TSubclassOf<class AWrestlerRangedProjectile> ProjectileClass;                     // 0x0000 (size: 0x8)
    FVector StartLocation;                                                            // 0x0008 (size: 0x18)
    FRotator StartRotation;                                                           // 0x0020 (size: 0x18)
    class APawn* Instigator;                                                          // 0x0038 (size: 0x8)
    TArray<class AActor*> ActorsToIgnore;                                             // 0x0040 (size: 0x10)
    float ProjectileDamage;                                                           // 0x0050 (size: 0x4)
    float Speed;                                                                      // 0x0054 (size: 0x4)
    float MaxDistance;                                                                // 0x0058 (size: 0x4)

}; // Size: 0x60

struct FRangedProjectilePool
{
    TArray<class AWrestlerRangedProjectile*> Projectiles;                             // 0x0000 (size: 0x10)

}; // Size: 0x18

struct FRowIDAbilityProperty
{
    FName RowID;                                                                      // 0x0000 (size: 0x8)

}; // Size: 0x8

struct FRowIconID
{
    FName RowID;                                                                      // 0x0000 (size: 0x8)

}; // Size: 0x8

struct FSequenceContainer
{
    TArray<TSoftObjectPtr<ULevelSequence>> Sequences;                                 // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FSkelMeshMergeSectionMapping_BP
{
    TArray<int32> SectionIDs;                                                         // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FSkeletalMeshMergeParams
{
    TArray<FSkelMeshMergeSectionMapping_BP> MeshSectionMappings;                      // 0x0000 (size: 0x10)
    TArray<FSkelMeshMergeUVTransformMapping> UVTransformsPerMesh;                     // 0x0010 (size: 0x10)
    TArray<class USkeletalMesh*> MeshesToMerge;                                       // 0x0020 (size: 0x10)
    int32 StripTopLODS;                                                               // 0x0030 (size: 0x4)
    uint8 bNeedsCpuAccess;                                                            // 0x0034 (size: 0x1)
    uint8 bSkeletonBefore;                                                            // 0x0034 (size: 0x1)
    class USkeleton* Skeleton;                                                        // 0x0038 (size: 0x8)
    FName MeshName;                                                                   // 0x0040 (size: 0x8)

}; // Size: 0x48

struct FSkillNode
{
    FName NodeName;                                                                   // 0x0000 (size: 0x8)
    FName NodeDescription;                                                            // 0x0008 (size: 0x8)
    class UTexture2D* NodeImg;                                                        // 0x0010 (size: 0x8)
    int32 bloodPoints;                                                                // 0x0018 (size: 0x4)
    ENodeStatus NodeStatus;                                                           // 0x001C (size: 0x1)
    FVector2D NodePos;                                                                // 0x0020 (size: 0x10)

}; // Size: 0x30

struct FSkinTone
{
    class UMaterialInterface* HeadSkintoneMaterial;                                   // 0x0000 (size: 0x8)
    class UMaterialInterface* ArmsSkintoneMaterial;                                   // 0x0008 (size: 0x8)
    class UMaterialInterface* BodySkintoneMaterial;                                   // 0x0010 (size: 0x8)
    class UMaterialInterface* LegsSkintoneMaterial;                                   // 0x0018 (size: 0x8)
    FVector ToneValue;                                                                // 0x0020 (size: 0x18)

}; // Size: 0x38

struct FSystemNotificationStruct
{
    FText Title;                                                                      // 0x0000 (size: 0x18)
    FText Message;                                                                    // 0x0018 (size: 0x18)
    class UObject* ObjectToBind;                                                      // 0x0030 (size: 0x8)
    FName OnConfirmFunctionName;                                                      // 0x0038 (size: 0x8)
    FName OnCancelFunctionName;                                                       // 0x0040 (size: 0x8)

}; // Size: 0x48

struct FTrainingCost
{
    EWrestlerGrantedPointsType CostType;                                              // 0x0000 (size: 0x1)
    int32 CostAmount;                                                                 // 0x0004 (size: 0x4)

}; // Size: 0x8

struct FVariationMontages
{
    TArray<class UAnimMontage*> Montages;                                             // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FWrestleAnimationsContainer
{
    TArray<FWrestlerGenderAnimationData> AnimationChances;                            // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FWrestlerAIAttractionEvent
{
    FWrestlerAIStimulusEvent BaseEvent;                                               // 0x0000 (size: 0x30)

}; // Size: 0x38

struct FWrestlerAIFearActor
{
    class UWrestlerFearEmitterComponent* FearEmitter;                                 // 0x0000 (size: 0x8)

}; // Size: 0x10

struct FWrestlerAIFearEvent
{
    FWrestlerAIStimulusEvent BaseEvent;                                               // 0x0000 (size: 0x30)
    float FearStrength;                                                               // 0x0030 (size: 0x4)
    float MaxRange;                                                                   // 0x0034 (size: 0x4)

}; // Size: 0x38

struct FWrestlerAINoiseEvent
{
    FVector NoiseLocation;                                                            // 0x0008 (size: 0x18)
    float Loudness;                                                                   // 0x0020 (size: 0x4)
    float MaxRange;                                                                   // 0x0024 (size: 0x4)
    class AActor* Instigator;                                                         // 0x0028 (size: 0x8)
    FGameplayTag Tag;                                                                 // 0x0030 (size: 0x8)

}; // Size: 0x40

struct FWrestlerAIRepulsionEvent
{
    FWrestlerAIStimulusEvent BaseEvent;                                               // 0x0000 (size: 0x30)

}; // Size: 0x38

struct FWrestlerAISightEvent
{
    FVector EventLocation;                                                            // 0x0008 (size: 0x18)
    FVector PredictedLocation;                                                        // 0x0020 (size: 0x18)
    float MaxRange;                                                                   // 0x0038 (size: 0x4)
    class AActor* Instigator;                                                         // 0x0040 (size: 0x8)
    FGameplayTag Tag;                                                                 // 0x0048 (size: 0x8)

}; // Size: 0x58

struct FWrestlerAISpawnerData
{
    class AWrestlerEnemyPatrolRoute* PatrolRoute_OLD;                                 // 0x0000 (size: 0x8)
    TSoftObjectPtr<AWrestlerPatrolRoute> Route;                                       // 0x0008 (size: 0x28)
    class UHeraMissionObjective* DeathObjective;                                      // 0x0030 (size: 0x8)
    class UHeraMissionObjective* StunObjective;                                       // 0x0038 (size: 0x8)
    class UHeraMissionObjective* AwareOfPlayerObjective;                              // 0x0040 (size: 0x8)
    class UHeraMissionObjective* DetectedPlayerObjective;                             // 0x0048 (size: 0x8)
    class UHeraMissionObjective* TKedObjective;                                       // 0x0050 (size: 0x8)
    FName DespawnTag;                                                                 // 0x0058 (size: 0x8)
    FGameplayTag DialogueCharacterTag;                                                // 0x0060 (size: 0x8)
    bool bForceEnemyState;                                                            // 0x0068 (size: 0x1)
    bool bEnabledUVGlow;                                                              // 0x0069 (size: 0x1)
    TSoftObjectPtr<UWrestlerModularCharacterProfile> ModularCharacterProfileOverride; // 0x0070 (size: 0x28)
    EnemyStartState EnemyStartState;                                                  // 0x0098 (size: 0x1)
    FGameplayTagContainer TagsToApply;                                                // 0x00A0 (size: 0x20)
    bool bPreventDeadEnemyRespawn;                                                    // 0x00C0 (size: 0x1)

}; // Size: 0xC8

struct FWrestlerAIStimulusEvent
{
    float Age;                                                                        // 0x0000 (size: 0x4)
    FVector SenseLocation;                                                            // 0x0008 (size: 0x18)
    class AActor* Instigator;                                                         // 0x0020 (size: 0x8)
    FName Tag;                                                                        // 0x0028 (size: 0x8)

}; // Size: 0x30

struct FWrestlerAbilityDataStruct : public FTableRowBase
{
    FText AbilityName;                                                                // 0x0008 (size: 0x18)
    TSoftObjectPtr<UTexture2D> AbilityIcon;                                           // 0x0020 (size: 0x28)
    FText Description;                                                                // 0x0048 (size: 0x18)
    int32 BaseCost;                                                                   // 0x0060 (size: 0x4)
    int32 DecreasedCost;                                                              // 0x0064 (size: 0x4)
    int32 IncreasedCost;                                                              // 0x0068 (size: 0x4)
    TArray<EPlayerClan> ClanModifiers;                                                // 0x0070 (size: 0x10)
    TArray<FTrainingCost> AbilityTrainingCost;                                        // 0x0080 (size: 0x10)
    FProgressBarStyle AbilityFillingStyle;                                            // 0x0090 (size: 0x290)
    TSubclassOf<class UCommonButtonStyle> LockedButtonStyle;                          // 0x0320 (size: 0x8)
    TSubclassOf<class UCommonButtonStyle> UnlockedButtonStyle;                        // 0x0328 (size: 0x8)
    TSubclassOf<class UCommonButtonStyle> AcquiredButtonStyle;                        // 0x0330 (size: 0x8)
    TSubclassOf<class UCommonButtonStyle> AcquiredButtonStyle_Small;                  // 0x0338 (size: 0x8)
    TSubclassOf<class UCommonButtonStyle> LockedButtonStyle_Small;                    // 0x0340 (size: 0x8)
    TSubclassOf<class UCommonButtonStyle> UnlockedButtonStyle_Small;                  // 0x0348 (size: 0x8)
    TSubclassOf<class UCommonButtonStyle> UnaivalableButtonStyle_Small;               // 0x0350 (size: 0x8)
    class UWrestlerAbilityDefinition* AbilityDefinition;                              // 0x0358 (size: 0x8)
    TSoftObjectPtr<UMediaSource> AbilityVideoclip;                                    // 0x0360 (size: 0x28)
    int32 ClanValue;                                                                  // 0x0388 (size: 0x4)
    FGameplayTag AbilityTier;                                                         // 0x038C (size: 0x8)
    FGameplayTag CostumeTag;                                                          // 0x0394 (size: 0x8)
    class UHeraPropertyBool* EnabledProperty;                                         // 0x03A0 (size: 0x8)
    TArray<EWrestlerClanDiscipline> AbilityDisciplines;                               // 0x03A8 (size: 0x10)
    FString RowFileName;                                                              // 0x03B8 (size: 0x10)
    TArray<FString> UnlockDependenciesAbilityRows;                                    // 0x03C8 (size: 0x10)

}; // Size: 0x3E0

struct FWrestlerAbilityInput
{
    uint8 bAbilityWheel;                                                              // 0x0000 (size: 0x1)
    int32 AbilitySlot;                                                                // 0x0004 (size: 0x4)
    EWrestlerAbilitySlot NewControlsAbilitySlot;                                      // 0x0008 (size: 0x1)
    FVector2D AbilitySelectDirection;                                                 // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FWrestlerAbilityMoveTo
{
    FVector TargetLocationOffset;                                                     // 0x0000 (size: 0x18)
    float MaximumHeightOffset;                                                        // 0x0018 (size: 0x4)
    bool bMoveToFallingTarget;                                                        // 0x001C (size: 0x1)
    ERootMotionMoveToActorTargetOffsetType OffsetAlignment;                           // 0x001D (size: 0x1)
    float Delay;                                                                      // 0x0020 (size: 0x4)
    float Duration;                                                                   // 0x0024 (size: 0x4)
    float MaxRange;                                                                   // 0x0028 (size: 0x4)
    float MinRange;                                                                   // 0x002C (size: 0x4)
    class UCurveFloat* TargetLerpSpeedHorizontal;                                     // 0x0030 (size: 0x8)
    class UCurveFloat* TargetLerpSpeedVertical;                                       // 0x0038 (size: 0x8)
    bool bSetNewMovementMode;                                                         // 0x0040 (size: 0x1)
    TEnumAsByte<EMovementMode> MovementMode;                                          // 0x0041 (size: 0x1)
    bool bRestrictSpeedToExpected;                                                    // 0x0042 (size: 0x1)
    class UCurveVector* PathOffsetCurve;                                              // 0x0048 (size: 0x8)
    class UCurveFloat* TimeMappingCurve;                                              // 0x0050 (size: 0x8)
    ERootMotionFinishVelocityMode VelocityOnFinishMode;                               // 0x0058 (size: 0x1)
    FVector SetVelocityOnFinish;                                                      // 0x0060 (size: 0x18)
    float ClampVelocityOnFinish;                                                      // 0x0078 (size: 0x4)
    bool bDisableDestinationReachedInterrupt;                                         // 0x007C (size: 0x1)
    bool bCanTimeOut;                                                                 // 0x007D (size: 0x1)
    bool bInterruptBeforeDestinationReached;                                          // 0x007E (size: 0x1)
    bool bMoveToWhenNotInRange;                                                       // 0x007F (size: 0x1)
    float VelocityWhenNotInRange;                                                     // 0x0080 (size: 0x4)
    bool bIgnoreDodge;                                                                // 0x0084 (size: 0x1)
    bool bIgnoreHeightFromDistanceCheck;                                              // 0x0085 (size: 0x1)
    bool bEnableGravity;                                                              // 0x0086 (size: 0x1)
    bool bUseAIMoveTo;                                                                // 0x0087 (size: 0x1)

}; // Size: 0x88

struct FWrestlerAbilityRotate
{
    FVector LocationToFace;                                                           // 0x0000 (size: 0x18)
    FRotator RotatorOverride;                                                         // 0x0018 (size: 0x18)
    float Duration;                                                                   // 0x0030 (size: 0x4)
    float Precision;                                                                  // 0x0034 (size: 0x4)
    bool bUsePrecision;                                                               // 0x0038 (size: 0x1)
    float Delay;                                                                      // 0x003C (size: 0x4)
    bool bIgnoreDodge;                                                                // 0x0040 (size: 0x1)
    bool bUseAISetFocus;                                                              // 0x0041 (size: 0x1)

}; // Size: 0x48

struct FWrestlerAbilitySequenceTaskData
{
    FName SequenceName;                                                               // 0x0000 (size: 0x8)
    float Weighting;                                                                  // 0x0008 (size: 0x4)
    TArray<TSoftClassPtr<UWrestlerGameplayAbility>> TaskSequence;                     // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FWrestlerAbilitySet_GameplayAbility
{
    TSoftClassPtr<UWrestlerGameplayAbility> Ability;                                  // 0x0000 (size: 0x28)

}; // Size: 0x28

struct FWrestlerAbilitySet_GameplayEffect
{
    TSubclassOf<class UGameplayEffect> GameplayEffect;                                // 0x0000 (size: 0x8)
    float EffectLevel;                                                                // 0x0008 (size: 0x4)
    bool bSetByCaller;                                                                // 0x000C (size: 0x1)
    FGameplayTag DataTag;                                                             // 0x0010 (size: 0x8)

}; // Size: 0x18

struct FWrestlerAbilitySet_GrantedHandles
{
    TArray<FGameplayAbilitySpecHandle> AbilitySpecHandles;                            // 0x0000 (size: 0x10)
    TArray<FActiveGameplayEffectHandle> GameplayEffectHandles;                        // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FWrestlerAbilityTargetData : public FGameplayAbilityTargetData
{
}; // Size: 0x8

struct FWrestlerAchievementCollectableCounter
{
    int32 NumberToFind;                                                               // 0x0000 (size: 0x4)
    class UHeraPropertyInt* CounterProperty;                                          // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FWrestlerActorOcclusionData
{
}; // Size: 0x40

struct FWrestlerActorVisibilities
{
    TMap<class TSoftObjectPtr<AActor>, class FWrestlerActorVisibilitySaveData> Actors; // 0x0000 (size: 0x50)

}; // Size: 0x50

struct FWrestlerActorVisibilitySaveData
{
    EWrestlerChangeVisibilityCollisionState Visibility;                               // 0x0000 (size: 0x1)
    EWrestlerChangeVisibilityCollisionState Collision;                                // 0x0001 (size: 0x1)
    bool bPropagateToAttachedActors;                                                  // 0x0002 (size: 0x1)

}; // Size: 0x3

struct FWrestlerActorsGameplayTargetDataFilter : public FGameplayTargetDataFilter
{
    TArray<class TSubclassOf<AActor>> FilteredActors;                                 // 0x0020 (size: 0x10)

}; // Size: 0x30

struct FWrestlerAgentTask
{
    class AWrestlerEnemyCharacter* Agent;                                             // 0x0000 (size: 0x8)

}; // Size: 0x18

struct FWrestlerAnimationFragment : public FMassFragment
{
}; // Size: 0x18

struct FWrestlerAppliedEquipmentEntry
{
    TSubclassOf<class UWrestlerEquipmentDefinition> EquipmentDefinition;              // 0x0000 (size: 0x8)
    class UWrestlerEquipmentInstance* Instance;                                       // 0x0008 (size: 0x8)
    FWrestlerAbilitySet_GrantedHandles GrantedHandles;                                // 0x0010 (size: 0x20)

}; // Size: 0x30

struct FWrestlerAudioSplineRtpcModifier
{
    class UHeraPropertyBool* ModifierProperty;                                        // 0x0000 (size: 0x8)
    int32 StartIndex;                                                                 // 0x0008 (size: 0x4)
    TArray<float> ModifierValues;                                                     // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FWrestlerAudioSurfaceParameters
{
    class UAkSwitchValue* BaseSurfaceSwitch;                                          // 0x0000 (size: 0x8)
    class UAkSwitchValue* CoverSurfaceSwitch;                                         // 0x0008 (size: 0x8)
    float CoverSurfaceAmount;                                                         // 0x0010 (size: 0x4)
    float RvtOnlyWetnessAmount;                                                       // 0x0014 (size: 0x4)
    TEnumAsByte<EPhysicalSurface> BaseSurfaceType;                                    // 0x0018 (size: 0x1)
    TEnumAsByte<EPhysicalSurface> CoverSurfaceType;                                   // 0x0019 (size: 0x1)
    FVector CoverLocation;                                                            // 0x0020 (size: 0x18)

}; // Size: 0x38

struct FWrestlerAvoidanceFragment : public FMassFragment
{
    float MoveTargetOffsetSize;                                                       // 0x0000 (size: 0x4)
    FVector MoveTargetOffset;                                                         // 0x0008 (size: 0x18)

}; // Size: 0x40

struct FWrestlerAwarenessFragment : public FMassFragment
{
}; // Size: 0xD0

struct FWrestlerAwarenessTagTrackingData
{
    class AActor* Actor;                                                              // 0x0010 (size: 0x8)

}; // Size: 0x18

struct FWrestlerAwarenessTrackingData
{
    FAIStimulus LastStimulus;                                                         // 0x0020 (size: 0x58)

}; // Size: 0x78

struct FWrestlerBipedFragment : public FMassFragment
{
}; // Size: 0x1

struct FWrestlerBloodResonanceAssignment
{
    FGameplayTag Tag;                                                                 // 0x0000 (size: 0x8)
    float Weighting;                                                                  // 0x0008 (size: 0x4)
    class UHeraDialogueInfo* DialogueInfo;                                            // 0x0010 (size: 0x8)
    class UHeraDialogueInfo* AmbientInfo;                                             // 0x0018 (size: 0x8)
    bool bAllowConversations;                                                         // 0x0020 (size: 0x1)
    bool bAllowActivatedConversations;                                                // 0x0021 (size: 0x1)

}; // Size: 0x28

struct FWrestlerBloodResonanceEventActivatedInstanceData
{
    FSmartObjectClaimHandle ClaimedSlot;                                              // 0x0000 (size: 0x20)

}; // Size: 0x20

struct FWrestlerBloodResonanceEventActivatedTask : public FMassStateTreeTaskBase
{
}; // Size: 0x28

struct FWrestlerBloodResonanceEventData
{
    EWrestlerBloodResonanceEventParticipants ParticipantType;                         // 0x0000 (size: 0x4)
    TSoftClassPtr<AActor> SmartObjectBlueprintToSpawn;                                // 0x0008 (size: 0x28)
    FName EventName;                                                                  // 0x0030 (size: 0x8)
    FGameplayTag BloodResSmartObjectTag;                                              // 0x0038 (size: 0x8)
    uint8 MaxNumSpawnedAtOneTime;                                                     // 0x0040 (size: 0x1)
    float PercentChance;                                                              // 0x0044 (size: 0x4)
    uint16 MinTimeBetweenSpawns;                                                      // 0x0048 (size: 0x2)
    EWrestlerGrantedPointsType BloodResType;                                          // 0x004A (size: 0x1)
    FGameplayTag BloodResonanceTag;                                                   // 0x004C (size: 0x8)

}; // Size: 0x58

struct FWrestlerBloodResonanceEventParameters
{
    float CancellationDistance;                                                       // 0x0000 (size: 0x4)
    float IconDisplayMinDistance;                                                     // 0x0004 (size: 0x4)
    float IconRemoveMinDistance;                                                      // 0x0008 (size: 0x4)
    float IconClipMinDistance;                                                        // 0x000C (size: 0x4)
    bool bIconDisplayWhenLOS;                                                         // 0x0010 (size: 0x1)
    float IconDisplayLOSDistance;                                                     // 0x0014 (size: 0x4)
    bool IconAlwaysDisplayAtEdge;                                                     // 0x0018 (size: 0x1)

}; // Size: 0x1C

struct FWrestlerBloodResonanceParameters
{
    bool bIsTypeAssignerEnabled;                                                      // 0x0000 (size: 0x1)
    float UpdateTime;                                                                 // 0x0004 (size: 0x4)
    float AssignmentRange;                                                            // 0x0008 (size: 0x4)
    TArray<FWrestlerBloodResonanceAssignment> Assignments;                            // 0x0010 (size: 0x10)
    TMap<FGameplayTag, float> DeactivationRange;                                      // 0x0020 (size: 0x50)
    FGameplayTag ExcludedTag;                                                         // 0x0070 (size: 0x8)

}; // Size: 0x78

struct FWrestlerBloodResonanceWaypointIcon
{
    TSoftObjectPtr<UTexture2D> WaypointTexture;                                       // 0x0000 (size: 0x28)
    FLinearColor WaypointColor;                                                       // 0x0028 (size: 0x10)

}; // Size: 0x38

struct FWrestlerCameraPresent
{
}; // Size: 0x1

struct FWrestlerCanRemovePlayerActionObserverTag : public FMassTag
{
}; // Size: 0x1

struct FWrestlerChangeVisibilityCollisionInfo
{
    TArray<TSoftObjectPtr<AActor>> Actors;                                            // 0x0000 (size: 0x10)
    EWrestlerChangeVisibilityCollisionState Visibility;                               // 0x0010 (size: 0x1)
    EWrestlerChangeVisibilityCollisionState Collision;                                // 0x0011 (size: 0x1)
    bool bPropagateToAttachedActors;                                                  // 0x0012 (size: 0x1)

}; // Size: 0x18

struct FWrestlerCharacterCostumeDefinition
{
    class UTexture2D* CostumeTextureSmall;                                            // 0x0000 (size: 0x8)
    class UTexture2D* CostumeTexture;                                                 // 0x0008 (size: 0x8)
    class USkeletalMesh* CostumeMesh_FP;                                              // 0x0010 (size: 0x8)
    class USkeletalMesh* CostumeMesh_TP;                                              // 0x0018 (size: 0x8)

}; // Size: 0x20

struct FWrestlerClanTrainerConversation
{
    EPlayerClan Clan;                                                                 // 0x0000 (size: 0x1)
    class UHeraDialogueInfo* DialogueInfo;                                            // 0x0008 (size: 0x8)
    FString FabienDialoguePath;                                                       // 0x0010 (size: 0x10)
    TSoftObjectPtr<UHeraPropertyBool> StartProperty;                                  // 0x0020 (size: 0x28)
    TSoftObjectPtr<UDataTable> ClanAbilitiesDataTable;                                // 0x0048 (size: 0x28)

}; // Size: 0x70

struct FWrestlerClanTrainerConversationInfo
{
    class UHeraDialogueInfo* Info;                                                    // 0x0000 (size: 0x8)

}; // Size: 0x20

struct FWrestlerClanTrainerConversationParameters
{
    bool bIsConversationsEnabled;                                                     // 0x0000 (size: 0x1)
    TSoftObjectPtr<UHeraDialogueInfo> DialogueInfoDefault;                            // 0x0008 (size: 0x28)
    TSoftObjectPtr<UHeraDialogueInfo> FabienDialogueInfo;                             // 0x0030 (size: 0x28)
    TArray<FWrestlerClanTrainerConversation> Trainers;                                // 0x0058 (size: 0x10)
    bool bDisablePlayerInput;                                                         // 0x0068 (size: 0x1)

}; // Size: 0x70

struct FWrestlerCodex
{
    class UCodexItem* Root;                                                           // 0x0000 (size: 0x8)
    TMap<class UHeraDialogueInfo*, class UStory*> DialogStoryMap;                     // 0x0008 (size: 0x50)

}; // Size: 0x58

struct FWrestlerCodexPendingShowItem
{
    bool bIsPending;                                                                  // 0x0000 (size: 0x1)
    FString CodexItemID;                                                              // 0x0008 (size: 0x10)
    bool bIsMalkavian;                                                                // 0x0018 (size: 0x1)

}; // Size: 0x20

struct FWrestlerComponentTransformAndVelocityCopyToActorTag : public FMassTag
{
}; // Size: 0x1

struct FWrestlerComponentTransformAndVelocityCopyToMassTag : public FMassTag
{
}; // Size: 0x1

struct FWrestlerConeParams
{
    float VerticalVisionAngle;                                                        // 0x0000 (size: 0x4)
    float PeripheralVisionAngle;                                                      // 0x0004 (size: 0x4)
    float HorizontalRange;                                                            // 0x0008 (size: 0x4)
    float VerticalRange;                                                              // 0x000C (size: 0x4)

}; // Size: 0x10

struct FWrestlerConfirmationPromptData
{
    FText ConfirmationTitle;                                                          // 0x0000 (size: 0x18)
    FText ConfirmationTextFirstLine;                                                  // 0x0018 (size: 0x18)
    FText ConfirmationTextSecondLine;                                                 // 0x0030 (size: 0x18)
    bool UseBothPromtButtons;                                                         // 0x0048 (size: 0x1)

}; // Size: 0x50

struct FWrestlerContextualAnimations
{
    TArray<TSoftObjectPtr<UAnimMontage>> Animations;                                  // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FWrestlerContextualAnimationsPerGender
{
    TMap<class EWrestlerGenderType, class FWrestlerContextualAnimations> AnimationsPerGender; // 0x0000 (size: 0x50)

}; // Size: 0x50

struct FWrestlerControlInput
{
    uint8 bPunch;                                                                     // 0x0000 (size: 0x1)
    uint8 bHeavy;                                                                     // 0x0000 (size: 0x1)
    uint8 bDash;                                                                      // 0x0000 (size: 0x1)
    uint8 bFeed;                                                                      // 0x0000 (size: 0x1)
    uint8 bHeal;                                                                      // 0x0000 (size: 0x1)
    uint8 bTarget;                                                                    // 0x0000 (size: 0x1)
    uint8 bCrouch;                                                                    // 0x0000 (size: 0x1)
    uint8 bSprint;                                                                    // 0x0000 (size: 0x1)
    uint8 bJump;                                                                      // 0x0001 (size: 0x1)
    uint8 bVampiricVision;                                                            // 0x0001 (size: 0x1)
    uint8 bStrike;                                                                    // 0x0001 (size: 0x1)
    uint8 bRelocate;                                                                  // 0x0001 (size: 0x1)
    uint8 bMastery;                                                                   // 0x0001 (size: 0x1)
    uint8 bAffect;                                                                    // 0x0001 (size: 0x1)
    uint8 bStrikeInstant;                                                             // 0x0001 (size: 0x1)
    uint8 bRelocateInstant;                                                           // 0x0001 (size: 0x1)
    uint8 bMasteryInstant;                                                            // 0x0002 (size: 0x1)
    uint8 bAffectInstant;                                                             // 0x0002 (size: 0x1)
    uint8 bDisciplineAbility;                                                         // 0x0002 (size: 0x1)
    uint8 bLeftPunch;                                                                 // 0x0002 (size: 0x1)
    uint8 bTelekinesis;                                                               // 0x0002 (size: 0x1)
    uint8 bCounter;                                                                   // 0x0002 (size: 0x1)
    FVector2D Move;                                                                   // 0x0008 (size: 0x10)
    TEnumAsByte<EMovementMode> MovementMode;                                          // 0x0018 (size: 0x1)
    FWrestlerInteractionInput Interaction;                                            // 0x001C (size: 0x4)

}; // Size: 0x20

struct FWrestlerControlInputCue
{
    EWrestlerControlBaseInput Input;                                                  // 0x0000 (size: 0x1)
    EWrestlerControlInputType InputType;                                              // 0x0001 (size: 0x1)
    float Time;                                                                       // 0x0004 (size: 0x4)
    EWrestlerControlDirection Direction;                                              // 0x0008 (size: 0x1)
    TArray<EWrestlerControlMovementMode> MovementMode;                                // 0x0010 (size: 0x10)
    class UWrestlerControlCue* Cue;                                                   // 0x0020 (size: 0x8)

}; // Size: 0x30

struct FWrestlerControllerSetupControl
{
    FWrestlerControllerSetupStick MoveStick;                                          // 0x0000 (size: 0x28)
    FWrestlerControllerSetupStick LookStick;                                          // 0x0028 (size: 0x28)
    bool bIsCrouchToggle;                                                             // 0x0050 (size: 0x1)
    bool bIsSprintToggle;                                                             // 0x0051 (size: 0x1)
    FWrestlerControllerSetupTargeting Targeting;                                      // 0x0054 (size: 0x18)
    FWrestlerControllerSetupLookAt LookAt;                                            // 0x006C (size: 0x8)

}; // Size: 0x74

struct FWrestlerControllerSetupLookAt
{
    float MaxLookAtDistance;                                                          // 0x0000 (size: 0x4)
    TEnumAsByte<ECollisionChannel> LookAtCollisionChannel;                            // 0x0004 (size: 0x1)

}; // Size: 0x8

struct FWrestlerControllerSetupStick
{
    float HorizontalSensitivity;                                                      // 0x0000 (size: 0x4)
    float VerticalSensitivity;                                                        // 0x0004 (size: 0x4)
    float MouseSensitivity;                                                           // 0x0008 (size: 0x4)
    float DeadZone;                                                                   // 0x000C (size: 0x4)
    float MaximumInputThreshold;                                                      // 0x0010 (size: 0x4)
    float AxialDeadzone;                                                              // 0x0014 (size: 0x4)
    float CurveExponent;                                                              // 0x0018 (size: 0x4)
    float Acceleration;                                                               // 0x001C (size: 0x4)
    float AccelerationTime;                                                           // 0x0020 (size: 0x4)
    bool bInvertY;                                                                    // 0x0024 (size: 0x1)

}; // Size: 0x28

struct FWrestlerControllerSetupTargeting
{
    float MaxDistance;                                                                // 0x0000 (size: 0x4)
    float MaxAngle;                                                                   // 0x0004 (size: 0x4)
    float StickThreshold;                                                             // 0x0008 (size: 0x4)
    float TurnRate;                                                                   // 0x000C (size: 0x4)
    bool GlancePush;                                                                  // 0x0010 (size: 0x1)
    float MaxGlanceAngle;                                                             // 0x0014 (size: 0x4)

}; // Size: 0x18

struct FWrestlerConversationDialogueInfo
{
    class UHeraDialogueInfo* DialogueInfo;                                            // 0x0000 (size: 0x8)
    class UHeraDialogueInfo* AmbientInfo;                                             // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FWrestlerConversationDialogues
{
    TArray<FWrestlerConversationDialogueInfo> Dialogues;                              // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FWrestlerCreditsIconRow : public FTableRowBase
{
    FText DisplayName;                                                                // 0x0008 (size: 0x18)
    TSoftObjectPtr<UObject> ResourceObject;                                           // 0x0020 (size: 0x28)
    float DesiredHeight;                                                              // 0x0048 (size: 0x4)

}; // Size: 0x50

struct FWrestlerCreditsRow : public FTableRowBase
{
    FString CreditText1;                                                              // 0x0008 (size: 0x10)
    FString CreditText2;                                                              // 0x0018 (size: 0x10)
    EWrestlerCreditType CreditType;                                                   // 0x0028 (size: 0x1)

}; // Size: 0x30

struct FWrestlerCrimeChaseTag : public FMassTag
{
}; // Size: 0x1

struct FWrestlerCrimeNoticedFragment : public FMassFragment
{
}; // Size: 0x8

struct FWrestlerCrimeNoticedTag : public FMassTag
{
}; // Size: 0x1

struct FWrestlerCrowdVisualizationFragment : public FMassFragment
{
}; // Size: 0x10

struct FWrestlerCustomDepthPrimitiveEntry
{
}; // Size: 0x10

struct FWrestlerDeadBodyInvestigators
{
    class AActor* Investigator;                                                       // 0x0000 (size: 0x8)
    TArray<class AActor*> PotentialInvestigators;                                     // 0x0008 (size: 0x10)
    TArray<class AActor*> SeenBodyActors;                                             // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FWrestlerDeadBodyObserverFragment : public FMassFragment
{
}; // Size: 0x28

struct FWrestlerDebugKeyToCvarIntToggles
{
    FKey Key;                                                                         // 0x0000 (size: 0x18)
    FString Cvar;                                                                     // 0x0018 (size: 0x10)
    bool IsDebugMenuWithShiftForFocus;                                                // 0x0028 (size: 0x1)

}; // Size: 0x30

struct FWrestlerDeferredEnemySpawnParam
{
    FGameplayTagContainer TagsToApply;                                                // 0x0000 (size: 0x20)
    FName EnemyTypeOverride;                                                          // 0x0020 (size: 0x8)
    FWrestlerDeferredEnemySpawnParamOnEnemySpawned OnEnemySpawned;                    // 0x0028 (size: 0x10)
    void OnDeferredSpawnCompleted(class AWrestlerEnemyCharacter* SpawnedEnemy);

}; // Size: 0x38

struct FWrestlerDensityFragment : public FMassFragment
{
}; // Size: 0x48

struct FWrestlerDialogueFragment : public FMassFragment
{
}; // Size: 0x40

struct FWrestlerDialogueRequestInstanceData
{
    FGameplayTag Prompt;                                                              // 0x0000 (size: 0x8)
    FStateTreeStructRef MainParticipant;                                              // 0x0008 (size: 0x10)
    FStateTreeStructRef OtherParticipant;                                             // 0x0018 (size: 0x10)

}; // Size: 0x30

struct FWrestlerDialogueRequestTask : public FMassStateTreeTaskBase
{
    float FirstRequstDelay;                                                           // 0x0020 (size: 0x4)
    float RequestFrequency;                                                           // 0x0024 (size: 0x4)

}; // Size: 0x30

struct FWrestlerDialogueSaveDataV1
{
    TMap<class FName, class FHeraDialogueSerialisedDialogue> DialogueData;            // 0x0000 (size: 0x50)

}; // Size: 0x50

struct FWrestlerDialogueSaveDataV2
{
    TMap<class FString, class FHeraDialogueSerialisedDialogue> DialogueData;          // 0x0000 (size: 0x50)

}; // Size: 0x50

struct FWrestlerEnemiesQuestData
{
    TSet<FString> KilledEnemySpawnerPaths;                                            // 0x0000 (size: 0x50)

}; // Size: 0x50

struct FWrestlerEnemyBehaviours
{
    TMap<class FGameplayTag, class TSoftObjectPtr<UBehaviorTree>> EnemyBehaviourData; // 0x0000 (size: 0x50)

}; // Size: 0x50

struct FWrestlerEnemyNoticedTag : public FMassTag
{
}; // Size: 0x1

struct FWrestlerEntityAwarenessWidgetData
{
    FProgressBarStyle AwarenessProgressBarStyle;                                      // 0x0000 (size: 0x290)
    FLinearColor AwarenessBackgroundColor;                                            // 0x0290 (size: 0x10)
    FLinearColor AwarenessBorderColor;                                                // 0x02A0 (size: 0x10)

}; // Size: 0x2B0

struct FWrestlerEntityCloseToLocationCompareInstanceData
{
    FVector Location;                                                                 // 0x0000 (size: 0x18)

}; // Size: 0x18

struct FWrestlerEntityMassFragmentFilter
{
    TArray<FInstancedStruct> AnyFragments;                                            // 0x0000 (size: 0x10)
    TArray<FInstancedStruct> AllFragments;                                            // 0x0010 (size: 0x10)
    TArray<FInstancedStruct> NoneFragments;                                           // 0x0020 (size: 0x10)

}; // Size: 0x30

struct FWrestlerEntityMassTagFilter
{
    TArray<FInstancedStruct> AnyTags;                                                 // 0x0000 (size: 0x10)
    TArray<FInstancedStruct> AllTags;                                                 // 0x0010 (size: 0x10)
    TArray<FInstancedStruct> NoneTags;                                                // 0x0020 (size: 0x10)

}; // Size: 0x30

struct FWrestlerEntityTagFilter
{
    TArray<EWrestlerMassGameplayTags> AnyTags;                                        // 0x0000 (size: 0x10)
    TArray<EWrestlerMassGameplayTags> AllTags;                                        // 0x0010 (size: 0x10)
    TArray<EWrestlerMassGameplayTags> NotTags;                                        // 0x0020 (size: 0x10)

}; // Size: 0x30

struct FWrestlerEquipmentActorToSpawn
{
    TSubclassOf<class AActor> ActorToSpawn;                                           // 0x0000 (size: 0x8)
    FName AttachSocket;                                                               // 0x0008 (size: 0x8)
    EAttachmentRule LocationAttachmentRule;                                           // 0x0010 (size: 0x1)
    EAttachmentRule RotationAttachmentRule;                                           // 0x0011 (size: 0x1)
    EAttachmentRule ScaleAttachmentRule;                                              // 0x0012 (size: 0x1)
    FTransform AttachTransform;                                                       // 0x0020 (size: 0x60)

}; // Size: 0x80

struct FWrestlerEquipmentList
{
    TArray<FWrestlerAppliedEquipmentEntry> Entries;                                   // 0x0000 (size: 0x10)
    class UActorComponent* OwnerComponent;                                            // 0x0010 (size: 0x8)

}; // Size: 0x18

struct FWrestlerExclusionZoneFragment : public FMassFragment
{
}; // Size: 0xC

struct FWrestlerExponentialHeightFogParameters
{
    float BlendTime;                                                                  // 0x0000 (size: 0x4)
    float FogDensity;                                                                 // 0x0004 (size: 0x4)
    FLinearColor FogInscatteringColor;                                                // 0x0008 (size: 0x10)
    float FogHeightFalloff;                                                           // 0x0018 (size: 0x4)
    float FogMaxOpacity;                                                              // 0x001C (size: 0x4)
    float StartDistance;                                                              // 0x0020 (size: 0x4)
    float FogCutoffDistance;                                                          // 0x0024 (size: 0x4)
    class UTextureCube* InscatteringColorCubemap;                                     // 0x0028 (size: 0x8)
    float InscatteringColorCubemapAngle;                                              // 0x0030 (size: 0x4)
    FLinearColor InscatteringTextureTint;                                             // 0x0034 (size: 0x10)
    float FullyDirectionalInscatteringColorDistance;                                  // 0x0044 (size: 0x4)
    float NonDirectionalInscatteringColorDistance;                                    // 0x0048 (size: 0x4)
    float DirectionalInscatteringExponent;                                            // 0x004C (size: 0x4)
    float DirectionalInscatteringStartDistance;                                       // 0x0050 (size: 0x4)
    FLinearColor DirectionalInscatteringColor;                                        // 0x0054 (size: 0x10)
    bool bEnableVolumetricFog;                                                        // 0x0064 (size: 0x1)
    float VolumetricFogScatteringDistribution;                                        // 0x0068 (size: 0x4)
    FColor VolumetricFogAlbedo;                                                       // 0x006C (size: 0x4)
    FLinearColor VolumetricFogEmissive;                                               // 0x0070 (size: 0x10)
    float VolumetricFogExtinctionScale;                                               // 0x0080 (size: 0x4)
    float VolumetricFogDistance;                                                      // 0x0084 (size: 0x4)
    FVector FogActorLocation;                                                         // 0x0088 (size: 0x18)

}; // Size: 0xA0

struct FWrestlerFearFragment : public FMassFragment
{
}; // Size: 0x88

struct FWrestlerFindClosestEntity : public FMassStateTreeTaskBase
{
    FWrestlerEntityMassTagFilter FilterTags;                                          // 0x0028 (size: 0x30)
    FWrestlerEntityMassFragmentFilter FilterFragments;                                // 0x0058 (size: 0x30)
    FWrestlerEntityTagFilter FilterGameplayTags;                                      // 0x0088 (size: 0x30)
    float RefreshRate;                                                                // 0x00B8 (size: 0x4)
    float TendencyToChangeEntity;                                                     // 0x00BC (size: 0x4)

}; // Size: 0xC0

struct FWrestlerFindClosestEntityInstanceData
{
    FMassEntityHandle EntityHandle;                                                   // 0x0000 (size: 0x8)

}; // Size: 0x10

struct FWrestlerFindSmartObjectTask : public FMassFindSmartObjectTask
{
}; // Size: 0x88

struct FWrestlerFindTargetNearPlayer : public FMassStateTreeTaskBase
{
    FZoneGraphTagFilter AllowedAnnotationTags;                                        // 0x0024 (size: 0xC)
    float Range;                                                                      // 0x0030 (size: 0x4)
    bool bLookAtPlayer;                                                               // 0x0034 (size: 0x1)
    bool bStopMoveAtPathEnd;                                                          // 0x0035 (size: 0x1)

}; // Size: 0x38

struct FWrestlerFindTargetNearPlayerInstanceData
{
    FMassZoneGraphTargetLocation NearPlayerTargetLocation;                            // 0x0000 (size: 0x60)

}; // Size: 0x60

struct FWrestlerFinishState : public FMassStateTreeTaskBase
{
    bool bReturnSuccessOnFinish;                                                      // 0x0022 (size: 0x1)

}; // Size: 0x28

struct FWrestlerFinishStateInstanceData
{
}; // Size: 0x1

struct FWrestlerFocusFragment : public FMassFragment
{
    TWeakObjectPtr<class AActor> FocusActor;                                          // 0x0000 (size: 0x8)
    FMassEntityHandle FocusEntity;                                                    // 0x0008 (size: 0x8)

}; // Size: 0x58

struct FWrestlerFrustumPoints
{
}; // Size: 0xC0

struct FWrestlerGameplayEffectContainer
{
    TSoftClassPtr<UWrestlerTargetType> TargetType;                                    // 0x0000 (size: 0x28)
    TArray<TSoftClassPtr<UGameplayEffect>> TargetGameplayEffectClasses;               // 0x0028 (size: 0x10)

}; // Size: 0x38

struct FWrestlerGameplayEffectContainerSpec
{
    FGameplayAbilityTargetDataHandle TargetData;                                      // 0x0000 (size: 0x28)
    TArray<FGameplayEffectSpecHandle> TargetGameplayEffectSpecs;                      // 0x0028 (size: 0x10)

}; // Size: 0x38

struct FWrestlerGameplayEffectContext : public FGameplayEffectContext
{
}; // Size: 0xA8

struct FWrestlerGenderAnimationData
{
    float ChanceToUseThisAnimations;                                                  // 0x0000 (size: 0x4)
    TSoftObjectPtr<UAnimSequence> IdleAnimation;                                      // 0x0008 (size: 0x28)
    TSoftObjectPtr<UBlendSpace> LocomotionBlendspace;                                 // 0x0030 (size: 0x28)

}; // Size: 0x58

struct FWrestlerGetAttributeValue : public FMassStateTreeTaskBase
{
    FGameplayAttribute Attribute;                                                     // 0x0028 (size: 0x38)

}; // Size: 0x60

struct FWrestlerGetAttributeValueInstanceData
{
    float AttributeValue;                                                             // 0x0000 (size: 0x4)

}; // Size: 0x4

struct FWrestlerGrantedPointsData
{
    EWrestlerGrantedPointsType Type;                                                  // 0x0000 (size: 0x1)
    int32 GrantedPoints;                                                              // 0x0004 (size: 0x4)
    FText Description;                                                                // 0x0008 (size: 0x18)

}; // Size: 0x20

struct FWrestlerHasBloodResonanceTypeCondition : public FStateTreeConditionCommonBase
{
    EWrestlerGrantedPointsType BloodType;                                             // 0x0020 (size: 0x1)
    bool bInvert;                                                                     // 0x0021 (size: 0x1)

}; // Size: 0x28

struct FWrestlerHasBloodResonanceTypeInstanceData
{
    FStateTreeStructRef TargetEntity;                                                 // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FWrestlerHasFocusSetTag : public FMassTag
{
}; // Size: 0x1

struct FWrestlerHasMassFragmentCondition : public FStateTreeConditionCommonBase
{
    bool bInvert;                                                                     // 0x0020 (size: 0x1)
    FWrestlerEntityMassFragmentFilter FilterTags;                                     // 0x0028 (size: 0x30)

}; // Size: 0x58

struct FWrestlerHasMassFragmentConditionInstanceData
{
    FStateTreeStructRef TargetEntity;                                                 // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FWrestlerHasMassTagCondition : public FStateTreeConditionCommonBase
{
    bool bInvert;                                                                     // 0x0020 (size: 0x1)
    FWrestlerEntityMassTagFilter FilterTags;                                          // 0x0028 (size: 0x30)

}; // Size: 0x58

struct FWrestlerHasMassTagConditionInstanceData
{
    FStateTreeStructRef TargetEntity;                                                 // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FWrestlerHighlightParticleData
{
    class AActor* ParticleActor;                                                      // 0x0000 (size: 0x8)

}; // Size: 0x10

struct FWrestlerHighlightUpdateData
{
    bool bIsOccluded;                                                                 // 0x0000 (size: 0x1)
    bool bInCombat;                                                                   // 0x0001 (size: 0x1)
    bool bIsWhereIsWally;                                                             // 0x0002 (size: 0x1)
    bool bResonanceTypeChanged;                                                       // 0x0003 (size: 0x1)
    FGameplayTagContainer TypeTags;                                                   // 0x0008 (size: 0x20)
    EWrestlerGrantedPointsType BloodResonanceType;                                    // 0x0028 (size: 0x1)
    EWrestlerMassBloodResonanceState BloodResonanceState;                             // 0x0029 (size: 0x1)
    FVector Velocity;                                                                 // 0x0030 (size: 0x18)

}; // Size: 0x48

struct FWrestlerHighlightVFXData
{
    class AWrestlerHighlightVFXActor* VFXActor;                                       // 0x0000 (size: 0x8)
    TMap<class FMassEntityHandle, class FWrestlerHighlightParticleData> EntitiesParticles; // 0x0028 (size: 0x50)

}; // Size: 0x78

struct FWrestlerHoldAbilityTargetingUpdateData
{
    float ThrowRange;                                                                 // 0x0000 (size: 0x4)
    float AimAssistRange;                                                             // 0x0004 (size: 0x4)
    float AimAssistRadius;                                                            // 0x0008 (size: 0x4)
    TWeakObjectPtr<class AActor> HeldObject;                                          // 0x000C (size: 0x8)
    float HeldObjectRadius;                                                           // 0x0014 (size: 0x4)
    float UpdatePeriod;                                                               // 0x0018 (size: 0x4)

}; // Size: 0x1C

struct FWrestlerHoudiniContainerMode
{
    EWrestlerHoudiniContainerMode Value;                                              // 0x0000 (size: 0x1)

}; // Size: 0x1

struct FWrestlerHoudiniContainerVersion
{
    bool bContainerOutdated;                                                          // 0x0000 (size: 0x1)
    uint32 GeneratorHash;                                                             // 0x0004 (size: 0x4)
    FSoftObjectPath GeneratorPath;                                                    // 0x0008 (size: 0x20)

}; // Size: 0x28

struct FWrestlerIndicatedEntity
{
    class AWrestlerMassEntityIndicator* Indicator;                                    // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FWrestlerIndicatorData
{
    class UWrestlerEnemyIndicatorWidget* IndicatorWidget;                             // 0x0000 (size: 0x8)

}; // Size: 0x20

struct FWrestlerIndicatorList
{
    TArray<class AWrestlerMassEntityIndicator*> Indicators;                           // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FWrestlerIndicatorTypeData
{
    float IndicatorTypeLifespan;                                                      // 0x0000 (size: 0x4)
    FVector2D IndicatorTypeScale;                                                     // 0x0008 (size: 0x10)
    float IndicatorsOffsetFromCenter;                                                 // 0x0018 (size: 0x4)
    float ThresholdDotProduct;                                                        // 0x001C (size: 0x4)

}; // Size: 0x20

struct FWrestlerInput
{
    FVector Move;                                                                     // 0x0000 (size: 0x18)
    FVector Look;                                                                     // 0x0018 (size: 0x18)
    FVector LookRate;                                                                 // 0x0030 (size: 0x18)
    FWrestlerControlInput Control;                                                    // 0x0048 (size: 0x20)
    FWrestlerAbilityInput Ability;                                                    // 0x0068 (size: 0x20)

}; // Size: 0x88

struct FWrestlerInputMappingCategory
{
    FText Category;                                                                   // 0x0000 (size: 0x18)
    TArray<FWrestlerInputMappingEntry> Entries;                                       // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FWrestlerInputMappingEntry
{
    class UInputAction* DependentAction;                                              // 0x0000 (size: 0x8)
    class UInputAction* Action;                                                       // 0x0008 (size: 0x8)
    TArray<FWrestlerSpecialMappingData> SpecialMappings;                              // 0x0010 (size: 0x10)
    bool bRemappableMouseKeyboard;                                                    // 0x0020 (size: 0x1)
    bool bRemappableGamepad;                                                          // 0x0021 (size: 0x1)
    bool bShowOnMouseKeyboard;                                                        // 0x0022 (size: 0x1)
    bool bShowOnGamepad;                                                              // 0x0023 (size: 0x1)
    bool bShowOnMouseKeyboardSpecial;                                                 // 0x0024 (size: 0x1)
    bool bShowOnGamepadSpecial;                                                       // 0x0025 (size: 0x1)

}; // Size: 0x28

struct FWrestlerInputMappingPair
{
    FKey PrimaryKey;                                                                  // 0x0000 (size: 0x18)
    FKey SecondaryKey;                                                                // 0x0018 (size: 0x18)

}; // Size: 0x30

struct FWrestlerInteractableData
{
    FText Name;                                                                       // 0x0000 (size: 0x18)

}; // Size: 0x18

struct FWrestlerInteractionInput
{
    uint8 bInteract;                                                                  // 0x0000 (size: 0x1)

}; // Size: 0x4

struct FWrestlerInteractionTarget
{
    class AActor* ParentActor;                                                        // 0x0000 (size: 0x8)
    class UWrestlerInteractionComponent* Interaction;                                 // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FWrestlerInterfaceGameplayTargetDataFilter : public FGameplayTargetDataFilter
{
    TSubclassOf<class UInterface> Interface;                                          // 0x0020 (size: 0x8)

}; // Size: 0x28

struct FWrestlerInvestigateDeadBody : public FMassStateTreeTaskBase
{
    float RefreshRate;                                                                // 0x0028 (size: 0x4)

}; // Size: 0x30

struct FWrestlerInvestigateDeadBodyInstanceData
{
    class AActor* DeadActor;                                                          // 0x0000 (size: 0x8)
    FVector DeadBodyLocation;                                                         // 0x0008 (size: 0x18)
    bool bIsInvestigating;                                                            // 0x0020 (size: 0x1)
    bool bLookForPlayer;                                                              // 0x0021 (size: 0x1)

}; // Size: 0x28

struct FWrestlerIsGameplayTagValidCondition : public FStateTreeConditionCommonBase
{
    bool bInvert;                                                                     // 0x0020 (size: 0x1)

}; // Size: 0x28

struct FWrestlerIsGameplayTagValidConditionInstanceData
{
    FGameplayTag Tag;                                                                 // 0x0000 (size: 0x8)

}; // Size: 0x8

struct FWrestlerIsPedestrianTypeCondition : public FStateTreeConditionCommonBase
{
    EWrestlerPedestrianType PedestrianType;                                           // 0x0020 (size: 0x1)
    bool bInvert;                                                                     // 0x0021 (size: 0x1)

}; // Size: 0x28

struct FWrestlerIsPedestrianTypeConditionInstanceData
{
    FStateTreeStructRef TargetEntity;                                                 // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FWrestlerLampDamageLight
{
    class ULightComponent* LightComponent;                                            // 0x0000 (size: 0x8)
    float LightIntensity;                                                             // 0x0008 (size: 0x4)

}; // Size: 0x10

struct FWrestlerLastKnownPositionFragment : public FMassFragment
{
}; // Size: 0x28

struct FWrestlerLastStimulusInfo
{
    class AActor* StimulusActor;                                                      // 0x0000 (size: 0x8)

}; // Size: 0x68

struct FWrestlerLevelSaveData
{
    FGameplayTag MapTag;                                                              // 0x0000 (size: 0x8)
    TArray<FName> ActivatedStreamingLevels;                                           // 0x0008 (size: 0x10)
    bool bRecursiveDataLayerActivation;                                               // 0x0018 (size: 0x1)
    TArray<TSoftObjectPtr<UDataLayerAsset>> ActivatedDataLayers;                      // 0x0020 (size: 0x10)
    TSet<FName> ActivatedDataLayerNames;                                              // 0x0030 (size: 0x50)

}; // Size: 0x80

struct FWrestlerLightActorComponentEmissiveParameters
{
    uint8 bOverrideEmissiveIntensity;                                                 // 0x0000 (size: 0x1)
    uint8 bOverrideEmissiveColour;                                                    // 0x0000 (size: 0x1)
    float EmissiveIntensity;                                                          // 0x0004 (size: 0x4)
    FLinearColor EmissiveColour;                                                      // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FWrestlerLightActorComponentFlickerParameters
{
    uint8 bFlickerEnabled;                                                            // 0x0000 (size: 0x1)
    uint8 bFlickerOnlyAffectsEmissive;                                                // 0x0000 (size: 0x1)
    float FlickerSpeed;                                                               // 0x0004 (size: 0x4)
    float FlickerCurveOffset;                                                         // 0x0008 (size: 0x4)
    float FlickerIntensityMultiplier;                                                 // 0x000C (size: 0x4)
    float FlickerElapsedTime;                                                         // 0x0010 (size: 0x4)
    class UCurveFloat* FlickerCurve;                                                  // 0x0018 (size: 0x8)

}; // Size: 0x20

struct FWrestlerLightActorComponentLightParameters
{
    uint8 bOverrideCastShadows;                                                       // 0x0000 (size: 0x1)
    uint8 bOverrideCastVolumetricShadows;                                             // 0x0000 (size: 0x1)
    uint8 bOverrideIntensityUnits;                                                    // 0x0000 (size: 0x1)
    uint8 bOverrideIntensity;                                                         // 0x0000 (size: 0x1)
    uint8 bOverrideColour;                                                            // 0x0000 (size: 0x1)
    uint8 bOverrideMaxDrawDistance;                                                   // 0x0000 (size: 0x1)
    uint8 bOverrideMaxDistanceFadeRange;                                              // 0x0000 (size: 0x1)
    uint8 bCastShadows;                                                               // 0x0000 (size: 0x1)
    uint8 bCastVolumetricShadows;                                                     // 0x0001 (size: 0x1)
    float MaxDrawDistance;                                                            // 0x0004 (size: 0x4)
    float MaxDistanceFadeRange;                                                       // 0x0008 (size: 0x4)
    ELightUnits IntensityUnits;                                                       // 0x000C (size: 0x1)
    float Intensity;                                                                  // 0x0010 (size: 0x4)
    FLinearColor Colour;                                                              // 0x0014 (size: 0x10)

}; // Size: 0x24

struct FWrestlerLightComponent
{
    class ULightComponent* LightComponent;                                            // 0x0000 (size: 0x8)
    float Intensity;                                                                  // 0x0008 (size: 0x4)
    float Temperature;                                                                // 0x000C (size: 0x4)

}; // Size: 0x10

struct FWrestlerLightMesh
{
    class UStaticMeshComponent* MeshComponent;                                        // 0x0000 (size: 0x8)
    int32 EmissiveIndex;                                                              // 0x0008 (size: 0x4)
    class UMaterialInterface* EmissiveMaterial;                                       // 0x0010 (size: 0x8)

}; // Size: 0x18

struct FWrestlerManagedConfigAssets
{
    TArray<TSoftObjectPtr<UWrestlerConfigDataAsset>> DataConfigSoftObjects;           // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FWrestlerMapCategoryData
{
    FText CategoryNameForUI;                                                          // 0x0000 (size: 0x18)
    int32 InitialCategoryMarkersCount;                                                // 0x0018 (size: 0x4)
    bool bCanInteractWithMarkesInCategory;                                            // 0x001C (size: 0x1)
    bool bCanCategoryVisibilityBeToggled;                                             // 0x001D (size: 0x1)
    bool bUpdateObjectRotationInMap;                                                  // 0x001E (size: 0x1)

}; // Size: 0x20

struct FWrestlerMapData
{
    FWrestlerMapCategoryData CategoryData;                                            // 0x0000 (size: 0x20)
    FWrestlerMapMarkerData CategoryMarkerData;                                        // 0x0020 (size: 0x58)

}; // Size: 0x78

struct FWrestlerMapInfo
{
    FGameplayTag Tag;                                                                 // 0x0000 (size: 0x8)
    FSoftObjectPath Map;                                                              // 0x0008 (size: 0x20)
    bool bSeamlessLoad;                                                               // 0x0028 (size: 0x1)
    bool bEnableAutomationTests;                                                      // 0x0029 (size: 0x1)

}; // Size: 0x30

struct FWrestlerMapMarkerData
{
    class UTexture2D* IconImage;                                                      // 0x0000 (size: 0x8)
    FLinearColor ImageColor;                                                          // 0x0008 (size: 0x10)
    FText Description;                                                                // 0x0018 (size: 0x18)
    FText AltDescription;                                                             // 0x0030 (size: 0x18)
    FVector2D IconScale;                                                              // 0x0048 (size: 0x10)

}; // Size: 0x58

struct FWrestlerMapRadialAreaData
{
    float Radius;                                                                     // 0x0000 (size: 0x4)
    FVector2D RadialAreaOffset;                                                       // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FWrestlerMapUIImagesData
{
    TMap<class EWrestlerUIMapMode, class UTexture2D*> MapZoneImagePerMode;            // 0x0000 (size: 0x50)

}; // Size: 0x50

struct FWrestlerMasqueradeData
{
    FText MasqueradeTextLevel;                                                        // 0x0000 (size: 0x18)
    class UTexture2D* MasqueradeLevelImage;                                           // 0x0018 (size: 0x8)

}; // Size: 0x20

struct FWrestlerMasqueradeDensityControlParameters
{
    int32 EntitiesDesired;                                                            // 0x0000 (size: 0x4)
    int32 EntitiesTolerance;                                                          // 0x0004 (size: 0x4)
    float ChangePercentage;                                                           // 0x0008 (size: 0x4)
    float MoveSpeedFraction;                                                          // 0x000C (size: 0x4)
    float StandTimeFraction;                                                          // 0x0010 (size: 0x4)

}; // Size: 0x14

struct FWrestlerMasqueradeDensityParameters
{
    bool bIsEnabled;                                                                  // 0x0000 (size: 0x1)
    float NearbyDistance;                                                             // 0x0004 (size: 0x4)
    float ControlRange;                                                               // 0x0008 (size: 0x4)
    TMap<class EWrestlerMasqueradeState, class FWrestlerMasqueradeDensityControlParameters> ControlParams; // 0x0010 (size: 0x50)

}; // Size: 0x60

struct FWrestlerMasqueradeDialogueParameters
{
    bool bDisplayDebugIndividuals;                                                    // 0x0000 (size: 0x1)
    bool bDisplayDebugGroups;                                                         // 0x0001 (size: 0x1)
    bool bDisplayDebugRequests;                                                       // 0x0002 (size: 0x1)
    bool bDisplayDebugActiveEntities;                                                 // 0x0003 (size: 0x1)
    bool bDisplayDebugTotalRequests;                                                  // 0x0004 (size: 0x1)
    float RequestFilterRange;                                                         // 0x0008 (size: 0x4)
    float IdleRange;                                                                  // 0x000C (size: 0x4)
    int32 MaxIdleIndividuals;                                                         // 0x0010 (size: 0x4)
    float IdleDelay;                                                                  // 0x0014 (size: 0x4)
    float IdleRangeGroup;                                                             // 0x0018 (size: 0x4)
    int32 MaxIdleForGroups;                                                           // 0x001C (size: 0x4)
    int32 MaxIdleInGroup;                                                             // 0x0020 (size: 0x4)
    int32 MaxIdleGroups;                                                              // 0x0024 (size: 0x4)
    TSoftObjectPtr<UHeraDialogueInfo> PromptDialogueInfoDefault;                      // 0x0028 (size: 0x28)
    FWrestlerMasqueradeDialoguePrompts Prompts;                                       // 0x0050 (size: 0x40)

}; // Size: 0x90

struct FWrestlerMasqueradeDialoguePrompts
{
    FGameplayTag SingleIdle;                                                          // 0x0000 (size: 0x8)
    FGameplayTag GroupIdle;                                                           // 0x0008 (size: 0x8)
    FGameplayTag Greetings;                                                           // 0x0010 (size: 0x8)
    FGameplayTag Chat;                                                                // 0x0018 (size: 0x8)
    FGameplayTag Passing;                                                             // 0x0020 (size: 0x8)
    FGameplayTag FedOn;                                                               // 0x0028 (size: 0x8)
    FGameplayTag Damaged;                                                             // 0x0030 (size: 0x8)
    FGameplayTag Death;                                                               // 0x0038 (size: 0x8)

}; // Size: 0x40

struct FWrestlerMasqueradeGroupingParameters
{
    int32 UpdateRate;                                                                 // 0x0000 (size: 0x4)
    TMap<class EWrestlerPedestrianType, class FWrestlerMasqueradeDensityParameters> DensityParams; // 0x0008 (size: 0x50)
    TMap<class EWrestlerPedestrianType, class FWrestlerMasqueradeDensityParameters> SpacingParams; // 0x0058 (size: 0x50)

}; // Size: 0xA8

struct FWrestlerMasqueradePlayerActionData : public FTableRowBase
{
    FGameplayTag ActionTag;                                                           // 0x0008 (size: 0x8)
    bool bIsViolentAction;                                                            // 0x0010 (size: 0x1)
    float InstantlyAwareRadius;                                                       // 0x0014 (size: 0x4)
    float ActionNoticeability;                                                        // 0x0018 (size: 0x4)
    float ObservationDuration;                                                        // 0x001C (size: 0x4)
    float NoiseRadius;                                                                // 0x0020 (size: 0x4)
    TSet<EWrestlerPedestrianType> ExcludedPedestrianTypes;                            // 0x0028 (size: 0x50)
    FWrestlerMasqueradeScoreUpdateData MasqueradeUpdateData;                          // 0x0078 (size: 0x10)
    TMap<class EWrestlerPedestrianType, class FWrestlerMasqueradeScoreUpdateData> OverrideUpdateData; // 0x0088 (size: 0x50)
    FWrestlerPlayerActionReactionData ReactionData;                                   // 0x00D8 (size: 0x14)
    TMap<class EWrestlerPedestrianType, class FWrestlerPlayerActionReactionData> OverrideReactionData; // 0x00F0 (size: 0x50)

}; // Size: 0x140

struct FWrestlerMasqueradeProperties
{
    TSoftObjectPtr<UHeraPropertyBool> IsMassVisible;                                  // 0x0000 (size: 0x28)
    TSoftObjectPtr<UHeraPropertyInt> ExclusionZoneMask;                               // 0x0028 (size: 0x28)
    TSoftObjectPtr<UHeraPropertyFloat> ExclusionZoneSpeedOverride;                    // 0x0050 (size: 0x28)
    TSoftObjectPtr<UHeraPropertyBool> ExclusionZoneSetPedestrians;                    // 0x0078 (size: 0x28)
    TSoftObjectPtr<UHeraPropertyBool> ExclusionZoneSetPolice;                         // 0x00A0 (size: 0x28)
    TSoftObjectPtr<UHeraPropertyBool> IsMasqueradeEnabled;                            // 0x00C8 (size: 0x28)

}; // Size: 0xF0

struct FWrestlerMasqueradeQuestData
{
    class UWrestlerQuestData* MasqueradeQuestDataAsset;                               // 0x0000 (size: 0x8)
    class UHeraPropertyRule* HighMasqueradeLevelRule;                                 // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FWrestlerMasqueradeScoreData
{
    float MasqueradeScoreToEnterState;                                                // 0x0000 (size: 0x4)
    float MasqueradeScorePauseTime;                                                   // 0x0004 (size: 0x4)
    float MasqueradeScoreDecreaseSpeed;                                               // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FWrestlerMasqueradeScoreUpdateData
{
    bool bCanAffectEngagedState;                                                      // 0x0000 (size: 0x1)
    float InitialScoreToAdd;                                                          // 0x0004 (size: 0x4)
    float ScoreOverTime;                                                              // 0x0008 (size: 0x4)
    EWrestlerMasqueradeState MinimalMasqueradeState;                                  // 0x000C (size: 0x1)

}; // Size: 0x10

struct FWrestlerMasqueradeWallaParameters
{
    bool bIsEnabled;                                                                  // 0x0000 (size: 0x1)
    bool bDisplayDebugWalla;                                                          // 0x0001 (size: 0x1)
    float UpdateTime;                                                                 // 0x0004 (size: 0x4)
    TArray<FWrestlerMasqueradeWallaQueryParameters> QueryParams;                      // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FWrestlerMasqueradeWallaQueryParameters
{
    int32 ID;                                                                         // 0x0000 (size: 0x4)
    TArray<EWrestlerPedestrianType> Types;                                            // 0x0008 (size: 0x10)
    float MinRange;                                                                   // 0x0018 (size: 0x4)
    float MaxRange;                                                                   // 0x001C (size: 0x4)
    float FearWeightViolence;                                                         // 0x0020 (size: 0x4)

}; // Size: 0x28

struct FWrestlerMassActorHasAnyGameplayTagCondition : public FStateTreeConditionCommonBase
{
    bool bInvert;                                                                     // 0x0020 (size: 0x1)
    FGameplayTagContainer GameplayTags;                                               // 0x0028 (size: 0x20)

}; // Size: 0x48

struct FWrestlerMassActorHasAnyGameplayTagConditionInstanceData
{
}; // Size: 0x1

struct FWrestlerMassActors
{
    TArray<class AActor*> Array;                                                      // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FWrestlerMassAddProp : public FMassStateTreeTaskBase
{
    TSoftObjectPtr<UWrestlerMassSOPropDataAsset> PropDataAsset;                       // 0x0028 (size: 0x28)

}; // Size: 0x50

struct FWrestlerMassAddPropInstanceData
{
    class UWrestlerMassSOPropDataAsset* LoadedPropAsset;                              // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FWrestlerMassAwareOfUnconsciousEntityTag : public FMassTag
{
}; // Size: 0x1

struct FWrestlerMassBloodResonanceData
{
}; // Size: 0xA8

struct FWrestlerMassBloodResonanceEventFragment : public FMassFragment
{
}; // Size: 0x38

struct FWrestlerMassBloodResonanceEventSpawnRequestFragment : public FMassFragment
{
}; // Size: 0xF0

struct FWrestlerMassBloodResonanceFragment : public FMassFragment
{
}; // Size: 0x2C

struct FWrestlerMassBloodResonanceTypeInfo
{
    FWrestlerBloodResonanceAssignment Assignment;                                     // 0x0000 (size: 0x28)
    EWrestlerGrantedPointsType Type;                                                  // 0x0028 (size: 0x1)

}; // Size: 0x30

struct FWrestlerMassCanBecomeWitness : public FStateTreeConditionCommonBase
{
    bool bInvert;                                                                     // 0x0020 (size: 0x1)

}; // Size: 0x28

struct FWrestlerMassCanBecomeWitnessInstanceData
{
}; // Size: 0x1

struct FWrestlerMassCharacterMovementCopyToActorTag : public FMassTag
{
}; // Size: 0x1

struct FWrestlerMassClaimSmartObjectTask : public FMassClaimSmartObjectTask
{
}; // Size: 0x40

struct FWrestlerMassClearResetFleeingPathValue : public FMassStateTreeTaskBase
{
}; // Size: 0x28

struct FWrestlerMassClearResetFleeingPathValueInstanceData
{
}; // Size: 0x1

struct FWrestlerMassConversationCameraParameters
{
    bool bIsDebugging;                                                                // 0x0000 (size: 0x1)
    bool bIsShakeEnabled;                                                             // 0x0001 (size: 0x1)
    FWrestlerMassConversationCameraShakeParameters ShakePitch;                        // 0x0004 (size: 0xC)
    FWrestlerMassConversationCameraShakeParameters ShakeYaw;                          // 0x0010 (size: 0xC)
    FWrestlerMassConversationCameraShakeParameters ShakeFOV;                          // 0x001C (size: 0xC)
    TEnumAsByte<ECollisionChannel> TraceChannel;                                      // 0x0028 (size: 0x1)
    float CollsionShapeRadius;                                                        // 0x002C (size: 0x4)
    float MinCameraLOSPercentage;                                                     // 0x0030 (size: 0x4)
    bool bUseCameraWithBlockedLOS;                                                    // 0x0034 (size: 0x1)
    bool bStickWithCurrentCamera;                                                     // 0x0035 (size: 0x1)
    bool bChooseRandomAvailableCamera;                                                // 0x0036 (size: 0x1)

}; // Size: 0x38

struct FWrestlerMassConversationCameraShakeParameters
{
    float Offset;                                                                     // 0x0000 (size: 0x4)
    float Frequency;                                                                  // 0x0004 (size: 0x4)
    float Amplitude;                                                                  // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FWrestlerMassConversationCameraTrace
{
}; // Size: 0x10

struct FWrestlerMassConversationCostumeParameters
{
    TSoftObjectPtr<UHeraPropertyBool> CostumeProperty;                                // 0x0000 (size: 0x28)
    TArray<FGameplayTag> CostumeTags;                                                 // 0x0028 (size: 0x10)

}; // Size: 0x38

struct FWrestlerMassConversationInfo
{
}; // Size: 0x20

struct FWrestlerMassConversationParameters
{
    bool bIsConversationsEnabled;                                                     // 0x0000 (size: 0x1)
    bool bIsAmbienceEnabled;                                                          // 0x0001 (size: 0x1)
    bool bIsDebugging;                                                                // 0x0002 (size: 0x1)
    bool bPauseGame;                                                                  // 0x0003 (size: 0x1)
    float MaxRange;                                                                   // 0x0004 (size: 0x4)
    TSoftObjectPtr<AWrestlerDialogueRig> ConversatationDialogRig;                     // 0x0008 (size: 0x28)
    TSoftClassPtr<AWrestlerDialogueRig> ConversatationDialogRigClass;                 // 0x0030 (size: 0x28)
    TSoftObjectPtr<UHeraDialogueInfo> ConversationDialogueInfoDefault;                // 0x0058 (size: 0x28)
    TSoftObjectPtr<UHeraDialogueInfo> ConversationAmbientInfoDefault;                 // 0x0080 (size: 0x28)
    FVector2D ConversationAvoidanceArea;                                              // 0x00A8 (size: 0x10)
    float AmbienceChance;                                                             // 0x00B8 (size: 0x4)
    float AmbienceCooldownMin;                                                        // 0x00BC (size: 0x4)
    float AmbienceCooldownMax;                                                        // 0x00C0 (size: 0x4)
    FVector PromptButtonOffset;                                                       // 0x00C8 (size: 0x18)
    TSoftObjectPtr<UHeraPropertyBool> MassConversationStartProperty;                  // 0x00E0 (size: 0x28)
    TSoftObjectPtr<UHeraPropertyBool> MassConversationFlirtProperty;                  // 0x0108 (size: 0x28)
    TSoftObjectPtr<UHeraPropertyBool> MassConversationFightProperty;                  // 0x0130 (size: 0x28)
    TSoftObjectPtr<UHeraPropertyBool> MassConversationFearProperty;                   // 0x0158 (size: 0x28)
    TSoftObjectPtr<UHeraPropertyBool> MassConversationBREventProperty;                // 0x0180 (size: 0x28)
    TSoftObjectPtr<UHeraPropertyBool> MassConversationWallyProperty;                  // 0x01A8 (size: 0x28)
    TSoftObjectPtr<UHeraPropertyInt> MassConversationMarkedWallyNumberForNixProperty; // 0x01D0 (size: 0x28)
    TSoftObjectPtr<UHeraPropertyInt> MassConversationMarkedWallyNumberForLouProperty; // 0x01F8 (size: 0x28)
    TMap<class TSoftObjectPtr<UHeraPropertyBool>, class TSoftObjectPtr<UWrestlerAbilityDefinition>> MassConversationHasAbilityProperties; // 0x0220 (size: 0x50)
    TArray<FWrestlerMassConversationCostumeParameters> CostumeParams;                 // 0x0270 (size: 0x10)
    TSoftClassPtr<UGameplayAbility> AbilityToTriggerAtSuccessBRConversation;          // 0x0280 (size: 0x28)
    bool bDisablePlayerInput;                                                         // 0x02A8 (size: 0x1)

}; // Size: 0x2B0

struct FWrestlerMassCoordinateSmartObjectInstanceData
{
}; // Size: 0x4

struct FWrestlerMassCoordinateSmartObjectTask : public FMassStateTreeTaskBase
{
    float MaxTimeToWait;                                                              // 0x0024 (size: 0x4)

}; // Size: 0x28

struct FWrestlerMassDeactivateBloodResonance : public FMassStateTreeTaskBase
{
    bool bClearBloodResonance;                                                        // 0x0022 (size: 0x1)

}; // Size: 0x28

struct FWrestlerMassDeactivateBloodResonanceInstanceData
{
}; // Size: 0x1

struct FWrestlerMassDeadBodyData
{
}; // Size: 0x60

struct FWrestlerMassDeadBodyInvestigated : public FMassStateTreeTaskBase
{
}; // Size: 0x28

struct FWrestlerMassDeadBodyInvestigatedInstanceData
{
}; // Size: 0x1

struct FWrestlerMassDeathFragment : public FMassSharedFragment
{
    bool bCanRespawnOnDeath;                                                          // 0x0000 (size: 0x1)
    class UHeraPropertyBool* DeathProperty;                                           // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FWrestlerMassDebugFallDetectParameters
{
    bool bIsEnabled;                                                                  // 0x0000 (size: 0x1)
    bool bIsVelocityFallDetectEnabled;                                                // 0x0001 (size: 0x1)
    float FallVelocityThreshold;                                                      // 0x0004 (size: 0x4)
    FColor VelocityDetectColor;                                                       // 0x0008 (size: 0x4)
    bool bIsGroundAboveDetectEnabled;                                                 // 0x000C (size: 0x1)
    TEnumAsByte<ECollisionChannel> TraceChannel;                                      // 0x000D (size: 0x1)
    float SweepShapeRadius;                                                           // 0x0010 (size: 0x4)
    float SweepHeight;                                                                // 0x0014 (size: 0x4)
    FColor GroundDetectColor;                                                         // 0x0018 (size: 0x4)
    float CapsuleHeight;                                                              // 0x001C (size: 0x4)
    float CapsuleRadius;                                                              // 0x0020 (size: 0x4)

}; // Size: 0x24

struct FWrestlerMassDebugLODColors
{
    TArray<FColor> Colors;                                                            // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FWrestlerMassDebugLocationParameters
{
    bool bIsVLogEnabled;                                                              // 0x0000 (size: 0x1)
    bool bIncludeSOUsers;                                                             // 0x0001 (size: 0x1)
    bool bOnlySOUsers;                                                                // 0x0002 (size: 0x1)
    float CapsuleHeight;                                                              // 0x0004 (size: 0x4)
    float CapsuleRadius;                                                              // 0x0008 (size: 0x4)
    FColor CapsuleDefaultColor;                                                       // 0x000C (size: 0x4)
    TArray<FWrestlerMassDebugLODColors> LODColors;                                    // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FWrestlerMassDebugMobilityParameters
{
    EWrestlerPedestrianType QueryType;                                                // 0x0000 (size: 0x1)
    bool bIncludeSOUsers;                                                             // 0x0001 (size: 0x1)
    float ShortTime;                                                                  // 0x0004 (size: 0x4)
    float LongTime;                                                                   // 0x0008 (size: 0x4)
    float MinDistance;                                                                // 0x000C (size: 0x4)
    bool TeleportToImmobileNext;                                                      // 0x0010 (size: 0x1)
    bool TeleportToImmobilePrevious;                                                  // 0x0011 (size: 0x1)

}; // Size: 0x14

struct FWrestlerMassDebugTurningParameters
{
    EWrestlerPedestrianType QueryType;                                                // 0x0000 (size: 0x1)
    bool bIncludeSOUsers;                                                             // 0x0001 (size: 0x1)
    float AveRate;                                                                    // 0x0004 (size: 0x4)
    float TurningAngle;                                                               // 0x0008 (size: 0x4)
    float MinSpeed;                                                                   // 0x000C (size: 0x4)
    float VelMultiplier;                                                              // 0x0010 (size: 0x4)
    float TurnedDisplayTime;                                                          // 0x0014 (size: 0x4)
    float ControlledTurnDetectionTime;                                                // 0x0018 (size: 0x4)
    bool bShowDirectionLogging;                                                       // 0x001C (size: 0x1)
    bool bShowTurnPointLogging;                                                       // 0x001D (size: 0x1)
    bool bShowEntityOfInterest;                                                       // 0x001E (size: 0x1)
    uint32 EntityOfInterest;                                                          // 0x0020 (size: 0x4)
    bool bFollowEntityOfInterest;                                                     // 0x0024 (size: 0x1)
    bool bTeleportToLastTurnEntity;                                                   // 0x0025 (size: 0x1)
    bool TeleportToTurnedNext;                                                        // 0x0026 (size: 0x1)
    bool TeleportToTurnedPrevious;                                                    // 0x0027 (size: 0x1)

}; // Size: 0x28

struct FWrestlerMassDestroyActorFragment : public FMassFragment
{
}; // Size: 0x8

struct FWrestlerMassDialogueData
{
}; // Size: 0x38

struct FWrestlerMassDisableFragment : public FMassFragment
{
}; // Size: 0x1B8

struct FWrestlerMassDisableMovement : public FMassStateTreeTaskBase
{
}; // Size: 0x28

struct FWrestlerMassDisableMovementInstanceData
{
}; // Size: 0x1

struct FWrestlerMassEntityCloseToLocationCondition : public FStateTreeConditionCommonBase
{
    bool bInvert;                                                                     // 0x0020 (size: 0x1)
    float AllowedDistance;                                                            // 0x0024 (size: 0x4)

}; // Size: 0x28

struct FWrestlerMassEntityCloseToPlayerCondition : public FStateTreeConditionCommonBase
{
    bool bInvert;                                                                     // 0x0020 (size: 0x1)
    float DistanceToPlayer;                                                           // 0x0024 (size: 0x4)

}; // Size: 0x30

struct FWrestlerMassEntityCloseToPlayerInstanceData
{
}; // Size: 0x1

struct FWrestlerMassEntityHandle_BP
{
    int32 Index;                                                                      // 0x0000 (size: 0x4)
    int32 SerialNumber;                                                               // 0x0004 (size: 0x4)

}; // Size: 0x8

struct FWrestlerMassEntityPairedEntityData
{
    bool bAllowGlancing;                                                              // 0x0000 (size: 0x1)
    FWrestlerMassPairedEntityTypeParams GlanceParams;                                 // 0x0008 (size: 0x58)
    bool bAllowSideBySidePairing;                                                     // 0x0060 (size: 0x1)
    FWrestlerMassPairedEntityTypeParams SideBySideParams;                             // 0x0068 (size: 0x58)

}; // Size: 0xC0

struct FWrestlerMassEntityPersistentData
{
    bool bOverridePedestrianType;                                                     // 0x0000 (size: 0x1)
    EWrestlerPedestrianType PedestrianType;                                           // 0x0001 (size: 0x1)
    bool bOverrideGender;                                                             // 0x0002 (size: 0x1)
    EWrestlerGenderType GenderType;                                                   // 0x0003 (size: 0x1)
    FVector OffsetFromPivotToHead;                                                    // 0x0008 (size: 0x18)

}; // Size: 0x20

struct FWrestlerMassEntityPersistentDataFragment : public FMassFragment
{
}; // Size: 0x40

struct FWrestlerMassEntitySOEventActivationInstanceData
{
}; // Size: 0x1

struct FWrestlerMassEntitySharedData
{
    class UWrestlerMassContextualAnimationData* ContextualAnimDataAsset;              // 0x0000 (size: 0x8)
    class UWrestlerModularCharacterProfiles* ModularCharacterProfiles;                // 0x0008 (size: 0x8)
    FName EnemyTypeName;                                                              // 0x0010 (size: 0x8)
    float UnconsciousAfterFeedTime;                                                   // 0x0018 (size: 0x4)
    FGameplayTag FeedXPAwardTag;                                                      // 0x001C (size: 0x8)

}; // Size: 0x28

struct FWrestlerMassEntitySharedDataFragment : public FMassSharedFragment
{
    FWrestlerMassEntitySharedData SharedData;                                         // 0x0000 (size: 0x28)

}; // Size: 0x28

struct FWrestlerMassEntitySmartObjectEventActivation : public FStateTreeConditionCommonBase
{
    float ConeAngle;                                                                  // 0x0020 (size: 0x4)

}; // Size: 0x28

struct FWrestlerMassFleeingVolumeFragment : public FMassFragment
{
}; // Size: 0x8

struct FWrestlerMassGameplayAbilityInProgressTag : public FMassTag
{
}; // Size: 0x1

struct FWrestlerMassGetActiveGameplayAbilityTask : public FMassStateTreeTaskBase
{
}; // Size: 0x28

struct FWrestlerMassGetActiveGameplayAbilityTaskInstanceData
{
    FGameplayTagContainer ActiveAbilityTags;                                          // 0x0000 (size: 0x20)

}; // Size: 0x20

struct FWrestlerMassGetBloodResonanceActivationPrompt : public FMassStateTreeTaskBase
{
    FGameplayTag DefaultIdlePrompt;                                                   // 0x0024 (size: 0x8)

}; // Size: 0x30

struct FWrestlerMassGetBloodResonanceActivationPromptInstanceData
{
    FGameplayTag OutActivationPrompt;                                                 // 0x0000 (size: 0x8)
    FGameplayTag OutActiveIdlePrompt;                                                 // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FWrestlerMassGetClaimedSmartObjectLocationInstanceData
{
    FSmartObjectClaimHandle ClaimedSlot;                                              // 0x0000 (size: 0x20)
    FVector SlotLocation;                                                             // 0x0020 (size: 0x18)

}; // Size: 0x38

struct FWrestlerMassGetClaimedSmartObjectLocationTask : public FMassStateTreeTaskBase
{
}; // Size: 0x28

struct FWrestlerMassGetCrimeEntity : public FMassStateTreeTaskBase
{
}; // Size: 0x28

struct FWrestlerMassGetCrimeEntityInstanceData
{
    FMassEntityHandle CrimeEntity;                                                    // 0x0000 (size: 0x8)

}; // Size: 0x8

struct FWrestlerMassGetDesiredMoveLocationFromSO : public FWrestlerZGFindWanderTarget
{
    float ZoneGraphSearchRange;                                                       // 0x0038 (size: 0x4)

}; // Size: 0x40

struct FWrestlerMassGetDesiredMoveLocationFromSOInstanceData : public FWrestlerZGFindWanderTargetInstanceData
{
    FVector OutLocation;                                                              // 0x0068 (size: 0x18)

}; // Size: 0x80

struct FWrestlerMassGetEntityLocation : public FMassStateTreeTaskBase
{
    float RefreshRate;                                                                // 0x0028 (size: 0x4)

}; // Size: 0x30

struct FWrestlerMassGetEntityLocationInstanceData
{
    FStateTreeStructRef TargetEntity;                                                 // 0x0000 (size: 0x10)
    FVector OutLocation;                                                              // 0x0010 (size: 0x18)

}; // Size: 0x28

struct FWrestlerMassGetGameplayAbilityTags : public FMassStateTreeTaskBase
{
    float RefreshRate;                                                                // 0x0024 (size: 0x4)

}; // Size: 0x28

struct FWrestlerMassGetGameplayAbilityTagsInstanceData
{
    FStateTreeStructRef TargetEntity;                                                 // 0x0000 (size: 0x10)
    FGameplayTagContainer OutTags;                                                    // 0x0010 (size: 0x20)

}; // Size: 0x30

struct FWrestlerMassGetIntoPositionAnimationData
{
    TArray<FWrestlerMassGetIntoPositionParams> GetIntoPositionAnims;                  // 0x0000 (size: 0x10)

}; // Size: 0x18

struct FWrestlerMassGetIntoPositionAnimationDataFragment : public FMassSharedFragment
{
    FWrestlerMassGetIntoPositionAnimationData AnimationData;                          // 0x0000 (size: 0x18)

}; // Size: 0x18

struct FWrestlerMassGetIntoPositionAnimationParamsFragment : public FMassFragment
{
}; // Size: 0x40

struct FWrestlerMassGetIntoPositionParams
{
    class UAnimMontage* Montage;                                                      // 0x0000 (size: 0x8)
    FVector2D TargetOffsetFromAnimStart;                                              // 0x0008 (size: 0x10)
    int32 DegreesTurn;                                                                // 0x0018 (size: 0x4)
    FName SequenceName;                                                               // 0x001C (size: 0x8)

}; // Size: 0x28

struct FWrestlerMassGetLastKnownPosition : public FMassStateTreeTaskBase
{
    float RefreshRate;                                                                // 0x0024 (size: 0x4)

}; // Size: 0x28

struct FWrestlerMassGetLastKnownPositionInstanceData
{
    FVector OutLastKnownPosition;                                                     // 0x0000 (size: 0x18)
    FVector OutInstigatorPosition;                                                    // 0x0018 (size: 0x18)

}; // Size: 0x30

struct FWrestlerMassGetNoticedEnemyActor : public FMassStateTreeTaskBase
{
}; // Size: 0x28

struct FWrestlerMassGetNoticedEnemyActorInstanceData
{
    class AActor* EnemyActor;                                                         // 0x0000 (size: 0x8)
    FVector EnemyLocation;                                                            // 0x0008 (size: 0x18)

}; // Size: 0x20

struct FWrestlerMassGetNoticedScaredEntity : public FMassStateTreeTaskBase
{
}; // Size: 0x28

struct FWrestlerMassGetNoticedScaredEntityInstanceData
{
    FMassEntityHandle ScaredEntity;                                                   // 0x0000 (size: 0x8)

}; // Size: 0x8

struct FWrestlerMassGetObservedPlayerActionData : public FMassStateTreeTaskBase
{
    float UpdateRate;                                                                 // 0x0028 (size: 0x4)

}; // Size: 0x30

struct FWrestlerMassGetObservedPlayerActionDataInstanceData
{
    bool bIsViolentAction;                                                            // 0x0000 (size: 0x1)
    bool bShouldBecomeWitness;                                                        // 0x0001 (size: 0x1)
    bool bShouldReact;                                                                // 0x0002 (size: 0x1)
    FName ReactionAnimName;                                                           // 0x0004 (size: 0x8)
    FGameplayTag ReactionBarkTag;                                                     // 0x000C (size: 0x8)
    float ObservedMasqueradeScore;                                                    // 0x0014 (size: 0x4)

}; // Size: 0x18

struct FWrestlerMassGetObservedUnconsciousEntity : public FMassStateTreeTaskBase
{
    float UpdateRate;                                                                 // 0x0024 (size: 0x4)

}; // Size: 0x28

struct FWrestlerMassGetObservedUnconsciousEntityInstanceData
{
    FMassEntityHandle UnconsciousEntity;                                              // 0x0000 (size: 0x8)

}; // Size: 0x8

struct FWrestlerMassGetPlayerAwarenessData : public FMassStateTreeTaskBase
{
}; // Size: 0x28

struct FWrestlerMassGetPlayerAwarenessDataInstanceData
{
    bool bCanSeePlayer;                                                               // 0x0000 (size: 0x1)
    bool bIsFullyAwareOfPlayer;                                                       // 0x0001 (size: 0x1)

}; // Size: 0x2

struct FWrestlerMassGetPlayerPositionInstanceData
{
    FVector OutPlayerPosition;                                                        // 0x0000 (size: 0x18)

}; // Size: 0x18

struct FWrestlerMassGetPlayerPositionTask : public FMassStateTreeTaskBase
{
    float RefreshRate;                                                                // 0x0024 (size: 0x4)

}; // Size: 0x28

struct FWrestlerMassGetPoliceNoticedCrime : public FMassStateTreeTaskBase
{
}; // Size: 0x28

struct FWrestlerMassGetPoliceNoticedCrimeInstanceData
{
    FMassEntityHandle PoliceEntity;                                                   // 0x0000 (size: 0x8)
    FVector PoliceLocation;                                                           // 0x0008 (size: 0x18)

}; // Size: 0x20

struct FWrestlerMassGetSmartObjectData : public FMassStateTreeTaskBase
{
}; // Size: 0x28

struct FWrestlerMassGetSmartObjectDataInstanceData
{
    bool bTeleportToSmartObject;                                                      // 0x0000 (size: 0x1)

}; // Size: 0x1

struct FWrestlerMassHasActiveBloodResonance : public FStateTreeConditionCommonBase
{
    bool bInvert;                                                                     // 0x0020 (size: 0x1)

}; // Size: 0x28

struct FWrestlerMassHasActiveBloodResonanceBehaviour : public FStateTreeConditionCommonBase
{
    bool bInvert;                                                                     // 0x0020 (size: 0x1)

}; // Size: 0x28

struct FWrestlerMassHasActiveBloodResonanceBehaviourInstanceData
{
}; // Size: 0x1

struct FWrestlerMassHasActiveBloodResonanceInstanceData
{
}; // Size: 0x1

struct FWrestlerMassHasActorRepresentationTag : public FMassTag
{
}; // Size: 0x1

struct FWrestlerMassIgnoreActorCollisionWithPawnsTag : public FMassTag
{
}; // Size: 0x1

struct FWrestlerMassIgnoreDeadBodiesTag : public FMassTag
{
}; // Size: 0x1

struct FWrestlerMassIgnoreNoisesTag : public FMassTag
{
}; // Size: 0x1

struct FWrestlerMassIgnorePlayerActionsTag : public FMassTag
{
}; // Size: 0x1

struct FWrestlerMassInformAboutCrimeNoticed : public FMassStateTreeTaskBase
{
}; // Size: 0x20

struct FWrestlerMassInformAboutCrimeNoticedInstanceData
{
    FStateTreeStructRef TargetEntity;                                                 // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FWrestlerMassIsPairedSOEntityReadyCondition : public FStateTreeConditionCommonBase
{
    bool bInvert;                                                                     // 0x0020 (size: 0x1)

}; // Size: 0x28

struct FWrestlerMassIsPairedSOEntityReadyConditionInstanceData
{
}; // Size: 0x1

struct FWrestlerMassMakeAlerted : public FMassStateTreeTaskBase
{
}; // Size: 0x20

struct FWrestlerMassMakeAlertedInstanceData
{
}; // Size: 0x1

struct FWrestlerMassMakeNoise : public FMassStateTreeTaskBase
{
    float NoiseRadius;                                                                // 0x0024 (size: 0x4)
    EWrestlerMassHearInvestigationType NoiseInvestigationType;                        // 0x0028 (size: 0x1)

}; // Size: 0x30

struct FWrestlerMassMakeNoiseInstanceData
{
    FStateTreeStructRef NoiseLocation;                                                // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FWrestlerMassMakeWitness : public FMassStateTreeTaskBase
{
    FGameplayTagContainer NoClearWithTags;                                            // 0x0028 (size: 0x20)

}; // Size: 0x48

struct FWrestlerMassMakeWitnessInstanceData
{
}; // Size: 0x1

struct FWrestlerMassMapBoundariesFragment : public FMassFragment
{
}; // Size: 0xA0

struct FWrestlerMassMeshSlotEntry : public FWrestlerMeshSlotData
{
}; // Size: 0x40

struct FWrestlerMassMeshSlotList
{
    TArray<class USkeletalMesh*> MeshesData;                                          // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FWrestlerMassModCharProfileGroup
{
    class UWrestlerModularCharacterProfiles* Profiles;                                // 0x0000 (size: 0x8)
    class UWrestlerMassModularCharacterGroup* Group;                                  // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FWrestlerMassModularCharacterArchetype
{
    EWrestlerGenderType Gender;                                                       // 0x0000 (size: 0x1)
    EWrestlerPedestrianType PedestrianType;                                           // 0x0001 (size: 0x1)
    uint8 Distribution;                                                               // 0x0002 (size: 0x1)
    FWrestlerMassModularCharacterData CharacterData;                                  // 0x0008 (size: 0x50)

}; // Size: 0x58

struct FWrestlerMassModularCharacterArchetypeGroup
{
    TArray<FWrestlerMassModularCharacterArchetype> PedestrianArchetypes;              // 0x0000 (size: 0x10)
    uint8 Distribution;                                                               // 0x0010 (size: 0x1)
    FString GroupName;                                                                // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FWrestlerMassModularCharacterData
{
    TMap<class EWrestlerMeshSlot, class FWrestlerMassModularCharacterSlotData> MeshesByBodyType; // 0x0000 (size: 0x50)

}; // Size: 0x50

struct FWrestlerMassModularCharacterEntry
{
    FWrestlerMassMeshSlotEntry MeshData;                                              // 0x0000 (size: 0x40)
    uint8 Distribution;                                                               // 0x0040 (size: 0x1)

}; // Size: 0x48

struct FWrestlerMassModularCharacterProfileData
{
    class UWrestlerModularCharacterProfile* SavedProfile;                             // 0x0058 (size: 0x8)

}; // Size: 0x60

struct FWrestlerMassModularCharacterSlotData
{
    TArray<FWrestlerMassModularCompatibleCharacterEntry> MeshEntries;                 // 0x0000 (size: 0x10)
    bool bOptionalSlot;                                                               // 0x0010 (size: 0x1)

}; // Size: 0x18

struct FWrestlerMassModularCompatibleCharacterEntry : public FWrestlerMassModularCharacterEntry
{
    TMap<class EWrestlerMeshSlot, class FWrestlerMassMeshSlotList> Incompatabilities; // 0x0048 (size: 0x50)

}; // Size: 0x98

struct FWrestlerMassMoveTo : public FMassStateTreeTaskBase
{
    float AcceptableDistance;                                                         // 0x003C (size: 0x4)
    bool bAllowPartialPath;                                                           // 0x0040 (size: 0x1)
    EWrestlerMoveSuccessCondition MoveSuccessCondition;                               // 0x0041 (size: 0x1)
    EWrestlerMassMoveUpdateType PathUpdateType;                                       // 0x0042 (size: 0x1)
    EWrestlerNavigationType NavigationType;                                           // 0x0043 (size: 0x1)
    float ZoneGraphSearchRange;                                                       // 0x0044 (size: 0x4)
    float UpdateRate;                                                                 // 0x0048 (size: 0x4)
    float MoveDistanceToRefreshPath;                                                  // 0x004C (size: 0x4)
    TArray<FWrestlerMassNavMeshProjectionBounds> ProjectPointToNavMeshBoundsData;     // 0x0050 (size: 0x10)
    TSubclassOf<class UNavigationQueryFilter> NavMeshQueryFilterClass;                // 0x0060 (size: 0x8)

}; // Size: 0x68

struct FWrestlerMassMoveToClosestZoneGraph : public FWrestlerMassMoveTo
{
}; // Size: 0x68

struct FWrestlerMassMoveToInstanceData
{
    FMassMovementStyleRef MovementStyle;                                              // 0x0000 (size: 0x18)
    float SpeedScale;                                                                 // 0x0018 (size: 0x4)
    bool bCheckRemainingPathDistance;                                                 // 0x001C (size: 0x1)
    bool bFailIfTimeOut;                                                              // 0x001D (size: 0x1)
    float TimeOutAfter;                                                               // 0x0020 (size: 0x4)

}; // Size: 0xB8

struct FWrestlerMassMovementSpeedParameters : public FMassSharedFragment
{
    float MaxSideSpeed;                                                               // 0x0000 (size: 0x4)
    float MaxBackwardSpeed;                                                           // 0x0004 (size: 0x4)

}; // Size: 0x8

struct FWrestlerMassNavMeshProjectionBounds
{
    FVector BoxOffset;                                                                // 0x0000 (size: 0x18)
    FVector BoxExtent;                                                                // 0x0018 (size: 0x18)

}; // Size: 0x30

struct FWrestlerMassPairedEntitiesFragment : public FMassFragment
{
}; // Size: 0x18

struct FWrestlerMassPairedEntitiesParamsFragment : public FMassSharedFragment
{
}; // Size: 0xC0

struct FWrestlerMassPairedEntityTypeParams
{
    bool bEnabled;                                                                    // 0x0000 (size: 0x1)
    TMap<class EWrestlerPedestrianType, class FWrestlerPercentChance> PerEntityPercentChance; // 0x0008 (size: 0x50)

}; // Size: 0x58

struct FWrestlerMassPairedSmartObjectSpawnRequestFragment : public FMassFragment
{
}; // Size: 0xB0

struct FWrestlerMassPlayContextualAnim : public FMassStateTreeTaskBase
{
    EWrestlerMassContextualAnimType ContextualAnimType;                               // 0x0030 (size: 0x4)
    bool bStopMovement;                                                               // 0x0034 (size: 0x1)
    float MinPlayAnimationDelay;                                                      // 0x0038 (size: 0x4)
    float MaxPlayAnimationDelay;                                                      // 0x003C (size: 0x4)
    bool bForceAnimationDuration;                                                     // 0x0040 (size: 0x1)
    float ForcedAnimationDuration;                                                    // 0x0044 (size: 0x4)

}; // Size: 0x48

struct FWrestlerMassPlayContextualAnimInstanceData
{
    FName ContextualAnimName;                                                         // 0x0000 (size: 0x8)
    FGameplayTag DialoguePrompt;                                                      // 0x0008 (size: 0x8)
    bool bJumpToLoop;                                                                 // 0x0010 (size: 0x1)
    class UAnimMontage* AnimMontage;                                                  // 0x0050 (size: 0x8)

}; // Size: 0x58

struct FWrestlerMassPlayerActionObserverFragment : public FMassFragment
{
}; // Size: 0x24

struct FWrestlerMassPlayerFragment : public FMassFragment
{
}; // Size: 0x1

struct FWrestlerMassQueuedTrace
{
    TArray<class AActor*> ActorsToIgnore;                                             // 0x0030 (size: 0x10)

}; // Size: 0x40

struct FWrestlerMassQueuedTraceContainer
{
}; // Size: 0x10

struct FWrestlerMassRemoveSwapFragment : public FMassStateTreeTaskBase
{
}; // Size: 0x20

struct FWrestlerMassRemoveSwapFragmentInstanceData
{
    FStateTreeStructRef TargetEntity;                                                 // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FWrestlerMassReservedSmartObjectFragment : public FMassFragment
{
}; // Size: 0x80

struct FWrestlerMassRunEQS : public FMassStateTreeTaskBase
{
    class UEnvQuery* Query;                                                           // 0x0028 (size: 0x8)
    bool bUpdateLastKnowPositionSightData;                                            // 0x0030 (size: 0x1)
    float RefreshRate;                                                                // 0x0034 (size: 0x4)
    TEnumAsByte<EEnvQueryRunMode::Type> RunMode;                                      // 0x0038 (size: 0x1)

}; // Size: 0x40

struct FWrestlerMassRunEQSInstanceData
{
    bool bOutEQSFinished;                                                             // 0x0000 (size: 0x1)
    FVector OutLocation;                                                              // 0x0008 (size: 0x18)
    class AActor* OutActor;                                                           // 0x0020 (size: 0x8)

}; // Size: 0x40

struct FWrestlerMassRunSubTreeTaskDebugStrings
{
}; // Size: 0x20

struct FWrestlerMassRunSubTreeTaskInstanceData
{
    FStateTreeInstanceData PerEntityInstanceData;                                     // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FWrestlerMassScareEntities : public FMassStateTreeTaskBase
{
    FWrestlerEntityMassTagFilter FilterTags;                                          // 0x0028 (size: 0x30)
    FWrestlerEntityMassFragmentFilter FilterFragments;                                // 0x0058 (size: 0x30)
    float ScareRadius;                                                                // 0x0088 (size: 0x4)

}; // Size: 0x90

struct FWrestlerMassScareEntitiesInstanceData
{
    FStateTreeStructRef ScareLocation;                                                // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FWrestlerMassScaredFragment : public FMassFragment
{
}; // Size: 0x8

struct FWrestlerMassSetLastKnownPosition : public FMassStateTreeTaskBase
{
    bool bPlayerAsInstigator;                                                         // 0x0024 (size: 0x1)

}; // Size: 0x28

struct FWrestlerMassSetLastKnownPositionInstanceData
{
    FVector TargetLocation;                                                           // 0x0000 (size: 0x18)
    FStateTreeStructRef InstigatorEntity;                                             // 0x0018 (size: 0x10)
    class AActor* InstigatorActor;                                                    // 0x0028 (size: 0x8)

}; // Size: 0x30

struct FWrestlerMassShouldInstantlyMoveToSmartObject : public FStateTreeConditionCommonBase
{
    bool bInvert;                                                                     // 0x0020 (size: 0x1)

}; // Size: 0x28

struct FWrestlerMassShouldInstantlyMoveToSmartObjectInstanceData
{
}; // Size: 0x1

struct FWrestlerMassShouldTransitionFromSO : public FStateTreeConditionCommonBase
{
    bool bInvert;                                                                     // 0x0020 (size: 0x1)

}; // Size: 0x28

struct FWrestlerMassShouldTransitionFromSOInstanceData
{
}; // Size: 0x1

struct FWrestlerMassSignalEntity : public FMassStateTreeTaskBase
{
    float SignalRate;                                                                 // 0x0024 (size: 0x4)

}; // Size: 0x28

struct FWrestlerMassSignalEntityInstanceData
{
}; // Size: 0x4

struct FWrestlerMassSmartObjectPropsFragment : public FObjectWrapperFragment
{
}; // Size: 0x38

struct FWrestlerMassSmartObjectQueueFragment : public FMassFragment
{
}; // Size: 0x90

struct FWrestlerMassSpawnerTableRow : public FTableRowBase
{
    EWrestlerPlayerMissionType Type;                                                  // 0x0008 (size: 0x1)
    int32 Count;                                                                      // 0x000C (size: 0x4)
    TArray<FMassSpawnedEntityType> EntityTypes;                                       // 0x0010 (size: 0x10)
    TArray<FWrestlerZGSpawnPointsGeneratorData> SpawnGeneratorsData;                  // 0x0020 (size: 0x10)

}; // Size: 0x30

struct FWrestlerMassStand : public FMassZoneGraphStandTask
{
    float StoppingChance;                                                             // 0x0030 (size: 0x4)
    FVector2D RandomTimeDeviation;                                                    // 0x0038 (size: 0x10)

}; // Size: 0x50

struct FWrestlerMassStandInstanceData : public FMassZoneGraphStandTaskInstanceData
{
    float RandomDeviation;                                                            // 0x0008 (size: 0x4)
    float TimeFactor;                                                                 // 0x000C (size: 0x4)

}; // Size: 0x10

struct FWrestlerMassStateTreeTask_RunSubTree : public FMassStateTreeTaskBase
{
    FStateTreeReference SubTree;                                                      // 0x0020 (size: 0x18)

}; // Size: 0x48

struct FWrestlerMassSwapAIFragment : public FMassFragment
{
}; // Size: 0x70

struct FWrestlerMassTransformsAndGenderSpawnData
{
}; // Size: 0x20

struct FWrestlerMassTurnOffVolumeFragment : public FMassFragment
{
}; // Size: 0x8

struct FWrestlerMassUseAIActor : public FMassStateTreeTaskBase
{
    bool bChangeTeam;                                                                 // 0x0022 (size: 0x1)
    EWrestlerGameTeam NewTeam;                                                        // 0x0023 (size: 0x1)
    bool bUsePlayerAsInitialTarget;                                                   // 0x0024 (size: 0x1)
    bool bSwapBackOnExit;                                                             // 0x0025 (size: 0x1)
    FWrestlerEntityMassTagFilter FilterTags;                                          // 0x0028 (size: 0x30)
    FWrestlerEntityMassFragmentFilter FilterFragments;                                // 0x0058 (size: 0x30)

}; // Size: 0x88

struct FWrestlerMassUseAIActorInstanceData
{
    class AActor* TargetActor;                                                        // 0x0000 (size: 0x8)

}; // Size: 0x8

struct FWrestlerMassUseGameplayAbilityFragment : public FMassFragment
{
}; // Size: 0x360

struct FWrestlerMassUseGameplayAbilityInstanceData
{
    FGameplayEventData AbilityData;                                                   // 0x0000 (size: 0xB0)

}; // Size: 0xB8

struct FWrestlerMassUseGameplayAbilityTask : public FMassStateTreeTaskBase
{
}; // Size: 0x28

struct FWrestlerMassUseGameplayAbilityTaskTag : public FMassTag
{
}; // Size: 0x1

struct FWrestlerMassUseSmartObjectTask : public FMassUseSmartObjectTask
{
    float TimeToDetectSmartObjectIterruption;                                         // 0x0044 (size: 0x4)
    FName InterruptReactionAnimName;                                                  // 0x0048 (size: 0x8)
    FGameplayTag InterruptReactionBarkTag;                                            // 0x0050 (size: 0x8)

}; // Size: 0x58

struct FWrestlerMassUseSmartObjectTaskInstanceData : public FMassUseSmartObjectTaskInstanceData
{
    class UWrestlerMassUseSOBehaviorDefinition* UsingBehaviourDefinition;             // 0x0028 (size: 0x8)

}; // Size: 0x30

struct FWrestlerMassVisibilityFragment : public FMassFragment
{
    float TimeToConsiderNotVisible;                                                   // 0x000C (size: 0x4)
    float CloseDistance;                                                              // 0x0010 (size: 0x4)
    float FarDistance;                                                                // 0x0014 (size: 0x4)

}; // Size: 0x18

struct FWrestlerMassWait : public FMassStateTreeTaskBase
{
    bool bInfiniteWait;                                                               // 0x0020 (size: 0x1)
    float Duration;                                                                   // 0x0024 (size: 0x4)
    FVector2D RandomTimeDeviation;                                                    // 0x0028 (size: 0x10)

}; // Size: 0x40

struct FWrestlerMassWaitInstanceData
{
}; // Size: 0x4

struct FWrestlerMassWakeUpUnconsciousEntity : public FMassStateTreeTaskBase
{
}; // Size: 0x28

struct FWrestlerMassWakeUpUnconsciousEntityInstanceData
{
    FMassEntityHandle UnconsciousEntity;                                              // 0x0000 (size: 0x8)

}; // Size: 0x8

struct FWrestlerMassWallaData
{
    TArray<FWrestlerMassWallaQueryData> QueryData;                                    // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FWrestlerMassWallaQueryData
{
    int32 ID;                                                                         // 0x0000 (size: 0x4)
    int32 Count;                                                                      // 0x0004 (size: 0x4)
    FVector AverageLocation;                                                          // 0x0008 (size: 0x18)
    float FearFactor;                                                                 // 0x0020 (size: 0x4)

}; // Size: 0x28

struct FWrestlerMassZoneGraphMovePreciseTask : public FMassStateTreeTaskBase
{
}; // Size: 0x38

struct FWrestlerMassZoneGraphMovePreciseTaskInstanceData
{
    FSmartObjectClaimHandle ClaimedSlot;                                              // 0x0000 (size: 0x20)
    bool bTeleportToSlot;                                                             // 0x0020 (size: 0x1)

}; // Size: 0x28

struct FWrestlerMassZoneGraphNavigationAvoidanceParameters
{
    bool bUseMoveTargetOffsetting;                                                    // 0x0000 (size: 0x1)
    float MoveTargetOffsetFactor;                                                     // 0x0004 (size: 0x4)
    float MoveTargetOffsetMax;                                                        // 0x0008 (size: 0x4)
    float MoveTargetOffsetInLerp;                                                     // 0x000C (size: 0x4)
    float MoveTargetOffsetOutLerp;                                                    // 0x0010 (size: 0x4)
    bool bEnableAvoidanceForce;                                                       // 0x0014 (size: 0x1)
    bool bEnableSeparationForce;                                                      // 0x0015 (size: 0x1)

}; // Size: 0x18

struct FWrestlerMassZoneGraphNavigationParameters : public FMassSharedFragment
{
    TArray<FWrestlerMassZoneGraphNavigationTagChance> LaneChances;                    // 0x0000 (size: 0x10)
    FWrestlerMassZoneGraphNavigationAvoidanceParameters AvoidanceParams;              // 0x0010 (size: 0x18)
    bool bOverrideEndOfPathOffset;                                                    // 0x0028 (size: 0x1)
    float OverriddenEndOfPathOffset;                                                  // 0x002C (size: 0x4)

}; // Size: 0x30

struct FWrestlerMassZoneGraphNavigationTagChance
{
    FZoneGraphTagMask Tag;                                                            // 0x0000 (size: 0x4)
    float AllowedChance;                                                              // 0x0004 (size: 0x4)

}; // Size: 0x8

struct FWrestlerMeshSlotData
{
    EWrestlerMeshSlot Type;                                                           // 0x0000 (size: 0x1)
    bool bRandomizeMesh;                                                              // 0x0001 (size: 0x1)
    bool bRandomizeMaterial;                                                          // 0x0002 (size: 0x1)
    class USkeletalMesh* SKMesh;                                                      // 0x0008 (size: 0x8)
    TArray<class UMaterialInterface*> ChosenMaterials;                                // 0x0010 (size: 0x10)
    TArray<FWrestlerMeshSlotMaterialSet> MaterialOptions;                             // 0x0020 (size: 0x10)
    class UAkSwitchValue* AudioSwitch;                                                // 0x0030 (size: 0x8)

}; // Size: 0x40

struct FWrestlerMeshSlotMaterialSet
{
    TArray<class UMaterialInterface*> ChosenMaterials;                                // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FWrestlerMetadataData
{
    FString SaveSlotName;                                                             // 0x0000 (size: 0x10)
    FDateTime DateTimeStamp;                                                          // 0x0010 (size: 0x8)
    EWrestlerSaveGameVersion Version;                                                 // 0x0018 (size: 0x1)
    FText SaveGameTitle;                                                              // 0x0020 (size: 0x18)
    FText SaveGameDescription;                                                        // 0x0038 (size: 0x18)
    EPlayerClan PlayerClan;                                                           // 0x0050 (size: 0x1)

}; // Size: 0x58

struct FWrestlerModifyMassTags : public FMassStateTreeTaskBase
{
    TArray<FInstancedStruct> TagsToAdd;                                               // 0x0020 (size: 0x10)
    TArray<FInstancedStruct> TagsToRemove;                                            // 0x0030 (size: 0x10)
    bool bRevertOnExit;                                                               // 0x0040 (size: 0x1)

}; // Size: 0x48

struct FWrestlerModifyMassTagsInstanceData
{
    FStateTreeStructRef TargetEntity;                                                 // 0x0000 (size: 0x10)

}; // Size: 0x18

struct FWrestlerModifyTagsInEntity : public FMassStateTreeTaskBase
{
    TArray<EWrestlerMassGameplayTags> TagsToAdd;                                      // 0x0028 (size: 0x10)
    TArray<EWrestlerMassGameplayTags> TagsToRemove;                                   // 0x0038 (size: 0x10)
    bool bSignalWhenTagsChanged;                                                      // 0x0048 (size: 0x1)
    bool bRevertOnExit;                                                               // 0x0049 (size: 0x1)

}; // Size: 0x50

struct FWrestlerModifyTagsInEntityInstanceData
{
    FStateTreeStructRef TargetEntity;                                                 // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FWrestlerModularCharacterRandomTypeContstraints
{
    bool bOverrideGenerateOnlyGender;                                                 // 0x0000 (size: 0x1)
    EWrestlerGenderType GenerateOnlyGender;                                           // 0x0001 (size: 0x1)
    bool bOverrideGenerateOnlyPedType;                                                // 0x0002 (size: 0x1)
    EWrestlerPedestrianType GenerateOnlyPedestrianType;                               // 0x0003 (size: 0x1)
    bool bOverrideGenerateOnlyDescriptor;                                             // 0x0004 (size: 0x1)
    FString GenerateOnlyDescriptor;                                                   // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FWrestlerMomentumAbilityChargeParameters
{
    TEnumAsByte<ECollisionChannel> CollisionChannelWorldOnly;                         // 0x0000 (size: 0x1)
    float ChargeMinTime;                                                              // 0x0004 (size: 0x4)
    float ChargeMaxTime;                                                              // 0x0008 (size: 0x4)
    float MinDistance;                                                                // 0x000C (size: 0x4)
    float MaxDistance;                                                                // 0x0010 (size: 0x4)
    float TargetRadius;                                                               // 0x0014 (size: 0x4)
    float MaxDrop;                                                                    // 0x0018 (size: 0x4)
    float MaxStoppingDrop;                                                            // 0x001C (size: 0x4)
    float TraversalTestSpacing;                                                       // 0x0020 (size: 0x4)
    float TimeSlowPercent;                                                            // 0x0024 (size: 0x4)
    float DamageRadius;                                                               // 0x0028 (size: 0x4)
    float PlayerSlowPercent;                                                          // 0x002C (size: 0x4)
    class UAnimMontage* MontageToPlay;                                                // 0x0030 (size: 0x8)
    class UWrestlerControlCue* ControlReleasedCue;                                    // 0x0038 (size: 0x8)
    bool bDrawDebug;                                                                  // 0x0040 (size: 0x1)

}; // Size: 0x48

struct FWrestlerMomentumAbilityMoveParameters
{
    float SpeedAtMinCharge;                                                           // 0x0000 (size: 0x4)
    float SpeedAtMaxCharge;                                                           // 0x0004 (size: 0x4)
    float DamageAtMinCharge;                                                          // 0x0008 (size: 0x4)
    float DamageAtMaxCharge;                                                          // 0x000C (size: 0x4)
    float DamageRadius;                                                               // 0x0010 (size: 0x4)
    float DamageDistance;                                                             // 0x0014 (size: 0x4)
    class UCurveFloat* ChargeCurve;                                                   // 0x0018 (size: 0x8)
    float ChargeProportion;                                                           // 0x0020 (size: 0x4)
    FVector destination;                                                              // 0x0028 (size: 0x18)
    class AActor* PrimaryTarget;                                                      // 0x0040 (size: 0x8)

}; // Size: 0x48

struct FWrestlerMontageFragment : public FMassFragment
{
}; // Size: 0x170

struct FWrestlerMoveSpeedOverrideFragment : public FMassFragment
{
}; // Size: 0x18

struct FWrestlerMoveToEntity : public FWrestlerMoveToLocation
{
}; // Size: 0x70

struct FWrestlerMoveToEntityInstanceData : public FWrestlerMoveToLocationInstanceData
{
    FStateTreeStructRef TargetEntity;                                                 // 0x00D0 (size: 0x10)

}; // Size: 0xE0

struct FWrestlerMoveToLocation : public FWrestlerMassMoveTo
{
    float MinimalDistance;                                                            // 0x0068 (size: 0x4)

}; // Size: 0x70

struct FWrestlerMoveToLocationInstanceData : public FWrestlerMassMoveToInstanceData
{
    FVector TargetLocation;                                                           // 0x00B8 (size: 0x18)

}; // Size: 0xD0

struct FWrestlerMoveToPlayer : public FWrestlerMoveToLocation
{
}; // Size: 0x70

struct FWrestlerMovementSetInfo
{
    float WalkSpeed;                                                                  // 0x0000 (size: 0x4)
    float Acceleration;                                                               // 0x0004 (size: 0x4)
    float SprintDistanceThreshold;                                                    // 0x0008 (size: 0x4)
    bool bStrafing;                                                                   // 0x000C (size: 0x1)
    float RotationInterpolationSpeed;                                                 // 0x0010 (size: 0x4)
    bool bTurnSetEnabled;                                                             // 0x0014 (size: 0x1)

}; // Size: 0x18

struct FWrestlerMusicSting
{
    class UAkAudioEvent* TriggerEvent;                                                // 0x0000 (size: 0x8)

}; // Size: 0x10

struct FWrestlerMusicTagEventSectionTemplate : public FMovieSceneEvalTemplate
{
    class UWrestlerMusicTagMovieSceneSection* Section;                                // 0x0020 (size: 0x8)

}; // Size: 0x30

struct FWrestlerMusicTagMovieSceneTrackImplementation : public FMovieSceneTrackImplementation
{
}; // Size: 0x10

struct FWrestlerNavigableWidgetData
{
    EWrestlerNavigableWidgetMode NavigationMode;                                      // 0x0000 (size: 0x1)
    float MaxSizeForBoundaries;                                                       // 0x0004 (size: 0x4)
    bool bMoveBGKWithKeys;                                                            // 0x0008 (size: 0x1)
    bool bMoveBKGWithInputWhenThresholdReached;                                       // 0x0009 (size: 0x1)
    bool bCenterCursorIfNoInput;                                                      // 0x000A (size: 0x1)
    float MovementDeadZone;                                                           // 0x000C (size: 0x4)
    FVector2D BackgroundBoundariesThreshold;                                          // 0x0010 (size: 0x10)
    FVector2D FloatingCursorBoundariesThreshold;                                      // 0x0020 (size: 0x10)
    float RadialBoundaryThreshold;                                                    // 0x0030 (size: 0x4)
    FVector2D MouseBoundariesThreshold;                                               // 0x0038 (size: 0x10)
    float TranslationSpeedRate;                                                       // 0x0048 (size: 0x4)
    FRuntimeFloatCurve HoveringSpeedCurveData;                                        // 0x0050 (size: 0x88)
    float RecenterCursorIfNoInputSpeed;                                               // 0x00D8 (size: 0x4)
    float ZoomRate;                                                                   // 0x00DC (size: 0x4)
    float TranslationSpeed;                                                           // 0x00E0 (size: 0x4)
    float ResetSpeed;                                                                 // 0x00E4 (size: 0x4)
    float ZoomDeadZone;                                                               // 0x00E8 (size: 0x4)
    FRuntimeFloatCurve ZoomCurveData;                                                 // 0x00F0 (size: 0x88)
    float MaxZoomInputGamepad;                                                        // 0x0178 (size: 0x4)
    bool bUseCanvasLocation;                                                          // 0x017C (size: 0x1)
    float OuterSnapThresholdRadius;                                                   // 0x0180 (size: 0x4)
    float InnerSnapThresholdRadius;                                                   // 0x0184 (size: 0x4)
    float PreSnapHysteresis;                                                          // 0x0188 (size: 0x4)
    bool bSnapBKGIndependentlyWhenInFloatingMode;                                     // 0x018C (size: 0x1)
    float SnapSpeed;                                                                  // 0x0190 (size: 0x4)
    float BKGSnapSpeed;                                                               // 0x0194 (size: 0x4)

}; // Size: 0x198

struct FWrestlerNoiseHearingFragment : public FMassFragment
{
}; // Size: 0x20

struct FWrestlerNoiseInvestigationTag : public FMassTag
{
}; // Size: 0x1

struct FWrestlerNoiseResponse : public FMassStateTreeTaskBase
{
    float MoveTowardsNoiseDistance;                                                   // 0x0024 (size: 0x4)

}; // Size: 0x28

struct FWrestlerNoiseResponseInstanceData
{
    FVector MoveDesiredLocation;                                                      // 0x0000 (size: 0x18)
    FVector NoiseLocation;                                                            // 0x0018 (size: 0x18)

}; // Size: 0x30

struct FWrestlerNotificationData
{
    FText BigTitle;                                                                   // 0x0000 (size: 0x18)
    FText SmallTitle;                                                                 // 0x0018 (size: 0x18)
    float Timer;                                                                      // 0x0030 (size: 0x4)
    ENotificationType NotificationType;                                               // 0x0034 (size: 0x1)
    class UTexture2D* SideNotificationIcon;                                           // 0x0038 (size: 0x8)
    EHeraDialogueReactionClass ReactionType;                                          // 0x0040 (size: 0x1)
    bool bHasShortcutTab;                                                             // 0x0041 (size: 0x1)
    bool bShouldDismissOnShortcut;                                                    // 0x0042 (size: 0x1)
    bool bShowXPFill;                                                                 // 0x0043 (size: 0x1)
    EWrestlerRPGMenuTabID AssociatedRPGMenuTab;                                       // 0x0044 (size: 0x1)
    FString CodexItemID;                                                              // 0x0048 (size: 0x10)

}; // Size: 0x58

struct FWrestlerObjectTagData
{
    FString Tag;                                                                      // 0x0000 (size: 0x10)
    TArray<TSoftObjectPtr<UObject>> Objects;                                          // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FWrestlerObjectTagSaveData
{
    TSet<FWrestlerObjectTagData> Data;                                                // 0x0000 (size: 0x50)

}; // Size: 0x50

struct FWrestlerOpenQuestData
{
    FGameplayTag QuestTag;                                                            // 0x0000 (size: 0x8)
    class UWrestlerQuestData* QuestData;                                              // 0x0008 (size: 0x8)
    TArray<FWrestlerQuestObjective> OpenObjectives;                                   // 0x0010 (size: 0x10)
    FWrestlerTagDelegates TagDelegates;                                               // 0x0020 (size: 0x20)
    FWrestlerEnemiesQuestData EnemiesQuestData;                                       // 0x0040 (size: 0x50)
    int32 CurrentObjectiveIndex;                                                      // 0x0090 (size: 0x4)

}; // Size: 0x98

struct FWrestlerOutfitData
{
    TSoftObjectPtr<UTexture2D> CostumeTextureSmall;                                   // 0x0000 (size: 0x28)
    TSoftObjectPtr<UTexture2D> CostumeTexture;                                        // 0x0028 (size: 0x28)
    TSoftObjectPtr<USkeletalMesh> CostumeMesh_FP;                                     // 0x0050 (size: 0x28)
    TSoftObjectPtr<USkeletalMesh> CostumeMesh_TP;                                     // 0x0078 (size: 0x28)

}; // Size: 0xA0

struct FWrestlerPassWitnessData : public FMassStateTreeTaskBase
{
}; // Size: 0x28

struct FWrestlerPassWitnessDataInstanceData
{
    FStateTreeStructRef TargetEntity;                                                 // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FWrestlerPawnParms
{
    FWrestlerPlayerStateParms StateParams;                                            // 0x0000 (size: 0x14)
    FWrestlerPlayerMovementParams MovementParams;                                     // 0x0014 (size: 0x1C)

}; // Size: 0x30

struct FWrestlerPedestrianInteractionList
{
    TArray<FWrestlerSOInteractionEntry> Entries;                                      // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FWrestlerPedestrianInteractionSOEntry
{
    TMap<class EWrestlerPedestrianType, class FWrestlerPedestrianInteractionList> SecondPedType; // 0x0000 (size: 0x50)

}; // Size: 0x50

struct FWrestlerPercentChance
{
    float PercentChance;                                                              // 0x0000 (size: 0x4)

}; // Size: 0x4

struct FWrestlerPerformanceCameraInfo
{
    EWrestlerPerformanceCameraType Type;                                              // 0x0000 (size: 0x1)
    FGameplayTag MapTag;                                                              // 0x0004 (size: 0x8)
    FName Name;                                                                       // 0x000C (size: 0x8)
    FSoftObjectPath AssetPath;                                                        // 0x0018 (size: 0x20)
    FVector Position;                                                                 // 0x0038 (size: 0x18)
    FRotator Rotation;                                                                // 0x0050 (size: 0x18)
    FVector Scale;                                                                    // 0x0068 (size: 0x18)

}; // Size: 0x80

struct FWrestlerPlayMontage
{
    class UAnimMontage* MontageToPlay;                                                // 0x0000 (size: 0x8)
    float Rate;                                                                       // 0x0008 (size: 0x4)
    FName StartSection;                                                               // 0x000C (size: 0x8)
    bool bStopWhenAbilityEnds;                                                        // 0x0014 (size: 0x1)
    float AnimRootMotionTranslationScale;                                             // 0x0018 (size: 0x4)
    float StartTimeSeconds;                                                           // 0x001C (size: 0x4)

}; // Size: 0x20

struct FWrestlerPlayerActionReactionData
{
    float ReactPercentageChanceToPlayerActions;                                       // 0x0000 (size: 0x4)
    FName ReactionAnimName;                                                           // 0x0004 (size: 0x8)
    FGameplayTag ReactionBarkTag;                                                     // 0x000C (size: 0x8)

}; // Size: 0x14

struct FWrestlerPlayerControlledGameplayTargetDataFilter : public FGameplayTargetDataFilter
{
}; // Size: 0x20

struct FWrestlerPlayerHasAnyGameplayTagCondition : public FStateTreeConditionCommonBase
{
    bool bInvert;                                                                     // 0x0020 (size: 0x1)
    FGameplayTagContainer GameplayTags;                                               // 0x0028 (size: 0x20)

}; // Size: 0x48

struct FWrestlerPlayerHasAnyGameplayTagInstanceData
{
}; // Size: 0x1

struct FWrestlerPlayerMovementParams
{
    float JumpZVelocity;                                                              // 0x0000 (size: 0x4)
    float MaxCrouchSpeed;                                                             // 0x0004 (size: 0x4)
    float GravityScale;                                                               // 0x0008 (size: 0x4)
    float MaxAcceleration;                                                            // 0x000C (size: 0x4)
    float BrakingFriction;                                                            // 0x0010 (size: 0x4)
    float AirControl;                                                                 // 0x0014 (size: 0x4)
    bool bCanCrouch;                                                                  // 0x0018 (size: 0x1)
    bool bCanJump;                                                                    // 0x0019 (size: 0x1)

}; // Size: 0x1C

struct FWrestlerPlayerSaveData
{
    FSoftObjectPath PlayerStart;                                                      // 0x0000 (size: 0x20)
    bool bCrouched;                                                                   // 0x0020 (size: 0x1)
    EPlayerClan PlayerClan;                                                           // 0x0021 (size: 0x1)
    EWrestlerPlayerDifficulty PlayerDifficulty;                                       // 0x0022 (size: 0x1)
    FGameplayTagContainer BlockedAbilities;                                           // 0x0028 (size: 0x20)
    TMap<FGameplayAttribute, float> PlayerAttributes;                                 // 0x0048 (size: 0x50)

}; // Size: 0x98

struct FWrestlerPlayerSightTest : public FMassStateTreeTaskBase
{
    float EyeHeight;                                                                  // 0x0028 (size: 0x4)
    float MaxDistance;                                                                // 0x002C (size: 0x4)

}; // Size: 0x30

struct FWrestlerPlayerSightTestInstanceData
{
    bool bCanSeePlayer;                                                               // 0x0008 (size: 0x1)

}; // Size: 0x10

struct FWrestlerPlayerStateParms
{
    float MaxHealth;                                                                  // 0x0000 (size: 0x4)
    float MaxBlood;                                                                   // 0x0004 (size: 0x4)
    float AttackPower;                                                                // 0x0008 (size: 0x4)
    float HeavyFallSpeedThreshold;                                                    // 0x000C (size: 0x4)
    float MaxHeightForFloorCast;                                                      // 0x0010 (size: 0x4)

}; // Size: 0x14

struct FWrestlerPlaythroughSaveData
{
    FGuid PlaythroughGUID;                                                            // 0x0000 (size: 0x10)
    FString CurrentActivityID;                                                        // 0x0010 (size: 0x10)
    FCommonLoadingScreenPresetAttributes LoadingPreset;                               // 0x0020 (size: 0x50)

}; // Size: 0x70

struct FWrestlerPointAxis
{
    FVector ForwardVector;                                                            // 0x0000 (size: 0x18)
    FVector UpVector;                                                                 // 0x0018 (size: 0x18)

}; // Size: 0x30

struct FWrestlerPoliceTag : public FMassTag
{
}; // Size: 0x1

struct FWrestlerPositionedPlane
{
}; // Size: 0x40

struct FWrestlerPromptDialogues
{
    TArray<class UHeraDialogueInfo*> DialogueInfos;                                   // 0x0000 (size: 0x10)
    class UHeraDialogueInfo* SharedPromptStory;                                       // 0x0010 (size: 0x8)

}; // Size: 0x18

struct FWrestlerQualityDeviceProfileVariant
{
    FText DisplayName;                                                                // 0x0000 (size: 0x18)
    FString DeviceProfileSuffix;                                                      // 0x0018 (size: 0x10)
    int32 MinRefreshRate;                                                             // 0x0028 (size: 0x4)

}; // Size: 0x30

struct FWrestlerQuestObjective
{
    FString Objective;                                                                // 0x0000 (size: 0x10)
    bool bOverrideTitle;                                                              // 0x0010 (size: 0x1)
    FText TitleOverride;                                                              // 0x0018 (size: 0x18)
    FText Description;                                                                // 0x0030 (size: 0x18)
    class UHeraDialogueInfo* StoryDialogueInfo;                                       // 0x0048 (size: 0x8)
    TSet<UHeraPropertyBool*> ObjectiveCompletedProperties;                            // 0x0050 (size: 0x50)
    bool bUseSideQuestIcon;                                                           // 0x00A0 (size: 0x1)
    TSoftObjectPtr<AActor> ObjectToTag;                                               // 0x00A8 (size: 0x28)

}; // Size: 0xD0

struct FWrestlerQuestProgressData
{
    FText ActiveQuestTitle;                                                           // 0x0000 (size: 0x18)
    FText ActiveQuestDescription;                                                     // 0x0018 (size: 0x18)
    FGameplayTag ActiveQuestTag;                                                      // 0x0030 (size: 0x8)
    TArray<FGameplayTag> CompletedQuestTags;                                          // 0x0038 (size: 0x10)
    TArray<FWrestlerOpenQuestData> OpenQuests;                                        // 0x0048 (size: 0x10)

}; // Size: 0x58

struct FWrestlerRPGMenuTabData
{
    EWrestlerRPGMenuTabID TabId;                                                      // 0x0000 (size: 0x1)
    FText TabTitle;                                                                   // 0x0008 (size: 0x18)
    TSubclassOf<class UWrestlerRPGMenuTabWidget> TabWidgetClass;                      // 0x0020 (size: 0x8)
    bool bCurrentlyAvailable;                                                         // 0x0028 (size: 0x1)
    FName SettingCollectionName;                                                      // 0x002C (size: 0x8)
    class UInputMappingContext* PlayerMappingContext;                                 // 0x0038 (size: 0x8)

}; // Size: 0x40

struct FWrestlerRangedAttackEQSSettings
{
    float RangedGapCloseMinDistance;                                                  // 0x0000 (size: 0x4)
    float RangedGapCloseMaxDistance;                                                  // 0x0004 (size: 0x4)

}; // Size: 0x8

struct FWrestlerRangedRotateConfig
{
    float CatchupSpeed;                                                               // 0x0000 (size: 0x4)
    float OffsetClamp;                                                                // 0x0004 (size: 0x4)
    float RotationRate;                                                               // 0x0008 (size: 0x4)
    class UCurveFloat* TurnCurve;                                                     // 0x0010 (size: 0x8)
    FName SocketName;                                                                 // 0x0018 (size: 0x8)
    double TargetHeightOffset;                                                        // 0x0020 (size: 0x8)

}; // Size: 0x28

struct FWrestlerRemoveTagsOnExit : public FMassStateTreeTaskBase
{
    TArray<EWrestlerMassGameplayTags> TagsToRemove;                                   // 0x0028 (size: 0x10)

}; // Size: 0x38

struct FWrestlerRemoveTagsOnExitInstanceData
{
    FStateTreeStructRef TargetEntity;                                                 // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FWrestlerResetEntityTag : public FMassTag
{
}; // Size: 0x1

struct FWrestlerRunAwayFromFearSource : public FWrestlerMassMoveTo
{
    uint8 SearchDepth;                                                                // 0x006A (size: 0x1)
    float AcceptableDistanceThreshold;                                                // 0x006C (size: 0x4)
    float MinimumMoveAngleToDanger;                                                   // 0x0070 (size: 0x4)
    float AvoidDangerRadius;                                                          // 0x0074 (size: 0x4)
    float MinimumPathLength;                                                          // 0x0078 (size: 0x4)

}; // Size: 0x80

struct FWrestlerSOInteractionEntry
{
    TSubclassOf<class AActor> SmartObjectActorTemplate;                               // 0x0000 (size: 0x8)
    float SpawnProbability;                                                           // 0x0008 (size: 0x4)

}; // Size: 0x10

struct FWrestlerSaveSlotPromptData
{
}; // Size: 0x50

struct FWrestlerScalabilitySnapshot
{
}; // Size: 0x60

struct FWrestlerScaredTag : public FMassTag
{
}; // Size: 0x1

struct FWrestlerScoredInteraction
{
    FWrestlerInteractionTarget Target;                                                // 0x0008 (size: 0x10)

}; // Size: 0x20

struct FWrestlerSearchLastKnownPosition : public FWrestlerMassMoveTo
{
    float SearchRadius;                                                               // 0x006C (size: 0x4)

}; // Size: 0x70

struct FWrestlerSearchTeam
{
    TMap<class AActor*, class EWrestlerSearchTeamStatus> Team;                        // 0x0000 (size: 0x50)
    class AActor* TeamCaptain;                                                        // 0x0050 (size: 0x8)
    FVector SearchSpot;                                                               // 0x0058 (size: 0x18)
    EWrestlerSearchTeamType Type;                                                     // 0x0070 (size: 0x1)
    int32 NumberSearchesLeft;                                                         // 0x0074 (size: 0x4)

}; // Size: 0x78

struct FWrestlerSelectByTagGameplayTargetDataFilter : public FGameplayTargetDataFilter
{
    FGameplayTagContainer TagContainer;                                               // 0x0020 (size: 0x20)

}; // Size: 0x40

struct FWrestlerSequenceBinding
{
    FName BindingTag;                                                                 // 0x0000 (size: 0x8)
    TArray<class AActor*> Actors;                                                     // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FWrestlerSequenceSettings
{
    TArray<FWrestlerSequenceBinding> BindingsList;                                    // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FWrestlerSetFocus : public FMassStateTreeTaskBase
{
    bool bFocusOnPlayer;                                                              // 0x0026 (size: 0x1)
    bool bFocusAhead;                                                                 // 0x0027 (size: 0x1)
    float FocusDuration;                                                              // 0x0028 (size: 0x4)
    float MinAngleToStartRotating;                                                    // 0x002C (size: 0x4)

}; // Size: 0x30

struct FWrestlerSetFocusInstanceData
{
    FStateTreeStructRef FocusingEntity;                                               // 0x0000 (size: 0x10)
    FStateTreeStructRef TargetEntity;                                                 // 0x0010 (size: 0x10)
    class AActor* TargetActor;                                                        // 0x0020 (size: 0x8)
    FStateTreeStructRef TargetLocation;                                               // 0x0028 (size: 0x10)

}; // Size: 0x68

struct FWrestlerSetGameplayTags : public FMassStateTreeTaskBase
{
    FGameplayTagContainer GameplayTagsToAdd;                                          // 0x0028 (size: 0x20)

}; // Size: 0x48

struct FWrestlerSetGameplayTagsInstanceData
{
}; // Size: 0x1

struct FWrestlerShouldResetScaredRunningPath : public FStateTreeConditionCommonBase
{
    bool bInvert;                                                                     // 0x0020 (size: 0x1)

}; // Size: 0x28

struct FWrestlerShouldResetScaredRunningPathInstanceData
{
}; // Size: 0x1

struct FWrestlerShouldScaredEntityCowerCondition : public FStateTreeConditionCommonBase
{
    bool bInvert;                                                                     // 0x0020 (size: 0x1)
    float MinScareDuration;                                                           // 0x0024 (size: 0x4)
    float MaxScareDuration;                                                           // 0x0028 (size: 0x4)
    float MinimumTimeOnRequiredArea;                                                  // 0x002C (size: 0x4)
    float CowerPercentageChance;                                                      // 0x0030 (size: 0x4)
    TSubclassOf<class UNavigationQueryFilter> NavMeshFilterClass;                     // 0x0038 (size: 0x8)
    FZoneGraphTagFilter ZoneGraphLaneTags;                                            // 0x0040 (size: 0xC)

}; // Size: 0x50

struct FWrestlerShouldScaredEntityCowerInstanceData
{
}; // Size: 0x8

struct FWrestlerSignificanceBucket
{
    float MaxDistance;                                                                // 0x0000 (size: 0x4)
    float SignificanceValueOnScreen;                                                  // 0x0004 (size: 0x4)
    float SignificanceValueOffScreen;                                                 // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FWrestlerSignificanceBucketContainer
{
    TArray<FWrestlerSignificanceBucket> SignificanceBuckets;                          // 0x0000 (size: 0x10)
    TArray<FWrestlerSignificanceEffect> SignificanceEffects;                          // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FWrestlerSignificanceEffect
{
    float MaxSignificance;                                                            // 0x0000 (size: 0x4)
    EWrestlerSignificanceOptimizationLevel OptimizationLevel;                         // 0x0004 (size: 0x1)
    float TickRate;                                                                   // 0x0008 (size: 0x4)
    bool CullShadows;                                                                 // 0x000C (size: 0x1)

}; // Size: 0x10

struct FWrestlerSimplifyAbilityDataStruct
{
    FString AbilityID;                                                                // 0x0000 (size: 0x10)
    FString AbilityName;                                                              // 0x0010 (size: 0x10)
    class UTexture2D* AbilityIcon;                                                    // 0x0020 (size: 0x8)
    FString Description;                                                              // 0x0028 (size: 0x10)
    TArray<FTrainingCost> AbilityTrainingCost;                                        // 0x0038 (size: 0x10)

}; // Size: 0x48

struct FWrestlerSmartObjectBehaviourData
{
    FName ContextualAnimationName;                                                    // 0x0000 (size: 0x8)
    TArray<EWrestlerPedestrianType> AllowedPedestrianTypes;                           // 0x0008 (size: 0x10)
    TArray<EWrestlerGenderType> AllowedGenderTypes;                                   // 0x0018 (size: 0x10)
    float InteractionCooldown;                                                        // 0x0028 (size: 0x4)
    bool bOverrideAnimMontagePlayTime;                                                // 0x002C (size: 0x1)
    float UseTime;                                                                    // 0x0030 (size: 0x4)
    int32 Idx;                                                                        // 0x0034 (size: 0x4)

}; // Size: 0x38

struct FWrestlerSmartObjectDataDefinitionTableRow : public FTableRowBase
{
    FName RowName;                                                                    // 0x0008 (size: 0x8)
    TArray<FWrestlerSmartObjectBehaviourData> BehavioursData;                         // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FWrestlerSmartObjectFindOptionsFragment : public FMassFragment
{
}; // Size: 0xC

struct FWrestlerSmartObjectSlotStateData : public FSmartObjectSlotStateData
{
}; // Size: 0x8

struct FWrestlerSmartObjectUserData
{
    TSoftObjectPtr<UAnimMontage> SmartObjectAnim;                                     // 0x0000 (size: 0x28)
    float MaxConsiderDistanceBehind;                                                  // 0x0040 (size: 0x4)
    float MinConsiderDistanceAhead;                                                   // 0x0044 (size: 0x4)
    float MaxConsiderDistanceAhead;                                                   // 0x0048 (size: 0x4)
    float DynamicSearchDistance;                                                      // 0x004C (size: 0x4)
    float DynamicSearchHeight;                                                        // 0x0050 (size: 0x4)
    bool bAllowFindingBehindEntity;                                                   // 0x0054 (size: 0x1)

}; // Size: 0x60

struct FWrestlerSmartObjectUserDataFragment : public FMassFragment
{
}; // Size: 0x60

struct FWrestlerSmoothOrientationFragment : public FMassSharedFragment
{
    float EndOfPathDuration;                                                          // 0x0000 (size: 0x4)
    float OrientationSmoothingTime;                                                   // 0x0004 (size: 0x4)
    float MinRotationSpeed;                                                           // 0x0008 (size: 0x4)
    float MinVelocityWeightSpeed;                                                     // 0x000C (size: 0x4)
    FMassSmoothOrientationWeights Moving;                                             // 0x0010 (size: 0x8)
    FMassSmoothOrientationWeights Standing;                                           // 0x0018 (size: 0x8)

}; // Size: 0x20

struct FWrestlerSpecialInput
{
    class UInputAction* Action;                                                       // 0x0000 (size: 0x8)
    FName ID;                                                                         // 0x0008 (size: 0x8)
    FKey Key;                                                                         // 0x0010 (size: 0x18)

}; // Size: 0x28

struct FWrestlerSpecialMappingData
{
    FName ID;                                                                         // 0x0000 (size: 0x8)
    FText DisplayName;                                                                // 0x0008 (size: 0x18)
    FEnhancedActionKeyMapping KeyMapping;                                             // 0x0020 (size: 0x50)

}; // Size: 0x70

struct FWrestlerStateGameplayTagContainer
{
    TMap<class FName, class FGameplayTagContainer> ActiveStateTags;                   // 0x0000 (size: 0x50)

}; // Size: 0x50

struct FWrestlerStateTreeHasTagCondition : public FStateTreeConditionCommonBase
{
    bool bInvert;                                                                     // 0x0020 (size: 0x1)
    FWrestlerEntityTagFilter FilterTags;                                              // 0x0028 (size: 0x30)

}; // Size: 0x58

struct FWrestlerStateTreeHasTagInstanceData
{
}; // Size: 0x1

struct FWrestlerStateTreeIntPropertyCompareInstanceData
{
    int32 Right;                                                                      // 0x0000 (size: 0x4)

}; // Size: 0x4

struct FWrestlerStateTreeIntPropertyCondition : public FStateTreeConditionCommonBase
{
    bool bInvert;                                                                     // 0x0020 (size: 0x1)
    EGenericAICheck Operator;                                                         // 0x0021 (size: 0x1)
    class UHeraPropertyInt* Left;                                                     // 0x0028 (size: 0x8)

}; // Size: 0x30

struct FWrestlerStatsFragment : public FMassFragment
{
}; // Size: 0x4

struct FWrestlerTagDelegates
{
    FWrestlerTagDelegatesOnTagAddedToObjectEvent OnTagAddedToObjectEvent;             // 0x0000 (size: 0x10)
    void WrestlerOnTagChangedOnObjectBP(FString Tag, class UObject* Object);
    FWrestlerTagDelegatesOnTagRemovedFromObjectEvent OnTagRemovedFromObjectEvent;     // 0x0010 (size: 0x10)
    void WrestlerOnTagChangedOnObjectBP(FString Tag, class UObject* Object);

}; // Size: 0x20

struct FWrestlerTagsFragment : public FMassFragment
{
}; // Size: 0x60

struct FWrestlerTaskBoardConfig
{
    TArray<FGameplayTag> TaskTypes;                                                   // 0x0000 (size: 0x10)
    float NextTaskMinDelay;                                                           // 0x0010 (size: 0x4)
    float NextTaskMaxDelay;                                                           // 0x0014 (size: 0x4)

}; // Size: 0x18

struct FWrestlerTaskBoardPerDifficulty
{
    TMap<class EWrestlerPlayerDifficulty, class UWrestlerTaskBoardData*> TaskBoards;  // 0x0000 (size: 0x50)

}; // Size: 0x50

struct FWrestlerTaskCollection
{
    TArray<class UWrestlerTaskData*> TaskCollection;                                  // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FWrestlerTaskExecutionResult
{
    EWrestlerTaskStatus Result;                                                       // 0x0000 (size: 0x1)
    class UWrestlerTask* ReturnTask;                                                  // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FWrestlerTaskFilterParams
{
    class UWrestlerTask* Task;                                                        // 0x0000 (size: 0x8)
    FGameplayTagContainer StateTags;                                                  // 0x0008 (size: 0x20)
    TArray<class AActor*> IgnoreAgents;                                               // 0x0028 (size: 0x10)
    FGameplayTagContainer IgnoreWithTags;                                             // 0x0038 (size: 0x20)

}; // Size: 0x58

struct FWrestlerTeamAttitudeTowardsCondition : public FStateTreeConditionCommonBase
{
    bool bInvert;                                                                     // 0x0020 (size: 0x1)
    TEnumAsByte<ETeamAttitude::Type> TeamAttitude;                                    // 0x0021 (size: 0x1)

}; // Size: 0x28

struct FWrestlerTeamAttitudeTowardsConditionInstanceData
{
}; // Size: 0x1

struct FWrestlerTeamHostility
{
    TMap<class EWrestlerGameTeam, class bool> TeamHostility;                          // 0x0000 (size: 0x50)

}; // Size: 0x50

struct FWrestlerTelekinesisTargetDataFilter : public FGameplayTargetDataFilter
{
}; // Size: 0x20

struct FWrestlerThrowTargetData : public FGameplayAbilityTargetData
{
    FVector ThrowVelocity;                                                            // 0x0008 (size: 0x18)

}; // Size: 0x20

struct FWrestlerTimeDilationConfig
{
    float TimeDilation;                                                               // 0x0000 (size: 0x4)
    float Duration;                                                                   // 0x0004 (size: 0x4)
    ETimeScale TimeScale;                                                             // 0x0008 (size: 0x1)
    class AActor* TimeScaleActor;                                                     // 0x0010 (size: 0x8)
    TArray<class AActor*> ActorsToIgnore;                                             // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FWrestlerTimeDilationData
{
    float TimeDilation;                                                               // 0x0000 (size: 0x4)
    class AActor* TimeScaleActor;                                                     // 0x0010 (size: 0x8)
    TArray<class AActor*> ActorsToIgnore;                                             // 0x0020 (size: 0x10)

}; // Size: 0x30

struct FWrestlerTimeDilator
{
}; // Size: 0x4

struct FWrestlerTokenContainer
{
    TArray<class UWrestlerToken*> FreeTokens;                                         // 0x0000 (size: 0x10)
    TArray<class UWrestlerToken*> ActiveTokens;                                       // 0x0010 (size: 0x10)
    TArray<class UWrestlerToken*> QueuedTokens;                                       // 0x0020 (size: 0x10)
    TArray<class UWrestlerToken*> CooldownTokens;                                     // 0x0030 (size: 0x10)
    TArray<class AActor*> Queue;                                                      // 0x0040 (size: 0x10)

}; // Size: 0x60

struct FWrestlerTokenRequestQuery
{
    EWrestlerGameplayTokenType RequestedTokenType;                                    // 0x0000 (size: 0x1)
    class AActor* RequestingActor;                                                    // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FWrestlerTokenRequestResult
{
    EWrestlerTokenResult Result;                                                      // 0x0000 (size: 0x1)
    class UWrestlerToken* ReturnToken;                                                // 0x0008 (size: 0x8)

}; // Size: 0x18

struct FWrestlerTokenTypeConfig
{
    uint8 InitialNumberOfTokens;                                                      // 0x0000 (size: 0x1)
    uint8 MaxNumberOfActiveTokens;                                                    // 0x0001 (size: 0x1)
    TSubclassOf<class UWrestlerTokenStealingController> StealingControllerClass;      // 0x0008 (size: 0x8)
    float CooldownDuration;                                                           // 0x0010 (size: 0x4)

}; // Size: 0x18

struct FWrestlerTrackedEnemyProperties
{
    float ThreatLevel;                                                                // 0x0000 (size: 0x4)
    float DistanceSqr;                                                                // 0x0004 (size: 0x4)
    EWrestlerAudioEnemyState EnemyState;                                              // 0x0008 (size: 0x1)

}; // Size: 0xC

struct FWrestlerTransitionTransform
{
    FVector Location;                                                                 // 0x0000 (size: 0x18)
    FQuat Rotation;                                                                   // 0x0020 (size: 0x20)
    FQuat ControllerRotation;                                                         // 0x0040 (size: 0x20)

}; // Size: 0x60

struct FWrestlerTraversalCommonVars
{
    float TraversalMaxFacingAngleDegrees;                                             // 0x0000 (size: 0x4)
    float CollisionCapsuleRadius;                                                     // 0x0004 (size: 0x4)
    float CollisionCapsuleHalfHeight;                                                 // 0x0008 (size: 0x4)
    TEnumAsByte<ECollisionChannel> Channel;                                           // 0x000C (size: 0x1)
    float LandingZoneFloorAngleErrorDegrees;                                          // 0x0010 (size: 0x4)
    float SmallPlatformThickness;                                                     // 0x0014 (size: 0x4)

}; // Size: 0x18

struct FWrestlerTraversalLedgeVaultVars
{
    float ObstacleLengthMin;                                                          // 0x0000 (size: 0x4)
    float ObstacleLengthMax;                                                          // 0x0004 (size: 0x4)
    float LedgeVaultDetectionDistance;                                                // 0x0008 (size: 0x4)
    float LedgeMaxThickness;                                                          // 0x000C (size: 0x4)
    float WallHugSpeed;                                                               // 0x0010 (size: 0x4)
    float WallHugMaxDistance;                                                         // 0x0014 (size: 0x4)

}; // Size: 0x18

struct FWrestlerTraversalMantleOffsets
{
    float MantleHeight;                                                               // 0x0000 (size: 0x4)
    float MantleDistance;                                                             // 0x0004 (size: 0x4)

}; // Size: 0x8

struct FWrestlerTraversalMantleVars
{
    float CheckInterval;                                                              // 0x0000 (size: 0x4)
    float MaxMantleHeight;                                                            // 0x0004 (size: 0x4)
    float MaxMantleDistance;                                                          // 0x0008 (size: 0x4)
    float PlatformTraceSeparation;                                                    // 0x000C (size: 0x4)
    float WallNormalAngleThreshold;                                                   // 0x0010 (size: 0x4)
    float LandingDistanceInFromLip;                                                   // 0x0014 (size: 0x4)
    float IgnoreMantleViewAngle;                                                      // 0x0018 (size: 0x4)

}; // Size: 0x1C

struct FWrestlerTraversalObjectSearchVars
{
    float CheckInterval;                                                              // 0x0000 (size: 0x4)
    float Radius;                                                                     // 0x0004 (size: 0x4)
    TEnumAsByte<ECollisionChannel> QueryChannel;                                      // 0x0008 (size: 0x1)

}; // Size: 0xC

struct FWrestlerTraversalVaultVars
{
    float CheckInterval;                                                              // 0x0000 (size: 0x4)
    float ObstacleMinHeight;                                                          // 0x0004 (size: 0x4)
    float ObstacleMaxHeight;                                                          // 0x0008 (size: 0x4)
    float ObstacleMinDepth;                                                           // 0x000C (size: 0x4)
    float MaxHeadHeight;                                                              // 0x0010 (size: 0x4)
    float ObstacleWallErrorDegrees;                                                   // 0x0014 (size: 0x4)
    float LandingZoneSmallLift;                                                       // 0x0018 (size: 0x4)
    float SpeedMultiplier;                                                            // 0x001C (size: 0x4)
    float Duration;                                                                   // 0x0020 (size: 0x4)
    float ClimbDuration;                                                              // 0x0024 (size: 0x4)

}; // Size: 0x28

struct FWrestlerTraversalWallClimbVars
{
    float CheckInterval;                                                              // 0x0000 (size: 0x4)
    float ForwardTraceHeight;                                                         // 0x0004 (size: 0x4)
    float ForwardTraceLength;                                                         // 0x0008 (size: 0x4)
    float ForwardTraceVerticalSlopeErrorDegrees;                                      // 0x000C (size: 0x4)
    float MinHeight;                                                                  // 0x0010 (size: 0x4)
    float UpSweepOffset;                                                              // 0x0014 (size: 0x4)
    float VerticalSpeed;                                                              // 0x0018 (size: 0x4)
    float ForwardTraceSpacing;                                                        // 0x001C (size: 0x4)
    float Offset;                                                                     // 0x0020 (size: 0x4)
    float Duration;                                                                   // 0x0024 (size: 0x4)

}; // Size: 0x28

struct FWrestlerTriggerMasqueradeEvent : public FMassStateTreeTaskBase
{
    FGameplayTag EventTag;                                                            // 0x0024 (size: 0x8)

}; // Size: 0x30

struct FWrestlerTriggerMasqueradeEventInstanceData
{
}; // Size: 0x1

struct FWrestlerTriggerZoneDanger : public FMassStateTreeTaskBase
{
    float DangerRadius;                                                               // 0x0028 (size: 0x4)
    float DangerDuration;                                                             // 0x002C (size: 0x4)

}; // Size: 0x30

struct FWrestlerTriggerZoneDangerInstanceData
{
}; // Size: 0x1

struct FWrestlerTutorialData
{
    FText Title;                                                                      // 0x0000 (size: 0x18)
    FText KeyboardMouseDescription;                                                   // 0x0018 (size: 0x18)
    FText ControllerDescription;                                                      // 0x0030 (size: 0x18)
    bool bWaitForPlayerAction;                                                        // 0x0048 (size: 0x1)
    FGameplayTag AbilityTag;                                                          // 0x004C (size: 0x8)
    FGameplayTag SecondaryAbilityTag;                                                 // 0x0054 (size: 0x8)
    FName PCIcon;                                                                     // 0x005C (size: 0x8)
    FName XBoxIcon;                                                                   // 0x0064 (size: 0x8)
    FName PSIcon;                                                                     // 0x006C (size: 0x8)
    FName SecondoryPCIcon;                                                            // 0x0074 (size: 0x8)
    FName SecondaryXBoxIcon;                                                          // 0x007C (size: 0x8)
    FName SecondaryPSIcon;                                                            // 0x0084 (size: 0x8)
    FName PrimarySymbolIcon;                                                          // 0x008C (size: 0x8)
    FName SecondarySymbolIcon;                                                        // 0x0094 (size: 0x8)

}; // Size: 0xA0

struct FWrestlerUIAchievementInfo
{
    TArray<FTransform> Positions;                                                     // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FWrestlerUILocalisationDataTableRowBase : public FTableRowBase
{
    FString LocalisationNotes;                                                        // 0x0008 (size: 0x10)
    FString CharactersLimit;                                                          // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FWrestlerUIMarkerInfo
{
    FString Objective;                                                                // 0x0000 (size: 0x10)
    FText MarkerTitle;                                                                // 0x0010 (size: 0x18)
    FText MarkerDescription;                                                          // 0x0028 (size: 0x18)
    EWrestlerUIMarkerInfoType MarkerType;                                             // 0x0040 (size: 0x1)
    FGameplayTag MarkerTag;                                                           // 0x0044 (size: 0x8)
    TWeakObjectPtr<class UObject> ObjectToTag;                                        // 0x004C (size: 0x8)
    class UHeraDialogueInfo* StoryDialogueInfo;                                       // 0x0058 (size: 0x8)
    TArray<class UHeraPropertyBool*> MarkerCompletedProperties;                       // 0x0060 (size: 0x10)
    FString WaypointActorName;                                                        // 0x0070 (size: 0x10)
    FWrestlerQuestObjective QuestObjective;                                           // 0x0080 (size: 0xD0)
    bool bUseSideQuestIcon;                                                           // 0x0150 (size: 0x1)

}; // Size: 0x158

struct FWrestlerUISaveData
{
    TMap<class FGameplayTag, class FTransform> TrainersPositions;                     // 0x0000 (size: 0x50)
    TMap<class FGameplayTag, class FWrestlerUIAchievementInfo> FoundAchievementCollectibles; // 0x0050 (size: 0x50)

}; // Size: 0xA0

struct FWrestlerUltraVolumetricsFogParameters
{
    EWrestlerUltraVolumetricsFogLayer2 SecondLayer;                                   // 0x0000 (size: 0x1)
    float SecondLayerAmount;                                                          // 0x0004 (size: 0x4)
    bool bUseDistanceField;                                                           // 0x0008 (size: 0x1)
    float DistanceFieldHeight;                                                        // 0x000C (size: 0x4)
    float DistanceFieldMultiply;                                                      // 0x0010 (size: 0x4)
    float DistanceFieldPower;                                                         // 0x0014 (size: 0x4)
    float Opacity;                                                                    // 0x0018 (size: 0x4)
    float SelfShadowAmount;                                                           // 0x001C (size: 0x4)
    FVector NoiseSize;                                                                // 0x0020 (size: 0x18)
    float NoisePower;                                                                 // 0x0038 (size: 0x4)
    float NoiseMultiply;                                                              // 0x003C (size: 0x4)
    FLinearColor Color;                                                               // 0x0040 (size: 0x10)
    float PanningSpeedX;                                                              // 0x0050 (size: 0x4)
    float PanningSpeedY;                                                              // 0x0054 (size: 0x4)
    float PanningSpeedZ;                                                              // 0x0058 (size: 0x4)
    float FarFadeDistance;                                                            // 0x005C (size: 0x4)
    float NearFadeDistance;                                                           // 0x0060 (size: 0x4)
    bool bUseThirdPersonNearFade;                                                     // 0x0064 (size: 0x1)

}; // Size: 0x68

struct FWrestlerUltraVolumetricsFogQualityParameters
{
    int32 GridPixelSize;                                                              // 0x0000 (size: 0x4)
    int32 GridSizeZ;                                                                  // 0x0004 (size: 0x4)

}; // Size: 0x8

struct FWrestlerUseAbility : public FMassStateTreeTaskBase
{
    FGameplayTag GameplayAbilityTag;                                                  // 0x0024 (size: 0x8)

}; // Size: 0x30

struct FWrestlerUseAbilityInstanceData
{
}; // Size: 0x8

struct FWrestlerViolentActionWitnessData
{
    FWrestlerIndicatedEntity IndicatorData;                                           // 0x0000 (size: 0x10)

}; // Size: 0x18

struct FWrestlerVisionGameplayTargetDataFilter : public FGameplayTargetDataFilter
{
    TSubclassOf<class UInterface> Interface;                                          // 0x0020 (size: 0x8)

}; // Size: 0x28

struct FWrestlerVisionPane
{
}; // Size: 0x60

struct FWrestlerVisionRectangle
{
    float Width;                                                                      // 0x0000 (size: 0x4)
    float Height;                                                                     // 0x0004 (size: 0x4)
    float FwdOffset;                                                                  // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FWrestlerWallClimbParameters
{
    float LerpToWallDuration;                                                         // 0x0000 (size: 0x4)
    float MaxWallClimbDuration;                                                       // 0x0004 (size: 0x4)
    float InwardProjection;                                                           // 0x0008 (size: 0x4)
    float ForwardDirectionLerpStrength;                                               // 0x000C (size: 0x4)
    float LedgeVaultDetectionDistance;                                                // 0x0010 (size: 0x4)
    float LedgeMinProtrusion;                                                         // 0x0014 (size: 0x4)
    float LedgeMaxProtrusion;                                                         // 0x0018 (size: 0x4)
    float LedgeMaxThickness;                                                          // 0x001C (size: 0x4)
    float StepUpHeight;                                                               // 0x0020 (size: 0x4)
    float SlopeBoostMultiplier;                                                       // 0x0024 (size: 0x4)
    bool bFallOnBlock;                                                                // 0x0028 (size: 0x1)

}; // Size: 0x2C

struct FWrestlerWaypointData
{
    class AWrestlerWaypointActor* WaypointActor;                                      // 0x0000 (size: 0x8)

}; // Size: 0x20

struct FWrestlerWaypointIndicatorData
{
    class AActor* WaypointTarget;                                                     // 0x0000 (size: 0x8)
    FString WaypointTargetName;                                                       // 0x0008 (size: 0x10)
    FString Tag;                                                                      // 0x0018 (size: 0x10)
    class UWrestlerWaypointIndicator* IndicatorWidget;                                // 0x0028 (size: 0x8)

}; // Size: 0x30

struct FWrestlerWeatherParameters
{
    FName Name;                                                                       // 0x0000 (size: 0x8)
    float BlendTime;                                                                  // 0x0008 (size: 0x4)
    float WindIntensity;                                                              // 0x000C (size: 0x4)
    FVector WindDirection;                                                            // 0x0010 (size: 0x18)
    float WindGustProbability;                                                        // 0x0028 (size: 0x4)
    float WindGustDuration;                                                           // 0x002C (size: 0x4)
    FWrestlerWindGustIntensity WindGustIntensity;                                     // 0x0030 (size: 0x8)

}; // Size: 0x38

struct FWrestlerWindGustIntensity
{
    float Min;                                                                        // 0x0000 (size: 0x4)
    float Max;                                                                        // 0x0004 (size: 0x4)

}; // Size: 0x8

struct FWrestlerXPConversionData
{
    FRuntimeFloatCurve XPToAPConversionCurve;                                         // 0x0000 (size: 0x88)

}; // Size: 0x88

struct FWrestlerZGFindConversationExitWanderTarget : public FMassStateTreeTaskBase
{
    float ZoneGraphSearchRange;                                                       // 0x0020 (size: 0x4)

}; // Size: 0x38

struct FWrestlerZGFindConversationExitWanderTargetInstanceData
{
    bool bUseWanderTaget;                                                             // 0x0000 (size: 0x1)
    FMassZoneGraphTargetLocation WanderTargetLocation;                                // 0x0008 (size: 0x60)
    FVector NavMeshTargetLocation;                                                    // 0x0068 (size: 0x18)

}; // Size: 0x80

struct FWrestlerZGFindWanderTarget : public FMassStateTreeTaskBase
{
}; // Size: 0x38

struct FWrestlerZGFindWanderTargetInstanceData
{
    FMassZoneGraphTargetLocation WanderTargetLocation;                                // 0x0000 (size: 0x60)
    bool bDoAdjacentLaneSwap;                                                         // 0x0060 (size: 0x1)
    float AdjacentLanesSwapAheadDistance;                                             // 0x0064 (size: 0x4)

}; // Size: 0x68

struct FWrestlerZGPathFollowTask : public FMassStateTreeTaskBase
{
}; // Size: 0x38

struct FWrestlerZGSpawnPointsGeneratorData
{
    FZoneGraphTagFilter TagFilter;                                                    // 0x0000 (size: 0xC)
    float MinGap;                                                                     // 0x000C (size: 0x4)
    float MaxGap;                                                                     // 0x0010 (size: 0x4)
    int32 RandomSeed;                                                                 // 0x0014 (size: 0x4)
    bool RandomizeLocations;                                                          // 0x0018 (size: 0x1)
    bool bFillZones;                                                                  // 0x0019 (size: 0x1)
    float WidthRandomUsage;                                                           // 0x001C (size: 0x4)
    bool bCapWidthUsage;                                                              // 0x0020 (size: 0x1)
    float EntityWidth;                                                                // 0x0024 (size: 0x4)
    bool bConvertedFromOldData;                                                       // 0x0028 (size: 0x1)

}; // Size: 0x2C

struct FWrestlerZoneGraphAnnotationArea : public FZoneGraphAnnotationEventBase
{
    class ATriggerBox* AnnotationVolume;                                              // 0x0000 (size: 0x8)

}; // Size: 0x10

class AAbilityDeadZoneVolume : public AWrestlerVolumeBase
{
    TSubclassOf<class UWrestlerAbilityDeadZoneSetup> AbilityDeadZoneSetupClass;       // 0x02D0 (size: 0x8)

}; // Size: 0x2D8

class ADEPRECATED_WrestlerGlobalLightVisibilityGroup : public AActor
{
    bool bEnabled;                                                                    // 0x0298 (size: 0x1)
    FGameplayTag GlobalVisibilityTag;                                                 // 0x029C (size: 0x8)
    float FadeTime;                                                                   // 0x02A4 (size: 0x4)
    TArray<class ULightComponent*> AttachedLights;                                    // 0x02A8 (size: 0x10)
    float PreviousIntensity;                                                          // 0x02B8 (size: 0x4)

    void SetRenderIntensity(float InNewIntensity);
    void SetEnabled(bool bEnabled);
    float GetRenderIntensity();
    FGameplayTag GetGlobalVisibilityTag();
    bool GetEnabled();
}; // Size: 0x2C0

class ADEPRECATED_WrestlerLightVisibilityGroup : public AActor
{
    TArray<class ULightComponent*> AttachedLights;                                    // 0x0298 (size: 0x10)

}; // Size: 0x2B0

class ADEPRECATED_WrestlerLightVisibilityVolume : public AWrestlerVolumeBase
{
    bool bManageAttachedActors;                                                       // 0x02D0 (size: 0x1)
    EWrestlerLightVisibilityVolumeToggleMode VisibilityMode;                          // 0x02D1 (size: 0x1)
    float FadeTime;                                                                   // 0x02D4 (size: 0x4)
    TArray<TSoftObjectPtr<AActor>> ManagedActors;                                     // 0x02D8 (size: 0x10)
    TArray<FGameplayTag> GlobalGroupsOff;                                             // 0x02F0 (size: 0x10)
    class UDEPRECATED_WrestlerLightVisibilityVolumeManager* LightVisibilityVolumeManager; // 0x0300 (size: 0x8)

    void SetVisibilityMode(const EWrestlerLightVisibilityVolumeToggleMode& InNewMode);
    bool IsPlayerWithin(bool bInAssumeIfNoPlayer);
}; // Size: 0x308

class ADroneController : public AWrestlerEnemyController
{

    void DroneSight(FVector& out_Location, FRotator& out_Rotation);
}; // Size: 0x5B0

class AInteractableQuestActor : public AWrestlerActorInteractionBase
{
    class UHeraMissionActorComponent* MissionComponent;                               // 0x02C8 (size: 0x8)
    class UHeraPersistenceComponentInt32* PersistentState;                            // 0x02D0 (size: 0x8)
    EItemState ItemState;                                                             // 0x02D8 (size: 0x1)
    EItemType InteractType;                                                           // 0x02D9 (size: 0x1)
    class UHeraMissionObjective* ObjectiveToUpdate;                                   // 0x02E0 (size: 0x8)
    class UHeraMissionObjective* OnInteractEndObjective;                              // 0x02E8 (size: 0x8)
    bool bShouldSetUsed;                                                              // 0x02F0 (size: 0x1)

    void OnInteractionPerformed(class AActor* InInteractingActor);
    void OnInteractionEnded(class AActor* InInteractingActor);
    void OnAnyInteractionEnded(class AActor* InInteractingActor);
    void OnAnyInteraction(class AActor* InInteractingActor);
}; // Size: 0x2F8

class AWrestlerAICharacter : public AWrestlerCharacterBase
{
    FGameplayTagContainer InterestingPointTags;                                       // 0x0AB0 (size: 0x20)
    bool bFadeOutStunGlow;                                                            // 0x0AD0 (size: 0x1)
    float StunGlowFadeSpeed;                                                          // 0x0AD4 (size: 0x4)
    FWrestlerAICharacterWrestlerCharacterDeathCleanUpDelegate WrestlerCharacterDeathCleanUpDelegate; // 0x0AD8 (size: 0x10)
    void WrestlerCharacterDeathCleanUpDelegate(class AActor* DeadActor);
    FWrestlerAICharacterOnDeadBodySpawned OnDeadBodySpawned;                          // 0x0AE8 (size: 0x10)
    void DeadBodySpawnedDelegate(class AActor* DeadBodyActor);
    bool bEnableUVGlow;                                                               // 0x0AF8 (size: 0x1)
    class UWrestlerModularCharacterProfile* ModularCharacterProfile;                  // 0x0B00 (size: 0x8)
    FVector2D MinMaxMeshHeightScale;                                                  // 0x0B08 (size: 0x10)
    class USkeletalMeshComponent* IKRetargetMesh;                                     // 0x0B18 (size: 0x8)
    class UWrestlerBloodResonanceComponent* BloodResonanceComponent;                  // 0x0B20 (size: 0x8)

    bool TraceToActor(class AActor* ActorToTrace, FHitResult& OutHit, const FName& TraceName);
    void SetUseStunGlow(const float InUseStunGlow);
    void SetMeshHeightScale(const float InHeightScale, const float InLerpDuration);
    void SetFadeOutStunGlow();
    void SetEnableUVGlow(bool bInNewUVGlow);
    void SetDefaultMeshHeightScale(const float InLerpDuration);
    void OnAIDeath();
    bool IsActorInView(class AActor* ActorToCheck);
    class UWrestlerModularCharacterProfile* GetModularCharacterProfile();
    class USkeletalMeshComponent* GetIKRetargetMesh();
    bool CanBeSeen(const class AActor* InActor);
}; // Size: 0xB50

class AWrestlerAIController : public AAIController
{
    FWrestlerAIControllerOnTeamChangedEvent OnTeamChangedEvent;                       // 0x03C8 (size: 0x10)
    void WrestlerTeamChangedEvent(class AAIController* AIController, EWrestlerGameTeam NewTeamID);
    class UBlackboardData* DefaultBlackboard;                                         // 0x03D8 (size: 0x8)
    class UBlackboardComponent* BlackboardComponent;                                  // 0x03E0 (size: 0x8)
    EWrestlerGameTeam GameTeamID;                                                     // 0x03E8 (size: 0x1)
    float InterestingPointSelectionAngle;                                             // 0x03EC (size: 0x4)
    class AActor* SelectedInterestingPoint;                                           // 0x03F0 (size: 0x8)
    class UWrestlerEnemyTeamAttitudeConfig* TeamAttitudeConfig;                       // 0x03F8 (size: 0x8)

    void WrestlerSetGenericTeamId(const FGenericTeamId& InTeamID);
    TEnumAsByte<ETeamAttitude::Type> WrestlerGetTeamAttitudeTowards(const class AActor* InOther);
    FGenericTeamId WrestlerGetGenericTeamId();
    void SetLookForExitPoint(bool bLookExitPoint);
    bool IsActorPerceived(class AActor* ActorToCheck);
    void InitialiseAIBehaviourTree();
    TEnumAsByte<ETeamAttitude::Type> GetTeamAttitudeTowardsTeam(const EWrestlerGameTeam InTeam);
    bool GetLookForExitPoint();
    void GetCurrentlyPerceivedActorsOfSense(TSubclassOf<class UAISense> SenseToUse, TArray<class AActor*>& OutActors);
}; // Size: 0x408

class AWrestlerAISpawner : public ATargetPoint
{
    FWrestlerAISpawnerOnEnemyHasSpawned OnEnemyHasSpawned;                            // 0x0298 (size: 0x10)
    void WrestlerEnemyHasSpawnedSignature(class AWrestlerEnemyCharacter* Enemy);
    FName EnemyTypeName;                                                              // 0x02B0 (size: 0x8)
    FWrestlerAISpawnerData SpawnData;                                                 // 0x02B8 (size: 0xC8)
    TSoftObjectPtr<UWrestlerModularCharacterProfile> ModularCharacterProfile;         // 0x0380 (size: 0x28)
    bool bSpawnOnBeginPlay;                                                           // 0x03A8 (size: 0x1)
    FWrestlerAISpawnerOnEnemySpawned OnEnemySpawned;                                  // 0x03B0 (size: 0x10)
    void WrestlerEnemySpawned(FWrestlerAISpawnerData OutSpawnData, const class AWrestlerAISpawner* OutSpawner);
    bool bOffsetSpawnedActor;                                                         // 0x03C0 (size: 0x1)
    class UWorldPartitionStreamingSourceComponent* WorldPartitionStreamingSourceComponent; // 0x03C8 (size: 0x8)
    class UWrestlerNavInvokerComponent* NavigationInvoker;                            // 0x03D0 (size: 0x8)
    FGameplayTagContainer TagContainerToApply;                                        // 0x03E0 (size: 0x20)
    FGameplayTag SquadIdTag;                                                          // 0x0400 (size: 0x8)
    bool bIsLeader;                                                                   // 0x0408 (size: 0x1)

    void SpawnEnemyTypeByName(FName InTypeName);
    void SpawnEnemy();
    bool ShouldSpawnOnBeginPlay();
    void RerollRandomMesh();
    void OnTimer();
    TSoftObjectPtr<UWrestlerModularCharacterProfile> GetModularCharacterProfile();
}; // Size: 0x420

class AWrestlerAbilitySystemActor : public AActor
{
    class UWrestlerAbilitySystemComponent* AbilitySystemComponent;                    // 0x02A0 (size: 0x8)

}; // Size: 0x2A8

class AWrestlerAbilitySystemCharacter : public ACharacter
{
    class UWrestlerAbilitySystemComponent* AbilitySystemComponent;                    // 0x0680 (size: 0x8)

}; // Size: 0x690

class AWrestlerActorInteractionBase : public AActor
{
    class USceneComponent* Root;                                                      // 0x02A0 (size: 0x8)
    FWrestlerInteractableData InteractableData;                                       // 0x02A8 (size: 0x18)

}; // Size: 0x2C0

class AWrestlerActor_Trace : public AGameplayAbilityTargetActor_Trace
{
}; // Size: 0x400

class AWrestlerArachnesKissTrigger : public AActor
{
    class USphereComponent* TriggerSphere;                                            // 0x0298 (size: 0x8)
    float ExplosionDamageRadius;                                                      // 0x02A0 (size: 0x4)
    bool bDebugExplosion;                                                             // 0x02A4 (size: 0x1)
    class UWrestlerGameplayAbility_ArachnesKiss* GameplayAbility;                     // 0x02A8 (size: 0x8)
    FEffectsMap ExplosionHitEffectsMap;                                               // 0x02B0 (size: 0x50)

    void Explode_Internal();
    void Explode(float InExplosionDelay);
    void BP_OnExplode();
}; // Size: 0x308

class AWrestlerAudioDiegeticMusicController : public AActor
{
    TArray<class UHeraAudioPositionalRtpcComponent*> EmitterArray;                    // 0x0298 (size: 0x10)
    TMap<class FGameplayTag, class AWrestlerAudioDiegeticMusicSpline*> SplineTagMap;  // 0x02A8 (size: 0x50)
    class AWrestlerAudioDiegeticMusicSpline* ActiveSpline;                            // 0x02F8 (size: 0x8)
    class UHeraPropertyGameplayTag* ActiveSplineProperty;                             // 0x0300 (size: 0x8)
    TArray<float> PerimeterDistanceModifiers;                                         // 0x0308 (size: 0x10)
    bool bDebug;                                                                      // 0x0318 (size: 0x1)

    void HandleSplineExit(FGameplayTag SplineTag, bool bExitFromStart, bool bHoldAtExit, bool& bExited);
    void ActivateSpline(FGameplayTag SplineTag, bool bActivate);
}; // Size: 0x320

class AWrestlerAudioDiegeticMusicSpline : public AActor
{
}; // Size: 0x298

class AWrestlerAudioFoliageVolume : public AActor
{
    class UHeraAudioVolumeComponent* VolumeComponent;                                 // 0x0298 (size: 0x8)
    class UBoxComponent* DefaultVolume;                                               // 0x02A0 (size: 0x8)
    class UAkAudioEvent* FoliageLoopEvent;                                            // 0x02A8 (size: 0x8)
    class UAkAudioEvent* FoliageStopEvent;                                            // 0x02B0 (size: 0x8)

    void OnPlayerInsideVolumeChanged(bool bPlayerInsideVolume);
}; // Size: 0x2D0

class AWrestlerBasePathPoint : public AActor
{
    FGameplayTag GameplayAbilityTag;                                                  // 0x0298 (size: 0x8)
    FGameplayTag QuestAbilityTag;                                                     // 0x02A0 (size: 0x8)
    bool bOverrideWaitTime;                                                           // 0x02A8 (size: 0x1)
    float WaitTime;                                                                   // 0x02AC (size: 0x4)
    class USceneComponent* SceneComponent;                                            // 0x02B0 (size: 0x8)
    FColor PathPointArrowColor;                                                       // 0x02B8 (size: 0x4)
    float DebugSphereRadius;                                                          // 0x02BC (size: 0x4)

}; // Size: 0x2C8

class AWrestlerBaseRoute : public AActor
{
    bool bActive;                                                                     // 0x0298 (size: 0x1)
    bool bSingleRun;                                                                  // 0x0299 (size: 0x1)
    bool bLoop;                                                                       // 0x029A (size: 0x1)
    TArray<class AWrestlerBasePathPoint*> PathPoints;                                 // 0x02A0 (size: 0x10)
    FColor PathLineColor;                                                             // 0x02B0 (size: 0x4)

    void SetPathPoints(TArray<class AWrestlerBasePathPoint*> InPathPoints);
    TArray<class AWrestlerBasePathPoint*> GetPathPoints();
    class AWrestlerBasePathPoint* GetPathPoint(int32 InIndex);
    int32 GetPathLength();
}; // Size: 0x2C0

class AWrestlerBreakable : public AActor
{
    class UStaticMeshComponent* BreakableMesh;                                        // 0x0298 (size: 0x8)
    TSoftObjectPtr<UStaticMesh> BrokenMesh;                                           // 0x02A0 (size: 0x28)
    TSet<TSoftClassPtr<UDamageType>> BreakOnDamageTypes;                              // 0x02C8 (size: 0x50)
    float BreakNoiseLoudness;                                                         // 0x0318 (size: 0x4)
    float BreakNoiseRange;                                                            // 0x031C (size: 0x4)

    void OnBroken(class AController* InEventInstigator, class AActor* InDamageCauser);
}; // Size: 0x320

class AWrestlerCameraManager : public APlayerCameraManager
{

    void DestroySceneCaptureComponent(class APlayerCameraManager* PlayerCameraManager, class USceneCaptureComponent* SceneCaptureComponent);
}; // Size: 0x2400

class AWrestlerCharacter : public AWrestlerCharacterBase
{
    FWrestlerCharacterOnPlayerCharacterInitializedEvent OnPlayerCharacterInitializedEvent; // 0x0AC8 (size: 0x10)
    void WrestlerCharacterInitializationSucceeded();
    FWrestlerCharacterOnJumpInputReleased OnJumpInputReleased;                        // 0x0AD8 (size: 0x10)
    void WrestlerCharacterJumpInputReleased();
    FWrestlerCharacterOnJumpInputHeld OnJumpInputHeld;                                // 0x0AE8 (size: 0x10)
    void WrestlerCharacterJumpInputHeld();
    FWrestlerCharacterOnTeleportSucceeded OnTeleportSucceeded;                        // 0x0AF8 (size: 0x10)
    void WrestlerCharacterTeleportSucceeded();
    FWrestlerCharacterOnStealthActiveEvent OnStealthActiveEvent;                      // 0x0B08 (size: 0x10)
    void WrestlerCharacterStealthActive(bool bInStealthActive);
    FWrestlerCharacterOnDealMeleeDamageEvent OnDealMeleeDamageEvent;                  // 0x0B18 (size: 0x10)
    void WrestlerCharacterHasTag();
    FWrestlerCharacterOnReceiveHitDamageEvent OnReceiveHitDamageEvent;                // 0x0B28 (size: 0x10)
    void WrestlerCharacterHasTag();
    FWrestlerCharacterOnFeedEndEvent OnFeedEndEvent;                                  // 0x0B38 (size: 0x10)
    void WrestlerCharacterHasTag();
    FGameplayTag TorporTag;                                                           // 0x0B48 (size: 0x8)
    TSoftClassPtr<UWrestlerGameplayAbility> TorporAbility;                            // 0x0B50 (size: 0x28)
    FGameplayTag StealthTag;                                                          // 0x0B78 (size: 0x8)
    FGameplayTag HitReactTag;                                                         // 0x0B80 (size: 0x8)
    FGameplayTag FeedTag;                                                             // 0x0B88 (size: 0x8)
    FGameplayTag NarrativeModeTag;                                                    // 0x0B90 (size: 0x8)
    class UWrestlerControlCue* CrouchControlCue;                                      // 0x0B98 (size: 0x8)
    TSoftObjectPtr<UWrestlerMoveToDataAsset> CombatFeedMoveToDataSoftPtr;             // 0x0BA0 (size: 0x28)
    class UWrestlerMoveToDataAsset* CombatFeedMoveToData;                             // 0x0BC8 (size: 0x8)
    class UHeraPropertyStateTrackingList* EquippedAbilities;                          // 0x0BE8 (size: 0x8)
    FGameplayTagContainer AutoTraversalTags;                                          // 0x0BF0 (size: 0x20)
    bool bGlideAvailable;                                                             // 0x0C10 (size: 0x1)
    bool bGlidePressed;                                                               // 0x0C11 (size: 0x1)
    FWrestlerPlayerMovementParams MovementParams;                                     // 0x0C14 (size: 0x1C)
    class UWrestlerControlComponent* ControlComponent;                                // 0x0C30 (size: 0x8)
    class UWrestlerTraversalComponent* TraversalComponent;                            // 0x0C38 (size: 0x8)
    class UWrestlerEquippedAbilityComponent* EquippedAbilityComponent;                // 0x0C40 (size: 0x8)
    class UWrestlerPassiveTargetingComponent* PassiveTargetingComponent;              // 0x0C48 (size: 0x8)
    class UWrestlerXPComponent* XPComponent;                                          // 0x0C50 (size: 0x8)
    bool bModifyCollisionDuringTraversal;                                             // 0x0C58 (size: 0x1)
    FVector StableGround;                                                             // 0x0C70 (size: 0x18)
    int32 skillPoints;                                                                // 0x0C88 (size: 0x4)
    int32 TotalAbilityPoints;                                                         // 0x0C8C (size: 0x4)
    TSubclassOf<class UWrestlerGameplayAbility> CurrentPassiveAbility;                // 0x0C90 (size: 0x8)
    class UHeraDialogueInfo* DialogueInfo;                                            // 0x0C98 (size: 0x8)

    void WrestlerCharacterStealthActive__DelegateSignature(bool bInStealthActive);
    void WrestlerCharacterHasTag__DelegateSignature();
    void TryStartGliding();
    bool ToggleThirdPersonCamera();
    bool ToggleSecondaryViewpoint();
    void StopGliding();
    void SpawnDebugCamera();
    void SetStableGround(FVector InNewStableGround);
    void SetJumpCount(int32 InJumpCount);
    void SetGlideAvailable(bool Available);
    void SetGlideAcceleration(FVector Acceleration);
    void SetCanJumpFromCrouched(bool bInCanJump);
    void OnPlayerUnlockedFromDialogue();
    void OnPlayerLockedIntoDialogue();
    void OnPlayerClanChanged(class UWrestlerPlayerClan* InNewClan);
    void OnPlayerCharacterInitialized();
    void OnPlayerAbilityEarned();
    void OnNarrativeModeChanged(bool InNarrativeModeEnabled);
    bool IsGliding();
    float GetWalkSpeed();
    FVector GetVelocityLocal();
    FVector GetStableGround();
    float GetSprintSpeed();
    class UWrestlerPlayerMovementDataAsset* GetMovementConfigData();
    float GetMaxFeedRange();
    bool GetIsHeavyLanding();
    bool GetGlideAvailable();
    class UWrestlerEquippedAbilityComponent* GetEquippedAbilityComponent();
    float GetDistanceToFloor(float InCastDistance);
    void ForceAllowNextJump();
    bool CanGlide();
    void BP_ResetJumpState();
}; // Size: 0xCA0

class AWrestlerCharacterBase : public ACharacter
{
    class UHeraAudioCharacterComponent* AudioCharacterComponent;                      // 0x06E0 (size: 0x8)
    float HealthRegenDelay;                                                           // 0x06F0 (size: 0x4)
    float HealthRegenSegment_MaxHealthPercentage;                                     // 0x06F4 (size: 0x4)
    float HealthRegenSegment;                                                         // 0x06F8 (size: 0x4)
    float HealthSubBar;                                                               // 0x06FC (size: 0x4)
    float CurrentHealthCache;                                                         // 0x0700 (size: 0x4)
    class UWrestlerAttributeSet* AttributeSetBase;                                    // 0x0708 (size: 0x8)
    class UWrestlerCameraShakeAttributeSet* CameraShakeAttributeSet;                  // 0x0710 (size: 0x8)
    class UWrestlerLastBreathHealthAttributeSet* LastBreathHealthAttributeSet;        // 0x0718 (size: 0x8)
    class UAnimDataAsset* AnimDataAsset;                                              // 0x0720 (size: 0x8)
    FName DespawnTag;                                                                 // 0x0728 (size: 0x8)
    FGameplayTag CharacterTag;                                                        // 0x0730 (size: 0x8)
    FGameplayTag SprintTag;                                                           // 0x0738 (size: 0x8)
    FGameplayTag CrouchTag;                                                           // 0x0740 (size: 0x8)
    FGameplayTag SlideTag;                                                            // 0x0748 (size: 0x8)
    FGameplayTag JumpTag;                                                             // 0x0750 (size: 0x8)
    FGameplayTag GlideTag;                                                            // 0x0758 (size: 0x8)
    FGameplayTag OutOfCombatTag;                                                      // 0x0760 (size: 0x8)
    FGameplayTag RegenTag;                                                            // 0x0768 (size: 0x8)
    FGameplayTag StunnedTag;                                                          // 0x0770 (size: 0x8)
    TMap<TEnumAsByte<EMovementMode>, FGameplayTag> MovementTags;                      // 0x0778 (size: 0x50)
    FGameplayTag FeedXPAwardTag;                                                      // 0x07C8 (size: 0x8)
    bool CheckForCombat;                                                              // 0x07D0 (size: 0x1)
    float OutOfCombatTime;                                                            // 0x07D4 (size: 0x4)
    FWrestlerCharacterBaseOnOutOfCombat OnOutOfCombat;                                // 0x07D8 (size: 0x10)
    void WrestlerCharacterBaseBool(bool bBoolCheck);
    FWrestlerCharacterBaseOnCutsceneStarted OnCutsceneStarted;                        // 0x07E8 (size: 0x10)
    void WrestlerCharacterCutsceneStarted();
    FWrestlerCharacterBaseOnCutsceneEnded OnCutsceneEnded;                            // 0x07F8 (size: 0x10)
    void WrestlerCharacterCutsceneEnded();
    bool bRegenHealth;                                                                // 0x0820 (size: 0x1)
    TMap<FName, float> SightTargets;                                                  // 0x0828 (size: 0x50)
    int32 VampiricVisionId;                                                           // 0x0878 (size: 0x4)
    FWrestlerCharacterBaseWrestlerCharacterDeathDelegate WrestlerCharacterDeathDelegate; // 0x0880 (size: 0x10)
    void WrestlerCharacterDeathDelegate(class AActor* DeadActor);
    FWrestlerCharacterBaseWrestlerCharacterMarkedForDespawnDelegate WrestlerCharacterMarkedForDespawnDelegate; // 0x0890 (size: 0x10)
    void WrestlerCharacterMarkedForDespawnDelegate(class AActor* ActorToDespawn);
    FWrestlerCharacterBaseOnCharacterDamaged OnCharacterDamaged;                      // 0x08A0 (size: 0x10)
    void OnDamaged(class APawn* CharacterDamaged);
    FWrestlerCharacterBaseOnCharacterAttacked OnCharacterAttacked;                    // 0x08B0 (size: 0x10)
    void OnAttacked(class APawn* CharacterAttacked, class APawn* CharacterAttacking);
    FWrestlerCharacterBaseOnCharacterVanished OnCharacterVanished;                    // 0x08C0 (size: 0x10)
    void OnVanished(class APawn* CharacterVanished);
    bool bRegisterAsVampiricVisionTarget;                                             // 0x08D0 (size: 0x1)
    TSoftClassPtr<AActor> DeadActor;                                                  // 0x08D8 (size: 0x28)
    FGameplayTag DeathBehaviourTag;                                                   // 0x0900 (size: 0x8)
    class APawn* DeathInstigator;                                                     // 0x0908 (size: 0x8)
    class UWrestlerAbilitySystemComponent* AbilitySystemComponent;                    // 0x0910 (size: 0x8)
    class UWrestlerSequenceBlendComponent* SequenceBlendComponent;                    // 0x0918 (size: 0x8)
    int32 CharacterLevel;                                                             // 0x0920 (size: 0x4)
    class UWrestlerDefaultAbilities* DefaultAbilitiesAsset;                           // 0x0928 (size: 0x8)
    TArray<TSoftClassPtr<UGameplayEffect>> DefaultEffectsOnStart;                     // 0x0930 (size: 0x10)
    class UTextRenderComponent* StatusText;                                           // 0x0950 (size: 0x8)
    bool bIsInDialogue;                                                               // 0x0960 (size: 0x1)
    bool bIsInCutscene;                                                               // 0x0961 (size: 0x1)
    bool bIsSpeaking;                                                                 // 0x0962 (size: 0x1)
    bool bIsTargetable;                                                               // 0x0970 (size: 0x1)

    void Slide();
    void SetWalkSpeed(float NewWalkSpeed);
    void SetSprintSpeed(float NewSprintSpeed);
    void SetPlayerTarget(bool bIsTarget);
    void SetOutOfCombat(bool bNewOutOfCombat);
    void SetIsTargetable(bool InIsTargetable);
    void SetIsSpeaking(const bool bIsSpeaking);
    void SetIsInDialogue(const bool bInDialogue);
    void SetIsInCutscene(const bool bInCutscene);
    void SetDeathInstigator(class APawn* InInstigator);
    void SetDeathBehaviourTag(const FGameplayTag& InDeathBehaviourTag);
    void SetDead();
    void SetCrouchSpeed(float NewCrouchSpeed);
    bool SetCharacterLevel(int32 NewLevel);
    void SetAllowPawnOverlap(float InDuration);
    void ResetRecentlyAttacked();
    void RemoveAbility(TSubclassOf<class UWrestlerGameplayAbility> InAbility);
    void OnSequenceBindingChanged(bool bInIsBound);
    void OnNewMovementMode(TEnumAsByte<EMovementMode> InMovementMode);
    void OnHealthChanged(float CurrentHealth, float MaxHealth);
    void OnGameplayTagsChanged(const FGameplayTagContainer& InAddedGameplayTags, const FGameplayTagContainer& InRemovedGameplayTags);
    void OnDamagedGAS(float Damage);
    void OnBloodChanged(float CurrentBlood, float MaxBlood);
    void OnAbilityFailed(const ECouldNotActivateReason& OutFailureReason, const FGameplayTagContainer& TagFailure, class UGameplayAbility* AbilityFailure);
    FGameplayEventData MeleeHitGameplayEvent(class UPrimitiveComponent* InOverlappedComponent, class AActor* InOtherActor, FHitResult InHitResult, FGameplayTargetDataFilterHandle InFilterHandle, EWrestlerOutputPins& OutPins);
    bool MatchesCharacterTag(const FGameplayTag& InCharacterTag);
    FGameplayAbilityTargetDataHandle MakeTargetDataFromOverlapSweep(const class UPrimitiveComponent* InOverlappedComponent, FHitResult InHitResult);
    bool IsDead();
    void IsCurrentlyTargeting(bool& bOutIsTargeting, class AActor*& OutCurrentTarget);
    void GiveAbility(TSubclassOf<class UWrestlerGameplayAbility> InAbility);
    class UWrestlerMovementComponent* GetWrestlerMovementComponent();
    bool GetWasRecentlyAttacked();
    class UWrestlerTraversalComponent* GetTraversalComponent();
    class USkeletalMeshComponent* GetSkeletalMeshComp();
    bool GetIsWallClimbing();
    bool GetIsVaulting();
    bool GetIsSpeaking();
    bool GetIsMantling();
    bool GetIsLedgeVaulting();
    bool GetIsInDialogue();
    bool GetIsInCutscene();
    float GetHealth();
    TEnumAsByte<EPhysicalSurface> GetFloorSurfaceType();
    class UHeraDialogueInfo* GetDialogueInfo();
    FGameplayTag GetDialogueCharacterTag();
    int32 GetCharacterLevel();
    class UAkGameObject* GetAudioComponent();
    class UHeraAudioCharacterComponent* GetAudioCharacterComponent();
    FString GetActorName();
    void EventOnHealthChanged(float InCurrentHealth, float InMaxHealth);
    void EventOnDamage(float InDamage, class AActor* InDamageInstigator);
    void EventOnBloodChanged(float InCurrentBlood, float InMaxBlood);
    void DoHealthRegen();
    void Death();
    void ControlCueProcessed(class UWrestlerControlCue* InControlCue);
}; // Size: 0xAB0

class AWrestlerClueTrail : public AActor
{
    FName EmissiveParameterName;                                                      // 0x0298 (size: 0x8)
    TArray<class UMaterialInstanceDynamic*> DynamicMaterials;                         // 0x02A0 (size: 0x10)
    class UWrestlerHeightenedSensesClueComponent* ClueComponent;                      // 0x02B0 (size: 0x8)

    void OnDecalAlphaUpdate(float InAlpha);
}; // Size: 0x2B8

class AWrestlerCollectable : public AInteractableQuestActor
{
    class UHeraPersistenceComponentHidden* PersistenceComponentHidden;                // 0x02F8 (size: 0x8)
    ECollectableType CollectableType;                                                 // 0x0300 (size: 0x1)
    bool bHasNotification;                                                            // 0x0301 (size: 0x1)
    bool bHasXPReward;                                                                // 0x0302 (size: 0x1)
    FWrestlerNotificationData Notification;                                           // 0x0308 (size: 0x58)
    FString CodexNameID;                                                              // 0x0360 (size: 0x10)
    FString CodexUnlock;                                                              // 0x0370 (size: 0x10)
    FGameplayTag XPRewardType;                                                        // 0x0380 (size: 0x8)
    bool bIsPartOfGameProgression;                                                    // 0x0388 (size: 0x1)

    void OnInteractionStarted(class AActor* InInteractingActor);
}; // Size: 0x390

class AWrestlerControllerFrontEnd : public AWrestlerPlayerController
{
}; // Size: 0x890

class AWrestlerControllerInGame : public AWrestlerPlayerController
{
    class UWrestlerCombatTargetComponent* TargetComponent;                            // 0x08A0 (size: 0x8)
    EWrestlerGameTeam GameTeamID;                                                     // 0x08A8 (size: 0x1)
    bool bAutoLockOn;                                                                 // 0x09C2 (size: 0x1)
    class UWrestlerPlayerActionAssetMap* PlayerActionAssetMap;                        // 0x09D0 (size: 0x8)
    class UInputMappingContext* PlayerMappingContext;                                 // 0x09D8 (size: 0x8)
    class UUserWidget* DebugMenuWidget;                                               // 0x09E0 (size: 0x8)
    class UUserWidget* PropertyWidget;                                                // 0x09E8 (size: 0x8)
    float LookAtTraceInterval;                                                        // 0x09F0 (size: 0x4)
    int32 MaxLookAtTraceQueryAttempts;                                                // 0x0A04 (size: 0x4)
    TMap<class TWeakObjectPtr<AActor>, class TWeakObjectPtr<UWrestlerLookAtComponent>> ActorToLookAtCompMap; // 0x0A08 (size: 0x50)
    TArray<TWeakObjectPtr<UWrestlerLookAtComponent>> ActiveLookAtComponents;          // 0x0A58 (size: 0x10)

    void UpdateUITargeting(class AActor* CurrentTarget, class AActor* OldTarget);
    void ReceiveOnPlayerInput(float InDeltaTime, const FWrestlerInput& InCurrent, const FWrestlerInput& InLast);
    void ReceiveOnPlayerDeath();
    void ReceiveOnGameOver();
    FVector2D ProcessStickInput(const FWrestlerControllerSetupStick& InStick, const FVector2D& InInput, float InDeltaTime, float& OutCurrentAcceleration, bool bInUnscaled);
    void OnVentrueElixirActivated();
    void OnPreSave();
    void OnPostSave(bool bInSuccess);
    void OnMovementModeChange(class ACharacter* InCharacter, TEnumAsByte<EMovementMode> PreviousMovementMode, uint8 PreviousCustomMode);
    void OnHealthElixirActivated();
    void OnDialogueSkipped();
    void OnBrujahElixirActivated();
    void OnBloodElixirActivated();
    bool IsTargeting();
    float GetYawAxisScale();
    class AWrestlerCharacterBase* GetWrestlerCharacter();
    class AActor* GetTarget();
    float GetPitchAxisScale();
    FWrestlerInput GetFrameInput();
    float GetForwardInput();
}; // Size: 0xA70

class AWrestlerControllerLoadScreen : public AWrestlerPlayerController
{
}; // Size: 0x890

class AWrestlerCrowdCharacter : public ACharacter
{
    class UWrestlerModularCharacter* ModularCharacterComponent;                       // 0x0680 (size: 0x8)
    class UWrestlerModularCharacterProfile* ModularCharacterProfile;                  // 0x0688 (size: 0x8)
    bool bCanMove;                                                                    // 0x0690 (size: 0x1)
    bool bUseAudio;                                                                   // 0x0691 (size: 0x1)
    bool bLazyLoad;                                                                   // 0x0692 (size: 0x1)
    FName SignificanceTag;                                                            // 0x0694 (size: 0x8)
    bool bAddToSignificanceManager;                                                   // 0x069C (size: 0x1)
    float SignificanceManagerMaxDrawDistance;                                         // 0x06A0 (size: 0x4)

    void OnDeath();
}; // Size: 0x6B0

class AWrestlerCrowdKillVolume : public AActor
{
    TSoftClassPtr<AWrestlerCrowdCharacter> CrowdClass;                                // 0x0298 (size: 0x28)
    TSubclassOf<class AWrestlerCrowdCharacter> LoadedCrowdClass;                      // 0x02C0 (size: 0x8)
    class USceneComponent* SceneComponent;                                            // 0x02C8 (size: 0x8)
    TArray<TWeakObjectPtr<AWrestlerCrowdCharacter>> OverlappingCrowd;                 // 0x02D0 (size: 0x10)

    void KillOverlappingCrowd();
    TArray<class AWrestlerCrowdCharacter*> GetOverlappingCrowd();
}; // Size: 0x2E0

class AWrestlerDeadBody : public AActor
{
    class UWrestlerAIPerceptionStimuliSource* StimuliSource;                          // 0x02B8 (size: 0x8)
    TArray<FName> SightTargets;                                                       // 0x02C0 (size: 0x10)
    FWrestlerDeadBodyOnDeadBodyDestroyed OnDeadBodyDestroyed;                         // 0x02D0 (size: 0x10)
    void DeadBodyDestroyedDelegate(class AActor* DeadBodyActor);
    FGameplayTag CharacterTag;                                                        // 0x02E0 (size: 0x8)
    EWrestlerGameTeam GameTeam;                                                       // 0x02E8 (size: 0x1)
    FPoseSnapshot DeadBodySnapshot;                                                   // 0x02F0 (size: 0x38)
    TSubclassOf<class UAISense> SenseToSelfRegister;                                  // 0x0328 (size: 0x8)
    class UWrestlerModularCharacterProfile* ModularCharacterProfile;                  // 0x0330 (size: 0x8)
    bool bHasUVGlow;                                                                  // 0x0338 (size: 0x1)
    FGameplayTag DeathBehaviourTag;                                                   // 0x033C (size: 0x8)
    class UAkSwitchValue* EnemyTypeAudioSwitch;                                       // 0x0348 (size: 0x8)
    FGameplayTagContainer OwnedCharacterTags;                                         // 0x0350 (size: 0x20)
    class USkeletalMeshComponent* DeadBodyMesh;                                       // 0x0370 (size: 0x8)
    class UHeraAudioCharacterComponent* AudioCharacterComponent;                      // 0x0378 (size: 0x8)
    float CorpseLifeSpan;                                                             // 0x0380 (size: 0x4)
    float CorpseDisposalDistance;                                                     // 0x0384 (size: 0x4)
    bool bIsInDialogue;                                                               // 0x0399 (size: 0x1)
    bool bIsSpeaking;                                                                 // 0x039A (size: 0x1)

    void SetIsSpeaking(const bool bIsSpeaking);
    void SetIsInDialogue(const bool bInDialogue);
    void SetIsInCutscene(const bool bInCutscene);
    void SetGameTeam(EWrestlerGameTeam InGameTeam);
    void SetDeathPose();
    void SetCharacterProfile(class UWrestlerModularCharacterProfile* InCharacterProfiler);
    bool MatchesCharacterTag(const FGameplayTag& InCharacterTag);
    class USkeletalMeshComponent* GetSkeletalMeshComp();
    bool GetIsSpeaking();
    bool GetIsInDialogue();
    bool GetIsInCutscene();
    class UAkSwitchValue* GetEnemyTypeAudioSwitch();
    FGameplayTag GetDialogueCharacterTag();
    FPoseSnapshot GetDeadBodySnapshot();
    class UAkGameObject* GetAudioComponent();
    class UHeraAudioCharacterComponent* GetAudioCharacterComponent();
    FString GetActorName();
}; // Size: 0x3A0

class AWrestlerDebugCamera : public AActor
{
    class USpringArmComponent* SpringArmComponent;                                    // 0x0298 (size: 0x8)
    class UCameraComponent* CameraComponent;                                          // 0x02A0 (size: 0x8)
    FString CameraName;                                                               // 0x02A8 (size: 0x10)

    void SetCameraPresent(int32 InCameraPresentIndex);
}; // Size: 0x2B8

class AWrestlerDefendZone : public AActor
{
    int32 AcceptablePointCount;                                                       // 0x0298 (size: 0x4)
    TArray<FVector> Points;                                                           // 0x02A0 (size: 0x10)

    bool IsPointInsideZone(FVector Point, float ExtentMultiplier, bool IncludeHysteresis);
    bool IsInQueryResponseRange(FVector Vector);
    TArray<FVector> GetPoints();
    TArray<FVector> GetEQGPoints(const FVector& InLocation, const float InQueryRange);
}; // Size: 0x2B0

class AWrestlerDialogueActor : public AActor
{
    bool bIsInDialogue;                                                               // 0x02A8 (size: 0x1)
    bool bIsInCutscene;                                                               // 0x02A9 (size: 0x1)
    bool bIsSpeaking;                                                                 // 0x02AA (size: 0x1)
    FGameplayTag DialogueCharacterTag;                                                // 0x02AC (size: 0x8)

    void SetIsSpeaking(const bool bIsSpeaking);
    void SetIsInDialogue(const bool bInDialogue);
    void SetIsInCutscene(const bool bInCutscene);
    bool MatchesCharacterTag(const FGameplayTag& InCharacterTag);
    class USkeletalMeshComponent* GetSkeletalMeshComp();
    bool GetIsSpeaking();
    bool GetIsInDialogue();
    bool GetIsInCutscene();
    FGameplayTag GetDialogueCharacterTag();
    class UAkGameObject* GetAudioComponent();
    class UHeraAudioComponent* GetAudioComp();
    FString GetActorName();
}; // Size: 0x2B8

class AWrestlerDialogueLevelSequenceActor : public ALevelSequenceActor
{
    bool bIsInDialogue;                                                               // 0x0348 (size: 0x1)
    bool bIsInCutscene;                                                               // 0x0349 (size: 0x1)
    bool bIsSpeaking;                                                                 // 0x034A (size: 0x1)
    FGameplayTag DialogueCharacterTag;                                                // 0x034C (size: 0x8)

    void SetIsSpeaking(const bool bIsSpeaking);
    void SetIsInDialogue(const bool bInDialogue);
    void SetIsInCutscene(const bool bInCutscene);
    bool MatchesCharacterTag(const FGameplayTag& InCharacterTag);
    class USkeletalMeshComponent* GetSkeletalMeshComp();
    bool GetIsSpeaking();
    bool GetIsInDialogue();
    bool GetIsInCutscene();
    FGameplayTag GetDialogueCharacterTag();
    class UAkGameObject* GetAudioComponent();
    class UHeraAudioComponent* GetAudioComp();
    FString GetActorName();
}; // Size: 0x358

class AWrestlerDialogueRig : public AHeraDialogueRig
{
    class UHeraMissionObjective* MissionObjective;                                    // 0x03F0 (size: 0x8)
    TSubclassOf<class UWrestlerDialogueAbilitylData> DialogueAbilityData;             // 0x03F8 (size: 0x8)
    TSoftObjectPtr<UHeraPropertyBool> InteractionProperty;                            // 0x0400 (size: 0x28)
    class UHeraMissionActorComponent* MissionActorComponent;                          // 0x0428 (size: 0x8)
    class UWrestlerInteractionComponent* StartDialogueInteraction;                    // 0x0430 (size: 0x8)
    FGameplayTagContainer OwnedGameplayTags;                                          // 0x0438 (size: 0x20)

    void SetInteractionPropertyPayload(const bool bIsActive);
    void OnStartDialogueInteraction(class AActor* InInteractingActor);
}; // Size: 0x460

class AWrestlerDoor : public AInteractableQuestActor
{
}; // Size: 0x2F8

class AWrestlerDoorActorBase : public AWrestlerActorInteractionBase
{
}; // Size: 0x2C0

class AWrestlerDynamicMaskObject : public AActor
{
}; // Size: 0x2A8

class AWrestlerEnemyCharacter : public AWrestlerAICharacter
{
    FWrestlerEnemyCharacterPCSBlockingStateDelegate PCSBlockingStateDelegate;         // 0x0BD0 (size: 0x10)
    void OnPSCBlockingState(const bool bBlocking, const EWrestlerEnemyType InEnemyType, class AActor* InInstigator);
    FName DebugEnemyTypeName;                                                         // 0x0BE0 (size: 0x8)
    class UAkSwitchValue* DebugEnemyTypeAudioSwitch;                                  // 0x0BE8 (size: 0x8)
    TSoftClassPtr<AActor> DebugDeadActorClass;                                        // 0x0BF0 (size: 0x28)
    TSoftObjectPtr<UStateTree> DebugStateTree;                                        // 0x0C18 (size: 0x28)
    TSubclassOf<class AController> DebugAIControllerClass;                            // 0x0C40 (size: 0x8)
    class UWrestlerEquipmentDefinition* DebugWeaponDefiniton;                         // 0x0C48 (size: 0x8)
    TSubclassOf<class UWrestlerWeaponInstance> DebugWeaponInstanceClass;              // 0x0C50 (size: 0x8)
    class UAnimDataAsset* DebugAnimAsset;                                             // 0x0C58 (size: 0x8)
    class UWrestlerControlComponent* ControlComponent;                                // 0x0C90 (size: 0x8)
    class UWrestlerAIPatrolComponent* PatrolComponent;                                // 0x0C98 (size: 0x8)
    class UHeraMissionActorComponent* HeraMissionActorComponent;                      // 0x0CA0 (size: 0x8)
    class UWrestlerAIPerceptionStimuliSource* PerceptionStimuliSourceComponent;       // 0x0CA8 (size: 0x8)
    class UWrestlerEquipmentManagerComponent* EquipmentManagerComponent;              // 0x0CB0 (size: 0x8)
    class UWrestlerRouteFollowingComponent* RouteFollowingComponent;                  // 0x0CB8 (size: 0x8)
    class UWrestlerStateTreeComponent* StateTreeComponent;                            // 0x0CC0 (size: 0x8)
    class UWrestlerCharacterFloorControlComponent* CharacterFloorControl;             // 0x0CC8 (size: 0x8)
    FName PCSTeamTag;                                                                 // 0x0CD0 (size: 0x8)
    float MoveToTolerance;                                                            // 0x0CD8 (size: 0x4)
    class UHeraMissionObjective* DeathObjective;                                      // 0x0CE0 (size: 0x8)
    class UHeraMissionObjective* StunObjective;                                       // 0x0CE8 (size: 0x8)
    class UHeraMissionObjective* AwareOfPlayerObjective;                              // 0x0CF0 (size: 0x8)
    class UHeraMissionObjective* DetectedPlayerObjective;                             // 0x0CF8 (size: 0x8)
    class UHeraMissionObjective* TKedObjective;                                       // 0x0D00 (size: 0x8)
    class UWrestlerEnemyHealthStunWidgetComponent* UIHealthStunWidgetComponent;       // 0x0D08 (size: 0x8)
    class UWrestlerEnemyAlertnessWidgetComponent* UIAlertnessWidgetComponent;         // 0x0D10 (size: 0x8)
    class UWrestlerTaskDebugWidgetComponent* TaskDebugWidgetComponent;                // 0x0D18 (size: 0x8)
    class AWrestlerPatrolRoute* PatrolRoute;                                          // 0x0D20 (size: 0x8)
    float CanBeFedOnTime;                                                             // 0x0D28 (size: 0x4)
    TSubclassOf<class UUserWidget> TagWidgetClass;                                    // 0x0D30 (size: 0x8)
    FName EnemyTypeName;                                                              // 0x0D44 (size: 0x8)
    FName EnemyDebugName;                                                             // 0x0D4C (size: 0x8)
    FName SignificanceTag;                                                            // 0x0D54 (size: 0x8)
    bool bAddToSignificanceManager;                                                   // 0x0D5C (size: 0x1)
    float SignificanceManagerMaxDrawDistance;                                         // 0x0D60 (size: 0x4)
    TArray<class UWrestlerModularCharacterProfile*> ModularCharacterProfiles;         // 0x0D68 (size: 0x10)
    class UAkSwitchValue* EnemyTypeAudioSwitch;                                       // 0x0D78 (size: 0x8)
    class UAkSwitchValue* WeaponAudioSwitch;                                          // 0x0D80 (size: 0x8)
    class UAnimDataAsset* AnimationSet;                                               // 0x0D88 (size: 0x8)
    class UWrestlerMovementSetData* MovementSet;                                      // 0x0D90 (size: 0x8)
    FWrestlerMovementSetInfo CurrentMovementSettings;                                 // 0x0D98 (size: 0x18)
    FWrestlerRangedRotateConfig RangedRotationSettings;                               // 0x0DB0 (size: 0x28)
    TWeakObjectPtr<class AWrestlerAISpawner> Spawner;                                 // 0x0DD8 (size: 0x8)

    void ToggleDebug(const bool bOutDebug);
    bool ShouldApplyPlayerOffset();
    void SetInteractedWithPlayer(const bool InHasInteractedWithPlayer);
    void SetDebugDetails();
    void SetCanTalk(const bool CanTalk);
    void SetAnimationAsset(class UAnimDataAsset* InAnimAsset);
    void RaiseTKedObjective();
    void PrintDebugDetails();
    void PlayBark(FGameplayTag& BarkTag);
    void MoveTo_Internal(const FVector& InDestination);
    bool IsMassCharacter();
    class UAkSwitchValue* GetWeaponAudioSwitch();
    class UWrestlerMovementSetData* GetMovementSet();
    bool GetInteractedWithPlayer();
    FName GetEnemyTypeName();
    class UAkSwitchValue* GetEnemyTypeAudioSwitch();
    class UWrestlerEnemySubsystem* GetEnemySubsystem();
    class UWrestlerConfigDataAsset_EnemyStats* GetEnemyStatsDataAsset();
    FName GetEnemyDebugName();
    class UWrestlerDataAsset_ModularEnemies* GetEnemies();
    float GetDamageAmountByTag(FGameplayTag InDamageTag);
    FWrestlerMovementSetInfo GetCurrentMovementSettings();
    bool GetCanTalk();
    class UAnimDataAsset* GetAnimationSet();
    void EventOnStunChanged(float CurrentValue, float MaxValue);
    void ChangeWeapon(TSubclassOf<class UWrestlerEquipmentDefinition> InWeapon, TSoftObjectPtr<UAnimDataAsset> InAnimation, TSoftObjectPtr<UWrestlerMovementSetData> InMovement, FName InTaskOverride, class AActor*& OutOldWeapon, class AActor*& OutNewWeapon);
}; // Size: 0xE20

class AWrestlerEnemyController : public AWrestlerAIController
{
    bool bEnemySightDisabled;                                                         // 0x0410 (size: 0x1)
    bool bUseFocusAimOffsets;                                                         // 0x0411 (size: 0x1)
    bool bAutoEnableStreaming;                                                        // 0x0412 (size: 0x1)
    class UWrestlerBehaviorTreeComponent* BehaviourTreeComponent;                     // 0x0418 (size: 0x8)
    class UWrestlerTokenSinkComponent* TokenSinkComponent;                            // 0x0420 (size: 0x8)
    class UWorldPartitionStreamingSourceComponent* WorldPartitionStreamingSourceComponent; // 0x0428 (size: 0x8)
    FWrestlerEnemyBehaviours DefaultEnemyBehaviours;                                  // 0x0430 (size: 0x50)
    TMap<class FName, class FWrestlerEnemyBehaviours> EnemyCombatBehaviours;          // 0x0480 (size: 0x50)
    FName BBKeyLastSensedLocation;                                                    // 0x04DC (size: 0x8)
    FName BBKeyLastSeenLocation;                                                      // 0x04E4 (size: 0x8)
    FName BBKeyLastHeardLocation;                                                     // 0x04EC (size: 0x8)
    FName BBKeyLastSensedLocationWasHearing;                                          // 0x04F4 (size: 0x8)
    FName BBKeyMoveToLocation;                                                        // 0x04FC (size: 0x8)
    FName BBKeyStunTimer;                                                             // 0x0504 (size: 0x8)
    bool bUseHardSetRotation;                                                         // 0x050C (size: 0x1)
    FGameplayTag stun;                                                                // 0x0510 (size: 0x8)
    FGameplayTag combat;                                                              // 0x0518 (size: 0x8)
    FGameplayTag dash;                                                                // 0x0520 (size: 0x8)
    FName ConfigDataName;                                                             // 0x0528 (size: 0x8)
    FName CombatConfigName;                                                           // 0x0530 (size: 0x8)
    FGameplayTag TeamBattleFinishedTag;                                               // 0x0540 (size: 0x8)
    FGameplayTag SearchFinishedTag;                                                   // 0x0548 (size: 0x8)
    TEnumAsByte<EWrestlerEnemySubTeam> EnemySubTeam;                                  // 0x0578 (size: 0x1)
    TArray<class AActor*> SeenDeadBodies;                                             // 0x0580 (size: 0x10)
    FName SeenDeadBodyTagName;                                                        // 0x0590 (size: 0x8)
    class AWrestlerStealthCoverVolume* SearchVolume;                                  // 0x05A0 (size: 0x8)

    void SetMoveToLocation(const FVector& MoveToLocation);
    void ReportNoiseForInvestigation(FName InStimulusTag, FVector InNoiseLocation);
    bool HasPreviouslySeenDeadBody(class AActor* InDeadBodyActor);
    TArray<FName> GetStimuliSearches();
    class AWrestlerStealthCoverVolume* GetSearchVolume();
    TEnumAsByte<EWrestlerEnemySubTeam> GetEnemySubTeam();
    TSoftObjectPtr<UBehaviorTree> GetEnemyBehaviour(FGameplayTag InGameplayTag);
}; // Size: 0x5B0

class AWrestlerEnemyPatrolPoint : public AActor
{
    float Weight;                                                                     // 0x0298 (size: 0x4)
    float TimeAtPoint;                                                                // 0x029C (size: 0x4)
    float RotationRateMultiplier;                                                     // 0x02A0 (size: 0x4)

}; // Size: 0x2A8

class AWrestlerEnemyPatrolRoute : public AActor
{
    bool bSingleRun;                                                                  // 0x0298 (size: 0x1)
    float TimeAtPoints;                                                               // 0x029C (size: 0x4)
    bool bActive;                                                                     // 0x02A0 (size: 0x1)
    TArray<FGroupedPatrolPoints> PatrolPoints;                                        // 0x02A8 (size: 0x10)
    bool bUpdateAllPatrolPoints;                                                      // 0x02B8 (size: 0x1)

    void UpdateAllPatrolPoints();
    TArray<FGroupedPatrolPoints> GetPatrolPoints();
    void DrawDebugRoute();
}; // Size: 0x2C8

class AWrestlerEnemyTraversalNavLink : public ANavLinkProxy
{
    class UWrestlerAbilitySystemComponent* AbilitySystemComponent;                    // 0x02E8 (size: 0x8)

    void NotifySmartLinkReached(class UNavLinkCustomComponent* LinkComp, class UObject* PathingAgent, const FVector& DestinationPoint);
}; // Size: 0x2F8

class AWrestlerExecuteCommandVolume : public AActor
{
    class UBoxComponent* BoxCollision;                                                // 0x0298 (size: 0x8)
    TMap<FString, float> CommandValues;                                               // 0x02A0 (size: 0x50)

}; // Size: 0x340

class AWrestlerExponentialHeightFog : public AActor
{
    FWrestlerExponentialHeightFogParameters BaseExponentialHeightFogParameters;       // 0x0298 (size: 0xA0)
    FWrestlerExponentialHeightFogParameters CurrentExponentialHeightFogParameters;    // 0x0338 (size: 0xA0)
    FWrestlerExponentialHeightFogParameters BlendStartParameters;                     // 0x03D8 (size: 0xA0)
    FWrestlerExponentialHeightFogParameters BlendEndParameters;                       // 0x0478 (size: 0xA0)
    float CurrentBlendAlpha;                                                          // 0x0518 (size: 0x4)
    class UExponentialHeightFogComponent* FogComponent;                               // 0x0520 (size: 0x8)
    uint8 bEnabled;                                                                   // 0x0528 (size: 0x1)

    void SetFogEnabled(const bool bInEnabled);
    void OnRep_bEnabled();
}; // Size: 0x530

class AWrestlerExponentialHeightFogVolume : public AWrestlerVolumeBase
{
    int32 Priority;                                                                   // 0x02D0 (size: 0x4)
    FWrestlerExponentialHeightFogParameters ExponentialHeightFogParameters;           // 0x02D8 (size: 0xA0)
    bool bPlayerCurrentlyWithin;                                                      // 0x0378 (size: 0x1)

    void OnDisableTimerEnded();
}; // Size: 0x390

class AWrestlerFakeElevator : public AWrestlerTransitionActor
{

    void ModifyElevator(bool bInWait, bool bInLock, bool bInForceOpen, bool bInForceClose);
}; // Size: 0x2E0

class AWrestlerFeedTargetActor : public AWrestlerGameplayAbilityTargetActor_TargetAssisted
{
    FGameplayTagContainer TargetFilterOutTags;                                        // 0x0450 (size: 0x20)
    FGameplayTagContainer TargetFilterInTags;                                         // 0x0470 (size: 0x20)
    float VerticalRangeAbove;                                                         // 0x0490 (size: 0x4)

    void ShowPassiveReticle();
    void HidePassiveReticle();
    TSubclassOf<class UInterface> GetFilterInterface();
    void EnableTargetActor();
    void DisableTargetActor();
    void BP_OnTargetingStarted();
}; // Size: 0x4A0

class AWrestlerGA_GetTargetActor : public AGameplayAbilityTargetActor
{
    float ScanRange;                                                                  // 0x03E0 (size: 0x4)

}; // Size: 0x3F0

class AWrestlerGameModeBase : public AHeraGameMode
{
    class UHeraPropertyInt* PI_UI_MenuID;                                             // 0x0380 (size: 0x8)
    TSoftClassPtr<UAbilitySystemGlobals> AbilityGlobalsClass;                         // 0x0388 (size: 0x28)
    class UAkStateValue* LoadingFinishedAudioState;                                   // 0x03B0 (size: 0x8)

    void StopLongRunningSoakTest();
    void StartLongRunningSoakTest();
    void SetCurrentMenuID(EWrestlerMenu InMenuID);
    void OnLoadingScreenVisibilityChanged(bool bInVisibility);
    bool IsLongRunningSoakTestRunning();
    EWrestlerMenu GetCurrentMenuID();
}; // Size: 0x3E0

class AWrestlerGameState : public AGameState
{
}; // Size: 0x310

class AWrestlerGameStateInGame : public AWrestlerGameState
{
    class UWrestlerAISpawnHelper* AISpawnHelper;                                      // 0x0310 (size: 0x8)
    class UWrestlerEnemyAudioController* EnemyAudioController;                        // 0x0318 (size: 0x8)
    class UWrestlerClanPerkUsageEvaluator* ClanPerkUsageEvaluator;                    // 0x0320 (size: 0x8)

    class UWrestlerClanPerkUsageEvaluator* GetClanPerkUsageEvaluator();
    class UWrestlerAISpawnHelper* GetAISpawnerHelper();
}; // Size: 0x328

class AWrestlerGameplayAbilityTargetActor : public AGameplayAbilityTargetActor
{
    TWeakObjectPtr<class AGameplayAbilityWorldReticle> ReticleActor;                  // 0x03E0 (size: 0x8)

    FGameplayTargetDataFilterHandle WrestlerMakeFilterHandle(class UStruct* AnyFilter);
    void ShowReticle();
    void HideReticle();
}; // Size: 0x3F0

class AWrestlerGameplayAbilityTargetActor_Persistent : public AWrestlerGameplayAbilityTargetActor
{
}; // Size: 0x3F0

class AWrestlerGameplayAbilityTargetActor_SphereTarget : public AWrestlerGameplayAbilityTargetActor
{
    float OverlapRadius;                                                              // 0x03E8 (size: 0x4)
    TEnumAsByte<ECollisionChannel> QueryChannel;                                      // 0x03EC (size: 0x1)

    bool GetPlayerLookAtPoint(FVector& OutViewPoint);
}; // Size: 0x3F0

class AWrestlerGameplayAbilityTargetActor_SphereTrace : public AWrestlerActor_Trace
{
    float Radius;                                                                     // 0x03F8 (size: 0x4)
    bool bTraceByChannel;                                                             // 0x03FC (size: 0x1)
    bool bReticleUseEyeLocation;                                                      // 0x03FD (size: 0x1)
    bool bPitchRangeReduction;                                                        // 0x03FE (size: 0x1)
    float PitchedRange;                                                               // 0x0400 (size: 0x4)
    TEnumAsByte<ECollisionChannel> Channel;                                           // 0x0408 (size: 0x1)

}; // Size: 0x410

class AWrestlerGameplayAbilityTargetActor_TargetAssisted : public AWrestlerGameplayAbilityTargetActor
{
    float Radius;                                                                     // 0x03E8 (size: 0x4)
    float MaxAngleDegrees;                                                            // 0x03EC (size: 0x4)
    float MaxAnglePitchDegrees;                                                       // 0x03F0 (size: 0x4)
    float WeightDistance;                                                             // 0x03F4 (size: 0x4)
    float WeightAngle;                                                                // 0x03F8 (size: 0x4)
    TEnumAsByte<ECollisionChannel> QueryChannel;                                      // 0x03FC (size: 0x1)
    float SphereCastPeriod;                                                           // 0x0400 (size: 0x4)
    float SphereCastDistance;                                                         // 0x0404 (size: 0x4)
    float SphereCastRadius;                                                           // 0x0408 (size: 0x4)
    TEnumAsByte<ECollisionChannel> LineOfSightTestCollisionChannel;                   // 0x0420 (size: 0x1)
    bool bRequireLineOfSight;                                                         // 0x0421 (size: 0x1)
    float LineOfSightTestSphereRadius;                                                // 0x0424 (size: 0x4)
    bool bFindTargetOnConfirm;                                                        // 0x0428 (size: 0x1)
    class AActor* CurrentTarget;                                                      // 0x0430 (size: 0x8)

}; // Size: 0x450

class AWrestlerGameplayAbilityTargetActor_Telekinesis : public AWrestlerGameplayAbilityTargetActor_TargetAssisted
{
}; // Size: 0x450

class AWrestlerGameplayAbilityTargetActor_TelekinesisTrajectory : public AWrestlerGameplayAbilityTargetActor_Persistent
{
    float ReticleTeleportThreshold;                                                   // 0x03E8 (size: 0x4)
    float TrajectorySmoothRate;                                                       // 0x03EC (size: 0x4)

    void RecalculateTrajectory();
}; // Size: 0x470

class AWrestlerGameplayCueNotify_Actor : public AGameplayCueNotify_Actor
{

    void WhileActiveAudio(const class AWrestlerCharacterBase* Character, class UHeraAudioCharacterComponent* AudioComponent, const FGameplayCueParameters& Parameters);
    void OnRemoveAudio(const class AWrestlerCharacterBase* Character, class UHeraAudioCharacterComponent* AudioComponent, const FGameplayCueParameters& Parameters);
    void OnExecuteAudio(const class AWrestlerCharacterBase* Character, class UHeraAudioCharacterComponent* AudioComponent, const FGameplayCueParameters& Parameters);
    void OnActiveAudio(const class AWrestlerCharacterBase* Character, class UHeraAudioCharacterComponent* AudioComponent, const FGameplayCueParameters& Parameters);
}; // Size: 0x308

class AWrestlerGameplayCueNotify_MassActor : public AWrestlerGameplayCueNotify_Actor
{
    class AActor* TargetActor;                                                        // 0x0308 (size: 0x8)

    void OnMassTargetActorChanged(class AActor* PreviousActor, class AActor* NewActor);
    void OnMassEntityDisabled();
}; // Size: 0x318

class AWrestlerHUD : public AHeraHUD
{

    void ShowDLCEntitlementsChangedPrompt();
    void ReturnToMainMenu();
    class UHeraFadeWidget* GetFadeOverlayWidget();
}; // Size: 0x460

class AWrestlerHUDFrontEnd : public AWrestlerHUD
{
}; // Size: 0x460

class AWrestlerHUDInGame : public AWrestlerHUD
{

    void ReceiveOnGameOver();
    void ReceiveOnDeadByMasquerade();
}; // Size: 0x460

class AWrestlerHUDLoadScreen : public AWrestlerHUD
{
}; // Size: 0x460

class AWrestlerHighlightVFXActor : public AActor
{

    void UpdateMassParticle(class AActor* InParticleActor, const FWrestlerHighlightUpdateData& InUpdateData);
    class AActor* SpawnMassParticleEffect(const FWrestlerHighlightUpdateData& InUpdateData, class USceneComponent* AttachParentComponent);
    bool IsCleaningUp();
    float GetHighlightRadius();
    void CleanUpAndDestroy();
}; // Size: 0x2A0

class AWrestlerHoudiniContainer : public APartitionActor
{
}; // Size: 0x298

class AWrestlerInteractionTargetActor : public AWrestlerGameplayAbilityTargetActor_TargetAssisted
{
    int32 ReticleLimit;                                                               // 0x0450 (size: 0x4)
    float ChosenTargetDist;                                                           // 0x0454 (size: 0x4)
    float ChosenTargetScore;                                                          // 0x0458 (size: 0x4)
    float LOSBreakDistance;                                                           // 0x045C (size: 0x4)
    bool bUpdateCrosshairUI;                                                          // 0x0460 (size: 0x1)
    float CrossRadius;                                                                // 0x0464 (size: 0x4)
    TMap<class USceneComponent*, class FWrestlerScoredInteraction> Scores;            // 0x0478 (size: 0x50)
    class AWrestlerHUD* CrosshairHUD;                                                 // 0x04F8 (size: 0x8)
    int32 MaxCrosshairTraceQueryAttempts;                                             // 0x050C (size: 0x4)

    bool GetInteractionFromTargetData(const FGameplayAbilityTargetDataHandle& InHandle, int32 InIndex, FWrestlerInteractionTarget& OutInteraction);
}; // Size: 0x520

class AWrestlerInteractionWorldReticle : public AGameplayAbilityWorldReticle
{
    class UWrestlerInteractionComponent* CurrentTarget;                               // 0x02C8 (size: 0x8)
    class UWrestlerInteractionWidgetComponent* InteractionWidgetComponent;            // 0x02D0 (size: 0x8)
    float ExipryDuration;                                                             // 0x02D8 (size: 0x4)
    class UWrestlerInteractionWidget* InteractionWidget;                              // 0x02E0 (size: 0x8)

    void OnPlayerHudVisibilityChanged(bool bIsVisible);
    void OnHudHideForGameOver();
    void Interact(class AActor* InInteractingActor);
}; // Size: 0x2F0

class AWrestlerLevelStreamingVolume : public ALevelStreamingVolume
{
    class UHeraPropertyComponentBool* StreamingVolumeEnabledPropertyComponent;        // 0x02E8 (size: 0x8)
    class UHeraMissionActorComponent* HeraMissionActorComponent;                      // 0x02F0 (size: 0x8)

    void OnStreamingVolumeEnabledPropertyChanged(bool bInNewValue);
}; // Size: 0x2F8

class AWrestlerLightActorBase : public AActor
{
    class UWrestlerLightActorComponent* MainLights;                                   // 0x02A0 (size: 0x8)
    class UWrestlerLightActorComponent* SecondaryLights;                              // 0x02A8 (size: 0x8)
    class UHeraAudioMassComponent* Audio;                                             // 0x02B0 (size: 0x8)
    EWrestlerLightActorFixedTickRate FixedLightTickRate;                              // 0x02B8 (size: 0x1)
    class UAkRtpc* AudioIntensityRTPC;                                                // 0x02C0 (size: 0x8)
    bool AddToSignificanceManager;                                                    // 0x02C8 (size: 0x1)
    FName SignificanceTag;                                                            // 0x02CC (size: 0x8)

    void OnLightEnabledChanged(class UWrestlerLightActorComponent* InComponent, bool bIsEnabled);
}; // Size: 0x2E8

class AWrestlerLightmaster : public AHeraLightingActorBase
{
    class USceneComponent* VFXBurst;                                                  // 0x02E0 (size: 0x8)
    class USceneComponent* Lights;                                                    // 0x02E8 (size: 0x8)
    class USceneComponent* Meshes;                                                    // 0x02F0 (size: 0x8)
    class USceneComponent* VFX;                                                       // 0x02F8 (size: 0x8)
    class USceneComponent* RotationRoot;                                              // 0x0300 (size: 0x8)
    class USceneComponent* Root;                                                      // 0x0308 (size: 0x8)
    class UTimelineComponent* OnFadeTimelineInternal;                                 // 0x0310 (size: 0x8)
    class UTimelineComponent* OffFadeTimelineInternal;                                // 0x0318 (size: 0x8)
    class UTimelineComponent* FadeOnTimeline;                                         // 0x0320 (size: 0x8)
    class UTimelineComponent* FadeOffTimeline;                                        // 0x0328 (size: 0x8)
    class UTimelineComponent* DamageTimeline;                                         // 0x0330 (size: 0x8)
    TArray<class UMaterialInstanceDynamic*> EmissiveMaterialArray;                    // 0x0338 (size: 0x10)
    TArray<FWrestlerLampDamageLight> LampPostVarsArray;                               // 0x0348 (size: 0x10)
    FRotator MeshUndamagedRotation;                                                   // 0x0358 (size: 0x18)
    double DamageShakeRandomFreq;                                                     // 0x0370 (size: 0x8)
    double DamageShakeRandomIntensityX;                                               // 0x0378 (size: 0x8)
    double DamageShakeRandomIntensityY;                                               // 0x0380 (size: 0x8)
    double DamageShakeMultiplier;                                                     // 0x0388 (size: 0x8)
    double DamageShakeFrequency;                                                      // 0x0390 (size: 0x8)
    double DamageShakeDuration;                                                       // 0x0398 (size: 0x8)
    bool bDamageRandomShake;                                                          // 0x03A0 (size: 0x1)
    bool bEnableDamage;                                                               // 0x03A1 (size: 0x1)
    double DamageMaxAmount;                                                           // 0x03A8 (size: 0x8)
    class UMaterialInstance* DecalMaterial;                                           // 0x03B0 (size: 0x8)
    TArray<class UNiagaraComponent*> BurstParticleArrayNiagara;                       // 0x03B8 (size: 0x10)
    bool bVFXOn;                                                                      // 0x03C8 (size: 0x1)
    bool bVFXisOn;                                                                    // 0x03C9 (size: 0x1)
    bool bCurveFlickerOn;                                                             // 0x03CA (size: 0x1)
    bool bCurveFlickerInEditor;                                                       // 0x03CB (size: 0x1)
    bool bFlickerOnlyAffectsEmissive;                                                 // 0x03CC (size: 0x1)
    class UCurveFloat* FlickerCurve;                                                  // 0x03D0 (size: 0x8)
    double FlickerSpeed;                                                              // 0x03D8 (size: 0x8)
    bool bFlickeringAffectsTemperature;                                               // 0x03E0 (size: 0x1)
    bool bLightFadesOn;                                                               // 0x03E1 (size: 0x1)
    class UCurveFloat* OnCurve;                                                       // 0x03E8 (size: 0x8)
    double LightFadeOnMaxSpeed;                                                       // 0x03F0 (size: 0x8)
    double LightFadeOnMinSpeed;                                                       // 0x03F8 (size: 0x8)
    bool bLightFadesOff;                                                              // 0x0400 (size: 0x1)
    class UCurveFloat* OffCurve;                                                      // 0x0408 (size: 0x8)
    double GlobalFlickerValueMultiplier;                                              // 0x0410 (size: 0x8)
    double GlobalFlickerIntensityModifier;                                            // 0x0418 (size: 0x8)
    bool bIsFlickerOn_0;                                                              // 0x0420 (size: 0x1)
    float CurrentStormShakeIntensity;                                                 // 0x0424 (size: 0x4)
    bool bFlickerWhenEnergyActorNear;                                                 // 0x0428 (size: 0x1)
    double EnergyActorInfluenceMinRadius;                                             // 0x0430 (size: 0x8)
    double EnergyActorInfluenceMaxRadius;                                             // 0x0438 (size: 0x8)
    class AActor* EnergyAlteringActor;                                                // 0x0440 (size: 0x8)
    bool bEnergyAlteringActorExists;                                                  // 0x0448 (size: 0x1)
    bool bEnergyActorIsNearby;                                                        // 0x0449 (size: 0x1)
    bool bFlickerOnStormShake;                                                        // 0x044A (size: 0x1)
    double EventFlickerDecayRate;                                                     // 0x0450 (size: 0x8)
    double PowerFade;                                                                 // 0x0458 (size: 0x8)
    bool bPowerFadeAffectsTemperature;                                                // 0x0460 (size: 0x1)
    double PowerFadeTemperatureFloor;                                                 // 0x0468 (size: 0x8)
    bool bUsesLightmasterValues;                                                      // 0x0470 (size: 0x1)
    bool bLightsOn;                                                                   // 0x0471 (size: 0x1)
    double EmissiveIntensity;                                                         // 0x0478 (size: 0x8)
    FLinearColor EmissiveTint;                                                        // 0x0480 (size: 0x10)
    double MainLightIntensity;                                                        // 0x0490 (size: 0x8)
    double MainLightTemperature;                                                      // 0x0498 (size: 0x8)
    double MainLightAttenuation;                                                      // 0x04A0 (size: 0x8)
    double BounceLightIntensity;                                                      // 0x04A8 (size: 0x8)
    double BounceLightTemperature;                                                    // 0x04B0 (size: 0x8)
    double BounceLightAttenuation;                                                    // 0x04B8 (size: 0x8)
    bool bEmissiveTintUsesTemperature;                                                // 0x04C0 (size: 0x1)
    bool bValuesCached;                                                               // 0x04C1 (size: 0x1)
    TMap<ULightComponent*, double> LightIntensityCache;                               // 0x04C8 (size: 0x50)
    TMap<ULightComponent*, double> LightTemperatureCache;                             // 0x0518 (size: 0x50)
    class AWrestlerCharacter* Character;                                              // 0x0568 (size: 0x8)
    TArray<class ULightComponent*> LightComponents;                                   // 0x0570 (size: 0x10)
    TArray<FWrestlerLightComponent> LightComponentData;                               // 0x0580 (size: 0x10)
    bool bLightsFound;                                                                // 0x0590 (size: 0x1)
    TArray<class ULightComponent*> MainLights;                                        // 0x0598 (size: 0x10)
    class ULightComponent* BounceLight;                                               // 0x05A8 (size: 0x8)
    TArray<class UStaticMeshComponent*> MeshComponents;                               // 0x05B0 (size: 0x10)
    TArray<FWrestlerLightMesh> EmissiveLightMeshes;                                   // 0x05C0 (size: 0x10)
    TArray<class UMaterialInstanceDynamic*> DynamicEmissiveMaterials;                 // 0x05D0 (size: 0x10)
    bool bNoDynamicMaterials;                                                         // 0x05E0 (size: 0x1)
    double OriginalAverageLightTemperature;                                           // 0x05E8 (size: 0x8)
    double SumOfTemperatures;                                                         // 0x05F0 (size: 0x8)
    bool bMeshComponentsFound;                                                        // 0x05F8 (size: 0x1)
    bool bSetMeshEmissiveLightSource;                                                 // 0x05F9 (size: 0x1)
    FString LightName;                                                                // 0x0600 (size: 0x10)
    double FlickerCurveLength;                                                        // 0x0610 (size: 0x8)
    TArray<FName> CachedMaterialSlotNames;                                            // 0x0618 (size: 0x10)
    double PlayerMinimumTickDistance;                                                 // 0x0628 (size: 0x8)
    double MaxDrawDistance;                                                           // 0x0630 (size: 0x8)
    double MaxFadeDistance;                                                           // 0x0638 (size: 0x8)
    FTimerHandle CharacterFindTimer;                                                  // 0x0640 (size: 0x8)
    int32 EnergyActorFindCounter;                                                     // 0x0648 (size: 0x4)
    double CurrentFadeValue;                                                          // 0x0650 (size: 0x8)
    double CurrentLightTemperature;                                                   // 0x0658 (size: 0x8)
    double ElapsedTime;                                                               // 0x0660 (size: 0x8)
    float CurrentRigShakeIntensity;                                                   // 0x0668 (size: 0x4)
    bool bIsFlickering;                                                               // 0x066C (size: 0x1)
    bool bLightIsChangingState;                                                       // 0x066D (size: 0x1)
    TMap<ULightComponent*, double> CachedTemperature;                                 // 0x0670 (size: 0x50)

    void EditorTick2(float InDeltaTime);
}; // Size: 0x6C0

class AWrestlerMapBoundaryActor : public ATriggerBox
{
}; // Size: 0x2A8

class AWrestlerMapCheckActor : public AActor
{
}; // Size: 0x298

class AWrestlerMapZone : public AActor
{
    class UBoxComponent* MapZoneBoundaries;                                           // 0x0298 (size: 0x8)

    FVector GetMapZoneBoundariesLocation();
    FVector GetMapZoneBoundaries();
}; // Size: 0x2A0

class AWrestlerMassActor : public AActor
{
    class UWrestlerModularCharacter* ModularCharacterComponent;                       // 0x02F0 (size: 0x8)
    class UMassAgentComponent* MassAgentComponent;                                    // 0x02F8 (size: 0x8)
    bool bCanBePooled;                                                                // 0x0300 (size: 0x1)
    int32 MaxPoolSize;                                                                // 0x0304 (size: 0x4)
    float BaseEyeHeight;                                                              // 0x0308 (size: 0x4)
    class UWrestlerModularCharacterProfile* CurrentModularCharacterProfile;           // 0x0310 (size: 0x8)

    void SetBloodResonanceTypeByTag_Native(FGameplayTag BloodTypeTag, bool bActivateImmediately);
    bool IsMale();
}; // Size: 0x318

class AWrestlerMassAwarenessIndicator : public AWrestlerMassEntityIndicator
{
    class UWidgetComponent* AwarenessWidgetComponent;                                 // 0x0298 (size: 0x8)

}; // Size: 0x2A0

class AWrestlerMassCharacter : public AWrestlerCharacterBase
{
    class UWrestlerModularCharacter* ModularCharacterComponent;                       // 0x0B20 (size: 0x8)
    class UMassAgentComponent* MassAgentComponent;                                    // 0x0B28 (size: 0x8)
    class UWrestlerCrosshairReactComponent* ReactiveCrosshairComponent;               // 0x0B30 (size: 0x8)
    bool bCanBePooled;                                                                // 0x0B38 (size: 0x1)
    int32 MaxPoolSize;                                                                // 0x0B3C (size: 0x4)
    class UWrestlerModularCharacterProfile* CurrentModularCharacterProfile;           // 0x0B40 (size: 0x8)

    void SetBloodResonanceTypeByTag_Native(FGameplayTag BloodTypeTag, bool bActivateImmediately);
    void OnTookDamage(class AActor* InDamageCauser);
    bool IsPolice();
    bool IsMale();
    void GetEntityIndexAndSerialNumber(int32& OutIndex, int32& OutSerialNumber);
    void DisconnectEntity();
}; // Size: 0xB50

class AWrestlerMassDebugDisplay : public AActor
{
    bool bIsEnabled;                                                                  // 0x0298 (size: 0x1)
    FVector2D ScreenLocation;                                                         // 0x02A0 (size: 0x10)
    bool bShowLODInfo;                                                                // 0x02B0 (size: 0x1)
    bool bShowTemplates;                                                              // 0x02B1 (size: 0x1)
    bool bShowProfiles;                                                               // 0x02B2 (size: 0x1)
    bool bShowDensity;                                                                // 0x02B3 (size: 0x1)
    bool bShowSpawningInfo;                                                           // 0x02B4 (size: 0x1)
    bool bShowMasqueradeInfo;                                                         // 0x02B5 (size: 0x1)
    bool bShowSpacingInfo;                                                            // 0x02B6 (size: 0x1)
    bool bShowBloodResonanceInfo;                                                     // 0x02B7 (size: 0x1)
    bool bShowBloodResonanceEventInfo;                                                // 0x02B8 (size: 0x1)
    bool bShowWallyInfo;                                                              // 0x02B9 (size: 0x1)
    bool bShowWallaInfo;                                                              // 0x02BA (size: 0x1)
    bool bShowMobilityInfo;                                                           // 0x02BB (size: 0x1)
    bool bShowTurningInfo;                                                            // 0x02BC (size: 0x1)
    bool bShowMassActors;                                                             // 0x02BD (size: 0x1)
    FWrestlerMassDebugLocationParameters LocationParams;                              // 0x02C0 (size: 0x20)
    float NearbyDistance;                                                             // 0x02E0 (size: 0x4)
    FWrestlerMassDebugFallDetectParameters FallDetectParams;                          // 0x02E4 (size: 0x24)
    FWrestlerMassDebugMobilityParameters MobilityParams;                              // 0x0308 (size: 0x14)
    FWrestlerMassDebugTurningParameters TurningParams;                                // 0x031C (size: 0x28)

}; // Size: 0x458

class AWrestlerMassEntityIndicator : public AActor
{
}; // Size: 0x298

class AWrestlerMassFleeingVolume : public ATriggerBox
{
    bool bActivateOnBeginPlay;                                                        // 0x02A0 (size: 0x1)
    float DistanceToPlayerToRunAway;                                                  // 0x02A4 (size: 0x4)

    bool IsVolumeActivated();
    void DeactivateVolume();
    void ActivateVolume();
}; // Size: 0x2B0

class AWrestlerMassModularCharGameMode : public AGameMode
{
    bool bRandomiseOrderOnStart;                                                      // 0x0380 (size: 0x1)
    TMap<class EWrestlerPedestrianType, class FWrestlerMassModCharProfileGroup> ProfileGroupsPerType; // 0x0388 (size: 0x50)
    TArray<TSoftObjectPtr<UWrestlerModularCharacterProfile>> ProfilesToPreview;       // 0x03D8 (size: 0x10)
    TMap<class FString, class EWrestlerMassModCharProfileState> ProfileStates;        // 0x03E8 (size: 0x50)
    TSubclassOf<class APawn> PawnClassToSpawn;                                        // 0x0438 (size: 0x8)
    TSoftObjectPtr<UWrestlerModularCharacterProfile> CurrentCharProfile;              // 0x0440 (size: 0x28)
    class APawn* PreviewPawn;                                                         // 0x0468 (size: 0x8)
    class UWrestlerModularCharacter* ModCharComp;                                     // 0x0470 (size: 0x8)
    TArray<class UPackage*> PackagesToCheckOutAndSave;                                // 0x0478 (size: 0x10)

    void ResetOutputProfiles(FName TypeName);
    void RandomiseCharacterOrder();
    void OnSkipToUnsetPressed();
    void OnPrevButtonPressed(int32 SkipAmount);
    void OnNextButtonPressed(int32 SkipAmount);
    void OnDeleteBadAssetsButtonPressed();
    void OnAssetGoodButtonPressed();
    void OnAssetBadButtonPressed();
    void ImportProfiles(FName NewTypeName);
    TArray<FName> GetPedestrianTypeNames();
    EWrestlerMassModCharProfileState GetCurrentProfileState();
    FString GetCurrentProfileInfo();
    void GenerateFromGroup(FName TypeName, int32 NumToGenerate);
    void ClearPreviewProfiles();
    void AddGoodToOutputProfiles(FName TypeName);
}; // Size: 0x490

class AWrestlerMassSpawner : public AMassSpawner
{
    FDataTableRowHandle SpawnerData;                                                  // 0x0340 (size: 0x10)
    EWrestlerPlayerMissionType Type;                                                  // 0x0350 (size: 0x1)

    void OnSpawningFinished();
    void OnMissionTypeChanged(EWrestlerPlayerMissionType CurrentMissionType);
    void OnDespawningFinished();
}; // Size: 0x358

class AWrestlerMassZGAnnotationVolume : public ATriggerBox
{
    bool bActivateOnBeginPlay;                                                        // 0x02A0 (size: 0x1)
    FZoneGraphTag AnnotationTag;                                                      // 0x02A1 (size: 0x1)

    bool IsVolumeActivated();
    void DeactivateVolume();
    void ActivateVolume();
}; // Size: 0x2A8

class AWrestlerMissionSubSystemProxy : public AHeraMissionSubSystemProxy
{
}; // Size: 0x2B8

class AWrestlerModeFrontEnd : public AWrestlerGameModeBase
{
}; // Size: 0x3E8

class AWrestlerModeInGame : public AWrestlerGameModeBase
{
    class UWrestlerWaypointComponent* WaypointComponent;                              // 0x03E0 (size: 0x8)
    class UWrestlerQuestProgressComponent* QuestProgressComponent;                    // 0x03E8 (size: 0x8)
    class UWrestlerTutorialComponent* TutorialComponent;                              // 0x03F0 (size: 0x8)
    float AbilityWheelTimeDilation;                                                   // 0x03F8 (size: 0x4)
    class AActor* TempPlayerSpawnActor;                                               // 0x0400 (size: 0x8)

    class UWrestlerWaypointComponent* GetWaypointComponent();
    class UWrestlerTutorialComponent* GetTutorialComponent();
    class UWrestlerQuestProgressComponent* GetQuestProgressComponent();
    void ClearAbilityWheelTimeDilation();
    void ApplyAbilityWheelTimeDilation();
}; // Size: 0x410

class AWrestlerModeLoadScreen : public AWrestlerGameModeBase
{
}; // Size: 0x3E0

class AWrestlerModularAIWeapon : public AActor
{

    void GetCollisionComponents(TArray<class UPrimitiveComponent*>& OutCollisionComponents, FName InCollisionTag);
}; // Size: 0x298

class AWrestlerNavigationDataChunkActor : public ANavigationDataChunkActor
{
}; // Size: 0x2E0

class AWrestlerPathPoint : public AWrestlerBasePathPoint
{
}; // Size: 0x2C8

class AWrestlerPatrolRoute : public AWrestlerBaseRoute
{
}; // Size: 0x2C0

class AWrestlerPerformanceTestActor : public AHeraPerformanceTestActor
{
    EWrestlerPerformanceCameraType CameraType;                                        // 0x0450 (size: 0x1)

}; // Size: 0x4D8

class AWrestlerPlayerController : public AHeraPlayerController
{
    bool UsingGamepad;                                                                // 0x0860 (size: 0x1)
    FWrestlerPlayerControllerOnControllerSwitched OnControllerSwitched;               // 0x0868 (size: 0x10)
    void WrestlerPlayerControllerDelegate(bool InDPad);
    class UHeraPropertyInt* GamepadTypeProperty;                                      // 0x0878 (size: 0x8)

}; // Size: 0x890

class AWrestlerPlayerParticleKillVolume : public AVolume
{
    bool bResetOnActivation;                                                          // 0x02D0 (size: 0x1)
    TSet<TSoftObjectPtr<UNiagaraSystem>> ParticleSystemExclusions;                    // 0x02D8 (size: 0x50)

}; // Size: 0x328

class AWrestlerPlayerStart : public AHeraCheckpointStartActor
{
}; // Size: 0x2F8

class AWrestlerPlayerState : public APlayerState
{
    FName ConfigDataName;                                                             // 0x0350 (size: 0x8)
    class UWrestlerTokenManager* TokenManager;                                        // 0x0358 (size: 0x8)

    class UWrestlerTokenManager* GetTokenManager();
}; // Size: 0x360

class AWrestlerPlayerStateInGame : public AWrestlerPlayerState
{
    FWrestlerPlayerStateInGameOnClanPropertyChangeEvent OnClanPropertyChangeEvent;    // 0x0368 (size: 0x10)
    void WrestlerClanPropertyChange(class UWrestlerPlayerClan* PlayerClan);
    FWrestlerPlayerStateInGameOnMissionTypePropertyChangeEvent OnMissionTypePropertyChangeEvent; // 0x0378 (size: 0x10)
    void WrestlerMissionTypeChange(EWrestlerPlayerMissionType CurrentMissionType);
    FWrestlerPlayerStateInGameOnPlayableCharacterPropertyChangeEvent OnPlayableCharacterPropertyChangeEvent; // 0x0388 (size: 0x10)
    void PlayableCharacterPropertyChange(class UWrestlerPlayerTypeDefinition* PlayableCharacter);
    FWrestlerPlayerStateInGameOnNarrativeModePropertyChangeEvent OnNarrativeModePropertyChangeEvent; // 0x0398 (size: 0x10)
    void WrestlerNarrativeModePropertyChange(bool bNarrativeMode);
    FWrestlerPlayerStateInGameOnConsumablePropertyChangeEvent OnConsumablePropertyChangeEvent; // 0x03A8 (size: 0x10)
    void WrestlerConsumablePropertyChange(EConsumableType ConsumableType, bool bHasIncreased);
    FWrestlerPlayerStateInGameOnConsumableFailedEvent OnConsumableFailedEvent;        // 0x03B8 (size: 0x10)
    void WrestlerConsumablePropertyChange(EConsumableType ConsumableType, bool bHasIncreased);
    class UHeraPropertyInt* ClanValue;                                                // 0x03C8 (size: 0x8)
    class UHeraPropertyStateTrackingList* ClanStateTrackingList;                      // 0x03D0 (size: 0x8)
    class UHeraPropertyGameplayTag* PlayerCostumeID;                                  // 0x03D8 (size: 0x8)
    class UHeraPropertyGameplayTag* PlayerHairID;                                     // 0x03E0 (size: 0x8)
    class UHeraPropertyGameplayTag* PlayerMakeUpID;                                   // 0x03E8 (size: 0x8)
    class UHeraPropertyGameplayTag* PlayerPiercingID;                                 // 0x03F0 (size: 0x8)
    class UHeraPropertyGameplayTag* PlayerEyesID;                                     // 0x03F8 (size: 0x8)
    class UHeraPropertyBool* PlayerInNarrativeMode;                                   // 0x0400 (size: 0x8)
    class UHeraPropertyGameplayTag* PlayerCharacterID;                                // 0x0408 (size: 0x8)
    int32 ConsumableCap;                                                              // 0x0410 (size: 0x4)
    class UWrestlerAttributeSet* StateAttributeSet;                                   // 0x0420 (size: 0x8)
    TMap<class EConsumableType, class UHeraPropertyInt*> ConsumableProperties;        // 0x0468 (size: 0x50)
    class UWrestlerPlayerClan* CurrentClan;                                           // 0x04C0 (size: 0x8)
    class UWrestlerPlayerTypeDefinition* CurrentPlayerType;                           // 0x04C8 (size: 0x8)
    class UWrestlerCharacterCostumesCollection* CostumesCollection;                   // 0x04D0 (size: 0x8)
    class UWrestlerCharacterHairCollection* HairCollection;                           // 0x04D8 (size: 0x8)
    class UWrestlerCharacterMakeUpCollection* MakeUpCollection;                       // 0x04E0 (size: 0x8)
    class UWrestlerCharacterPiercingCollection* PiercingCollection;                   // 0x04E8 (size: 0x8)
    class UWrestlerCharacterEyesCollection* EyesCollection;                           // 0x04F0 (size: 0x8)

    bool UpdateConsumable(EConsumableType InConsumableType, bool bShouldAdd);
    void SetUpClanAttributes(TArray<class UWrestlerAbilityDefinition*> InAbilityArray, float InMaxHealth, float InMaxBlood);
    void SetNarrativeModeEnabled(bool bInNarrativeModeEnabled);
    void SetClan(class UWrestlerPlayerClan* InClan, bool UpdateProperty);
    void OnConsumableFailed(EConsumableType InConsumableType, bool bShouldAdd);
    void MasqueradeLevelChanged(EWrestlerMasqueradeState InPrevMasqState, EWrestlerMasqueradeState InNewMasqState);
    bool IsDeadByMasquerade();
    bool IsDead();
    void InitPlayerCostume();
    float GetWalkSpeed();
    float GetShield();
    class UWrestlerCharacterPiercingDataAsset* GetPiercingDataAsset();
    class UWrestlerCharacterPiercingCollection* GetPiercingCollection();
    bool GetNarrativeModeEnabled();
    float GetMaxShield();
    float GetMaxHeightForFloorCast();
    float GetMaxHealth();
    float GetMaxBlood();
    class UWrestlerCharacterMakeUpDataAsset* GetMakeUpDataAsset();
    class UWrestlerCharacterMakeUpCollection* GetMakeUpCollection();
    float GetHeavyFallThresholdSpeed();
    float GetHealth();
    class UWrestlerCharacterHairDataAsset* GetHairDataAsset();
    class UWrestlerCharacterHairCollection* GetHairCollection();
    class UWrestlerCharacterEyesDataAsset* GetEyesDataAsset();
    class UWrestlerCharacterEyesCollection* GetEyesCollection();
    class UWrestlerCharacterCostumesCollection* GetCostumesCollection();
    class UWrestlerCharacterCostumeDataAsset* GetCostumeDataAsset();
    class UWrestlerPlayerClan* GetClan();
    int32 GetCharacterLevel();
    float GetBlood();
    class UWrestlerAttributeSet* GetAttributeSet();
    float GetAttackPower();
    void Death();
    bool CanCollectConsumable(EConsumableType InConsumableType);
}; // Size: 0x500

class AWrestlerPropVent : public AHeraFXMassActor
{
}; // Size: 0x2A8

class AWrestlerRangedProjectile : public AActor
{
    float GravityScale;                                                               // 0x0298 (size: 0x4)
    TEnumAsByte<ETraceTypeQuery> TraceChannel;                                        // 0x029C (size: 0x1)
    bool bShouldTraceComplex;                                                         // 0x029D (size: 0x1)
    TArray<class AActor*> ActorsToIgnore;                                             // 0x02A0 (size: 0x10)
    float MaxLifeSpan;                                                                // 0x02B0 (size: 0x4)
    FVector Velocity;                                                                 // 0x02B8 (size: 0x18)
    float MaxDistance;                                                                // 0x02D0 (size: 0x4)
    float Speed;                                                                      // 0x02D4 (size: 0x4)
    float AccumulatedDistance;                                                        // 0x02D8 (size: 0x4)
    float DamageAmount;                                                               // 0x02DC (size: 0x4)
    FVector Gravity;                                                                  // 0x02E0 (size: 0x18)
    float CurrentLifeSpan;                                                            // 0x02F8 (size: 0x4)
    bool bHasCollided;                                                                // 0x02FC (size: 0x1)

    void ReturnToPool();
    void ProjectileActivated();
    float GetDamageAmount();
    void CollisionImpact(FHitResult OutHit);
}; // Size: 0x300

class AWrestlerScreenCaptureActor : public AActor
{
    TArray<FBufferToCapture> BuffersToCapture;                                        // 0x0298 (size: 0x10)
    class UTextureRenderTarget2D* DestinationTextureBackBuffer;                       // 0x02A8 (size: 0x8)

}; // Size: 0x2C0

class AWrestlerSeamlessTransitionActor : public AWrestlerTransitionActor
{
    FGameplayTag PlayerStartTag;                                                      // 0x02E0 (size: 0x8)

    void OnSeamlessTransitionStateChanged(EWrestlerSeamlessTravelStatus OldState, EWrestlerSeamlessTravelStatus NewState);
    FGameplayTag GetPlayerStartGameplayTag();
}; // Size: 0x2E8

class AWrestlerSearchRoute : public AWrestlerBaseRoute
{
    int32 AvailableSlots;                                                             // 0x02C0 (size: 0x4)

    void ReleaseSlot(class AActor* InActor);
    bool HasSlotAvailable();
    void ClaimSlot(class AActor* InActor);
}; // Size: 0x2D8

class AWrestlerSmartObjectDataActor : public AWrestlerSmartObjectSyncActor
{
}; // Size: 0x298

class AWrestlerSmartObjectDataTableActor : public AActor
{
    TMap<class FName, class FDataTableRowHandle> DataTableRows;                       // 0x0298 (size: 0x50)

}; // Size: 0x2E8

class AWrestlerSmartObjectMeshActor : public AWrestlerSmartObjectSyncActor
{
}; // Size: 0x298

class AWrestlerSmartObjectSyncActor : public AActor
{
}; // Size: 0x298

class AWrestlerStateTreeEventVolume : public AWrestlerVolumeBase
{
    FGameplayTag EventTag;                                                            // 0x02D0 (size: 0x8)

    void HandleActorSpawnedInVolume(class AWrestlerEnemyCharacter* InEnemyCharacter);
}; // Size: 0x2D8

class AWrestlerStealthCoverVolume : public AWrestlerVolumeBase
{
}; // Size: 0x2D0

class AWrestlerTargetPoint : public ATargetPoint
{
}; // Size: 0x298

class AWrestlerTeleportTargetPoint : public AWrestlerTargetPoint
{
    class UHeraMissionActorComponent* HeraMissionActorComponent;                      // 0x02A0 (size: 0x8)
    class UWorldPartitionStreamingSourceComponent* WorldPartitionStreamingSourceComponent; // 0x02A8 (size: 0x8)

    bool IsStreamingEnabled();
    void EnableStreaming();
    void DisableStreaming();
}; // Size: 0x2C0

class AWrestlerTokenSinkTestActor : public APawn
{
    class UWrestlerToken* HeldToken;                                                  // 0x0320 (size: 0x8)
    class UWrestlerTokenManager* SourceTokenManager;                                  // 0x0328 (size: 0x8)
    FString Status;                                                                   // 0x0330 (size: 0x10)
    FColor DebugColor;                                                                // 0x0340 (size: 0x4)

    void OnTokenStolen(const FWrestlerTokenRequestQuery& InStealersRequest);
    FString GetStatus();
    FColor GetDebugColor();
    void DoAttack();
}; // Size: 0x360

class AWrestlerTokenSourceTestActor : public AActor
{
    FName ConfigDataName;                                                             // 0x0298 (size: 0x8)
    class UWrestlerTokenManager* TokenManager;                                        // 0x02A0 (size: 0x8)

    class UWrestlerTokenManager* GetTokenManager();
}; // Size: 0x2A8

class AWrestlerTransitionActor : public AActor
{
    FGameplayTag LocationTagA;                                                        // 0x02A0 (size: 0x8)
    FGameplayTag LocationTagB;                                                        // 0x02A8 (size: 0x8)
    class UBoxComponent* LocationVolumeComponentA;                                    // 0x02B0 (size: 0x8)
    class UBoxComponent* LocationVolumeComponentB;                                    // 0x02B8 (size: 0x8)
    class UWorldPartitionStreamingSourceComponent* WorldPartitionStreamingSourceComponent; // 0x02C0 (size: 0x8)
    class UHeraMissionObjective* MissionScriptObjectiveToRaiseOnFinish;               // 0x02C8 (size: 0x8)
